{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2019/11/1198830998563115008/",
            "url": "https://mirror.roytang.net/2019/11/1198830998563115008/",
            "path": "/2019/11/1198830998563115008/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/jaymelynilao/\"\u003e@jaymelynilao\u003c/a\u003e i-pirate mo na sila to move there lol\u003c/p\u003e\n",
            "summary": "@jaymelynilao i-pirate mo na sila to move there lol",
            "date_published": "2019-11-25T05:09:17+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1198830998563115008/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198830998563115008/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1198829506443628545/",
            "url": "https://mirror.roytang.net/2019/11/1198829506443628545/",
            "path": "/2019/11/1198829506443628545/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/jaymelynilao/\"\u003e@jaymelynilao\u003c/a\u003e bakit? miss mo na si dating work? lol\u003c/p\u003e\n",
            "summary": "@jaymelynilao bakit? miss mo na si dating work? lol",
            "date_published": "2019-11-25T05:03:22+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1198829506443628545/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198829506443628545/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/costs-of-corruption/",
            "url": "https://mirror.roytang.net/2019/11/costs-of-corruption/",
            "path": "/2019/11/costs-of-corruption/",
            "title": "The Costs of Corruption",
            "content_html": "\u003cp\u003eA quick follow-up to something I mentioned in \u003ca href=\"/2019/11/laws-not-men/\"\u003eyesterday\u0026rsquo;s post\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eIt is a cultural problem too. Even we the citizens have little respect for rules and laws and try to skip around them when we can. This is why we have fixers, and connections, and patronage. We trade on favors to get us out of trouble.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI\u0026rsquo;m not sure if needed to be said, but I wasn\u0026rsquo;t saying that literally every single person participates in fixing and patronage to get around the rules. Most probably only a minority ever do so. The majority try to just keep their heads down and live their lives, and in doing so, they tolerate those who do participate in such corruption of the rules. This is what I meant, that we as a culture, are too tolerant of such activities, even sometimes praising those who manage to circumvent rules or laws as \u0026ldquo;madiskarte\u0026rdquo;.\u003c/p\u003e\n\u003cp\u003eTangential story time: Some time ago, I was visiting with people in another area, and the conversation turned to one of the people present who had run for public office (councilor) some years ago, and he was asked why he didn\u0026rsquo;t win. His answer: \u003cem\u003e\u0026ldquo;Wala e, mas malakas maglagay yung kalaban.\u0026quot;\u003c/em\u003e  (The opponent was better at bribing voters.) The response elicited laughter from those around. Whether the response was based on fact or merely a speculative joke, the way it is discussed so casually and even among people they barely knew (me) is reflective of how we have normalized corruption in our society. There is no shame associated with it, it is talked about openly as a fact of life.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s easy to say, \u0026ldquo;I don\u0026rsquo;t want to make a scene, I\u0026rsquo;ll just keep quiet and live my life, and I\u0026rsquo;ll be a good citizen and I won\u0026rsquo;t participate in corruption myself,\u0026rdquo; but even if you do so, systemic corruption still affects you. Even if you\u0026rsquo;re an informal worker who doesn\u0026rsquo;t pay taxes; the cost of corruption isn\u0026rsquo;t only in lost taxes, it\u0026rsquo;s in lost public services and opportunities lost to connections and patronage. Normalized corruption also means more rules need to be introduced to rein it in, and more rules means more people want to try to break those rules, leading to some kind of vicious cycle. The increased red tape brought about by corruption even feeds the beast and inconveniences the rest of us who just want to be good citizens.\u003c/p\u003e\n\u003cp\u003eGiven our current leadership, I had been thinking recently about what an actual good administration would look like. In my view, the point of presidency shouldn\u0026rsquo;t just be to execute the laws, but to provide an example of leadership for the people, in that he/she inspires the people to be better. I don\u0026rsquo;t yet know how it can be done, but for any one president to be able to turn this country around, he needs to be able to inspire the citizenry to not just be good citizens, but to be better than that. A great president will need to understand that the success of his term doesn\u0026rsquo;t depend solely on him and his appointees, but rather on each citizen taking a stand against the normalized corruption in our culture.\u003c/p\u003e\n\u003cp\u003eThis might be a bit difficult for a president limited to a six year term, certainly a lot of political will is needed. And not the kind that you \u003ca href=\"/2016/11/10155101341788912/\"\u003esquander on political favors\u003c/a\u003e. A tall order, but we as a country should be better for the trying. Again, maybe someday.\u003c/p\u003e\n",
            "summary": "A quick follow-up to something I mentioned in yesterday\u0026rsquo;s post:\n It is a cultural problem too. Even we the citizens have little respect for rules and laws and try to skip around them when we can. This is why we have fixers, and connections, and patronage. We trade on favors to get us out of trouble.\n I\u0026rsquo;m not sure if needed to be said, but I wasn\u0026rsquo;t saying that literally every single person participates in fixing and patronage to get around the rules.",
            "date_published": "2019-11-25T00:00:00+00:00",
            "date_modified": "2019-11-25T12:00:03+00:00",
            "section": "post",
            "source_path": "post/2019/11/costs-of-corruption/index.md"
            , "tags": ["philippines","current events"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198859775225815040/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1198859775225815040#favorited-by-12953232",
                    "source_file": "like-20191125T113339-webmention-727651.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1198558259440865282/",
            "url": "https://mirror.roytang.net/2019/11/1198558259440865282/",
            "path": "/2019/11/1198558259440865282/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/momblogger/\"\u003e@momblogger\u003c/a\u003e \u003ca href=\"https://twitter.com/lenirobredo/\"\u003e@lenirobredo\u003c/a\u003e looks like the answer to \u0026ldquo;handa na ba kayo sakin?\u0026rdquo; was \u0026ldquo;no\u0026rdquo;\u003c/p\u003e\n",
            "summary": "@momblogger @lenirobredo looks like the answer to \u0026ldquo;handa na ba kayo sakin?\u0026rdquo; was \u0026ldquo;no\u0026rdquo;",
            "date_published": "2019-11-24T11:05:31+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1198558259440865282/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198558259440865282/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/laws-not-men/",
            "url": "https://mirror.roytang.net/2019/11/laws-not-men/",
            "path": "/2019/11/laws-not-men/",
            "title": "Laws Not Men",
            "content_html": "\u003cp\u003eIn yet another example of what is wrong with this country, the \u003ca href=\"https://www.philstar.com/headlines/2019/11/21/1970619/pnp-begins-enforcing-vape-ban-duterte-warns-courts\"\u003ePNP are planning to arrest vape users\u003c/a\u003e after \u003ca href=\"https://cnnphilippines.com/news/2019/11/19/Rodrigo-Duterte-vape-ban.html\"\u003eDuterte\u0026rsquo;s directive\u003c/a\u003e, despite there actually being yet no law or executive order banning vaping. Thus, the arrests are meaningless and merely another form of harassment.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003ePNP spokesman Brig. Gen. Bernard Banac explained that while violators would be apprehended, they would be released immediately after the incident is recorded in the police blotter.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eNobody knows that the rules for this so-called ban are:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eFerdinand Rodrigo, president of Vapers Alliance Philippines, told “The Chiefs” last night on Cignal TV’s One News that they wanted to seek clarification from Malacañang on the basis for the ban and its parameters.\u003c/p\u003e\n\u003cp\u003eRodrigo said their members across the country reported having police teams entering vape shops yesterday and telling them to shut down, which was not how they understood Duterte’s order.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI don\u0026rsquo;t vape, and I don\u0026rsquo;t actually know people who vape, and I don\u0026rsquo;t know whether or not vaping is bad for people (though it seems like a terrible idea), but that doesn\u0026rsquo;t mean I can agree with what is basically a \u0026ldquo;rule by whim\u0026rdquo;, with unknown basis and parameters. The police are following along with this basically because the president said so, and to defy him is to incur his wrath. And the president even threatened the judiciary not to interfere with his whims.\u003c/p\u003e\n\u003cp\u003eThere is some analogy here to how the brutal war on drugs is conducted. The president threatens to kill drug users, and the police silently take that as an implicit order. There is no actual paperwork ordering killings, but wink wink nudge nudge, the police get to infer what the president want.\u003c/p\u003e\n\u003cp\u003eIt shows how much weight we as a nation give to laws - barely any at all. Laws are treated as little more than suggestions, and law enforcers can implement whatever they damn want.\u003c/p\u003e\n\u003cp\u003eAuthoritarians love ruling in this manner, and their supporters like to claim it\u0026rsquo;s because they \u0026ldquo;get things done\u0026rdquo; without all the bureaucratic runaround that legislation requires. Getting rid of due process in order to get good things done quickly seems like a reasonable idea on the surface, but due process is there for a reason, and if you can\u0026rsquo;t be bothered to uphold it when you\u0026rsquo;re doing good, how will you be bothered to uphold it when you\u0026rsquo;re abusing power.\u003c/p\u003e\n\u003cp\u003eIt is a cultural problem too. Even we the citizens have little respect for rules and laws and try to skip around them when we can. This is why we have fixers, and connections, and patronage. We trade on favors to get us out of trouble.\u003c/p\u003e\n\u003cp\u003eGranted, we don\u0026rsquo;t always have the best laws, and enforcement is always hard, and justice is often elusive especially to the poor. But that should be used as a reason to improve the laws and to improve enforcement and to improve the justice system, not as a reason to skip past the law altogether and just do whatever the men in power so decide.\u003c/p\u003e\n\u003cp\u003eMaybe someday we\u0026rsquo;ll get there, but right now we are decidedly governed not by laws, but by men.\u003c/p\u003e\n",
            "summary": "In yet another example of what is wrong with this country, the PNP are planning to arrest vape users after Duterte\u0026rsquo;s directive, despite there actually being yet no law or executive order banning vaping. Thus, the arrests are meaningless and merely another form of harassment.\n PNP spokesman Brig. Gen. Bernard Banac explained that while violators would be apprehended, they would be released immediately after the incident is recorded in the police blotter.",
            "date_published": "2019-11-24T02:47:57+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/laws-not-men/index.md"
            , "tags": ["philippines","current events"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198444554480967680/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/one-year-with-hugo/",
            "url": "https://mirror.roytang.net/2019/11/one-year-with-hugo/",
            "path": "/2019/11/one-year-with-hugo/",
            "title": "One Year with Hugo: Highs and Lows",
            "content_html": "\u003cp\u003eIt was a bit more than a year ago that I decided to \u003ca href=\"/2018/11/site-migration-from-wordpress-to-hugo/\"\u003ehaphazardly and suddenly migrate from Wordpress to Hugo\u003c/a\u003e. It\u0026rsquo;s a good time to look back and reflect on that decision and consider where we are now, and how to move forward.\u003c/p\u003e\n\u003cp\u003eGood:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI am extremely happy with the site\u0026rsquo;s browser performance. It currently scores an insanely high 96 on \u003ca href=\"https://developers.google.com/speed/pagespeed/insights/?url=https%3A%2F%2Froytang.net\"\u003eGoogle\u0026rsquo;s Pagespeed tool\u003c/a\u003e, and I\u0026rsquo;m pretty sure I I know how to close the remaining 4% gap. (I just need to get around to it.)\u003c/li\u003e\n\u003cli\u003egenerally all the advantages listed in the original post a year ago. I\u0026rsquo;m particularly happy with managing the posts through the file system, especially with a decent editor like VS Code. I don\u0026rsquo;t miss Wordpress\u0026rsquo;s clunky editor at all.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBad:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe main sticking point right now is that the build time is really high. I have a Travis build script setup that automatically builds the hugo site from source whenever I push a new commit, then the output is committed to a second repo, which is the one deployed to the live site every 15 minutes. This build right now takes on average around 8 mins, which is ridiculous. The hugo build itself takes around 3 mins, the rest is copying files and git clones and push and so on. The build times really skyrocketed when I did the \u003ca href=\"/2019/10/archive-of-my-own/\"\u003esocial media archiving\u003c/a\u003e, since the number of markdown files skyrocketed from around 1000 to almost 16,000. For sure, a lot of it is the fault of the theme I am using on this site, because I am adding a lot of features like static comments, image resizing, monthly archives, a bunch of taxonomies, and so on. I don\u0026rsquo;t blame Hugo at all, and I\u0026rsquo;m pretty sure any other static site generator would simply choke on the amount of posts I have. There are surely a lot of optimizations that can be done, but even if I manage to pare down the template generation to bare minimum, I am most probably hitting the limits on disk I/O. As mentioned in \u003ca href=\"https://discourse.gohugo.io/t/performance-expectations-for-large-number-of-pages/21887\"\u003ethis discussion I had on the Hugo forums\u003c/a\u003e, simply copying the entire content folder already takes 30 seconds on my local computer, so that is the bare minimum I could go. This is not an intolerable problem, but it means I don\u0026rsquo;t have immediate feedback when I push a post, it can take at least 15 minutes or more for recent changes.\u003c/li\u003e\n\u003cli\u003eThere are also a number of dynamic features I want to implement, which are impossible with just a static website. I have a python web app backing the static hugo site which I use for things like search, comments, and so on, but basically there is nontrivial effort when I want to implement new things. This is even less of an issue than the last one, mostly because I enjoy working with Python anyway lol.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe build performance is such a big issue for me that I briefly considered the option of migrating back to Wordpress. Ha! I\u0026rsquo;m not ruling it out, but the fact is I find managing posts through the Wordpress interface to be extremely clunky, especially compared to my current set up.\u003c/p\u003e\n\u003cp\u003eAnother option would be to write my own database-backed webapp. This is something I\u0026rsquo;ve done before after all, and again, I enjoy working on Python anyway. But it\u0026rsquo;s a lot of work, so maybe shelve that for now.\u003c/p\u003e\n\u003cp\u003eMoving forward, I think I\u0026rsquo;m going to stay with my current static hugo + dynamic python support, and try to optimize the build time as much as I can. I will probably be on the look out for possible alternative solutions, some other blogging software perhaps, or some other hybrid approach.\u003c/p\u003e\n",
            "summary": "It was a bit more than a year ago that I decided to haphazardly and suddenly migrate from Wordpress to Hugo. It\u0026rsquo;s a good time to look back and reflect on that decision and consider where we are now, and how to move forward.\nGood:\n I am extremely happy with the site\u0026rsquo;s browser performance. It currently scores an insanely high 96 on Google\u0026rsquo;s Pagespeed tool, and I\u0026rsquo;m pretty sure I I know how to close the remaining 4% gap.",
            "date_published": "2019-11-22T19:48:47+00:00",
            "date_modified": "2020-02-07T15:30:02+00:00",
            "section": "post",
            "source_path": "post/2019/11/one-year-with-hugo/index.md"
            , "tags": ["tech life","blogging","hugo"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1198008086260338689/"}]
            
            , "comments": [
                { 
                    "url": "http://bit.ly/2ECXoDa",
                    "source_file": "comment-20200122-064924-1a58e33d-7ac1-4504-b921-211924c8571a.json"
                }, { 
                    "url": "http://paulcapewell.com/2020/02/07/stuff-ive-seen-and-read-recently-january-2020/",
                    "source_file": "comment-20200207T150121-webmention-753342.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/new-video-card/",
            "url": "https://mirror.roytang.net/2019/11/new-video-card/",
            "path": "/2019/11/new-video-card/",
            "title": "New Video Card!",
            "content_html": "\u003cp\u003eThis is a follow up to my previous \u003ca href=\"/2019/08/the-great-memory-scare-of-2019/\"\u003eposts\u003c/a\u003e about my \u003ca href=\"/2019/09/two-backups/\"\u003e2019 PC troubles\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI was still encountering game crashes even after reinstalling the OS, so the most likely culprits now were either the video card or the power supply. I sent the video card over to my brother for him to test on his PC to see if he encountered the same symptoms. Sure enough, he couldn\u0026rsquo;t even run the 3DMARK Time Spy test without immediately crashing, which was the same when it was on my PC.\u003c/p\u003e\n\u003cp\u003eSince then I\u0026rsquo;ve been running on onboard graphics only, which luckily could still handle things like Starcraft II, Magic Arena and Eternal. Oh, and I had to live on a single monitor, like a savage!\u003c/p\u003e\n\u003cp\u003eI began canvassing last month for a new video card. I didn\u0026rsquo;t want to get anything super expensive, so I thought I\u0026rsquo;d keep the budget under 10k PHP (around $200). I also have a preference for NVidia/GeForce since the one time I tried an AMD I had an overclocking issue and had to replace the card within a couple of months (this was almost entirely my fault though!).\u003c/p\u003e\n\u003cp\u003eGiven that, the best (most recent) NVidia card in my price range was this year\u0026rsquo;s GTX1650. Unfortunately, reviews said this was not good value for money, as it was comparable in performance to the older and slightly cheaper AMD RX570 card. I also looked at a couple of cards above my budget line, namely the recently released GTX1650 Super and GTX1660 Super. The price difference between the two wasn\u0026rsquo;t too high, so I figured the 1660S was a better deal overall, but it was around $100 more expensive than the RX570.\u003c/p\u003e\n\u003cp\u003eSo the choice now was the cheaper RX570, which would be an upgrade anyway over my old GTX 970, or the more expensive GTX 1660 Super. Getting the more expensive card was a bit more future proof, but the problem is that this rig overall is already going on 4 years old, so I might need to upgrade everything again in a couple of years anyway. I figured it was better to get the cheaper card first then decide a few years down the line whether I needed a complete refresh.\u003c/p\u003e\n\u003cp\u003eUnfortunately, when I checked my nearby PC part stores, neither the RX570 nor the GTX1660S were in stock. (The first one due to high demand, the second due to maybe being too new?). Against my instincts, I decided to just order online from Lazada.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not yet a fan of buying electronics online in the Philippines. Online purchases for me are fine for digital products or physical things that are relatively cheap. But for expensive electronics, I have some anxiety that there\u0026rsquo;s so much that could go wrong. And I had some friends with bad stories about shady/sloppy Lazada sellers too. I also prefer getting my components from a store because (a) I don\u0026rsquo;t have to wait for delivery; and (b) I can ask them to test the part right there and then to make sure no issues before I bring it home.\u003c/p\u003e\n\u003cp\u003eIn this case I had no choice, so online it was. Luckily, I found that one of my nearby PC part stores EasyPC was also a Lazada seller, and they had RX570 in stock online. I settled on a Gigabyte 4GB RX570, then waited the requisite number of days.\u003c/p\u003e\n\u003cp\u003eThe package arrived yesterday, a day earlier than predicted. I unboxed it and set about installing the card. I have some anxiety as well about installing PC parts myself, as I\u0026rsquo;m always worried that I\u0026rsquo;ll do some damage via static electricity or my sweat dropping down into the PC case or something like that. But this time went smoothly. These new video cards are nice because they have back plates making them easier to grip. The only problem I encountered was that I didn\u0026rsquo;t have an extra screw to pin the card unto the back of the case (I\u0026rsquo;ll get one later).\u003c/p\u003e\n\u003cp\u003eAnyway, plugged the card into pci-e, connect the 8-pin power connector, plug in both monitors, then boot! Success! I got my 2nd monitor back!\u003c/p\u003e\n\u003cp\u003eI installed the latest AMD drivers, then to verify everything was fine, I ran the 3DMARK Timespy benchmark test. The test scored my system at \u003ca href=\"https://www.3dmark.com/spy/9343394\"\u003earound 3600+\u003c/a\u003e, which wasn\u0026rsquo;t too bad. Comparing to results using my old card and the same CPU, those scores were around 1700+, so there\u0026rsquo;s a significant improvement. With the 1650, it would have been 3600+ as well. The results said I\u0026rsquo;m only better than 19% of all results, but that\u0026rsquo;s ok, I\u0026rsquo;m not looking for super high end graphics at super high resolutions and I rarely care about framerate.\u003c/p\u003e\n\u003cp\u003eNext were the game tests!\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStarcraft II at Ultra settings: No crashes! Which is great, since all of this started with SC2 anyway\u003c/li\u003e\n\u003cli\u003eStreet Fighter V: Smooth! I had tried SFV before with onboard graphics, but it was basically super slow.\u003c/li\u003e\n\u003cli\u003eTales of Berseria: Smooth! I chose this game because I\u0026rsquo;ve been meaning to play it. It didn\u0026rsquo;t do too well with the onboard graphics either.\u003c/li\u003e\n\u003cli\u003eDragon Ball Fighter Z: Smooth!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAlright, everything looks good! I\u0026rsquo;ll probably be testing the card with a few other games over the weekend, but otherwise everything looks great!\u003c/p\u003e\n",
            "summary": "This is a follow up to my previous posts about my 2019 PC troubles.\nI was still encountering game crashes even after reinstalling the OS, so the most likely culprits now were either the video card or the power supply. I sent the video card over to my brother for him to test on his PC to see if he encountered the same symptoms. Sure enough, he couldn\u0026rsquo;t even run the 3DMARK Time Spy test without immediately crashing, which was the same when it was on my PC.",
            "date_published": "2019-11-22T00:00:00+00:00",
            "date_modified": "2019-11-23T05:46:16+08:00",
            "section": "post",
            "source_path": "post/2019/11/new-video-card/index.md"
            , "tags": ["tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1197698518749786114/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1197560294203019264/",
            "url": "https://mirror.roytang.net/2019/11/1197560294203019264/",
            "path": "/2019/11/1197560294203019264/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/rovietoosin/\"\u003e@rovietoosin\u003c/a\u003e big time!\u003c/p\u003e\n",
            "summary": "@rovietoosin big time!",
            "date_published": "2019-11-21T16:59:58+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1197560294203019264/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1197560294203019264/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/f87qn24/",
            "url": "https://mirror.roytang.net/2019/11/f87qn24/",
            "path": "/2019/11/f87qn24/",
            "title": "",
            "content_html": "\u003cp\u003eNo one can answer this because no law, ordinance or executive order has been released detailing the rules. Basically its the whim of the authorities\u003c/p\u003e\n",
            "summary": "No one can answer this because no law, ordinance or executive order has been released detailing the rules. Basically its the whim of the authorities",
            "date_published": "2019-11-21T12:44:01+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/f87qn24/index.md"
            , "tags": ["Philippines"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/Philippines/comments/dzepfe/what_case_to_file_vs_arrested_vape_users_wala/f87qn24/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/f87hjyz/",
            "url": "https://mirror.roytang.net/2019/11/f87hjyz/",
            "path": "/2019/11/f87hjyz/",
            "title": "",
            "content_html": "\u003cp\u003eWhats with blue restaurants?\u003c/p\u003e\n",
            "summary": "Whats with blue restaurants?",
            "date_published": "2019-11-21T10:42:29+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/f87hjyz/index.md"
            , "tags": ["webcomics"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/webcomics/comments/dzcmdg/what_do_hong_kongers_feel_today/f87hjyz/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/grab-overpricing/",
            "url": "https://mirror.roytang.net/2019/11/grab-overpricing/",
            "path": "/2019/11/grab-overpricing/",
            "title": "Grab Overpricing",
            "content_html": "\u003cp\u003eSo the Philippine Competition Commission recently \u003ca href=\"https://www.philstar.com/business/2019/11/19/1969865/grab-fined-p23-million-overcharging\"\u003efined rideshare provider Grab P23M for overcharging their customers\u003c/a\u003e. Apparently only P5M of that is meant to go back to the affected riders, which seems like a piddly amount considering the number of riders in the Philippines. We\u0026rsquo;ll see how of that I actually get credited back, if any.\u003c/p\u003e\n\u003cp\u003eGrab pricing has been steadily increasing since Uber exited the market early last year. The other day Grab wanted to charge me a bit over P400 for a 13km ride to a commercial area, which seemed insane. I ended up just going out and taking a taxi back and forth, and that cost me a total of P500 both ways. So Grab was pricing the ride at around 60% higher than the equivalent taxi ride. This was on a Sunday afternoon (typically the lightest traffic day of the week), and the ride took only around 30 mins.\u003c/p\u003e\n\u003cp\u003eThe pricing was never this bad with Uber; looking at my records, my most expensive Uber ride was for P412 pesos to Taguig, and that was a 21km ride that took an hour and a half!\u003c/p\u003e\n\u003cp\u003eOne can\u0026rsquo;t help but feel that Grab\u0026rsquo;s really pushing the pricing due to their monopoly. We were promised that there would be new entrants coming in to compete with Grab, but other than motorcycle service Angkas, none have actually come out. And so for now, we suffer their predatory pricing. Hopefully the PCC is more able to keep them in check in the days to come.\u003c/p\u003e\n",
            "summary": "So the Philippine Competition Commission recently fined rideshare provider Grab P23M for overcharging their customers. Apparently only P5M of that is meant to go back to the affected riders, which seems like a piddly amount considering the number of riders in the Philippines. We\u0026rsquo;ll see how of that I actually get credited back, if any.\nGrab pricing has been steadily increasing since Uber exited the market early last year. The other day Grab wanted to charge me a bit over P400 for a 13km ride to a commercial area, which seemed insane.",
            "date_published": "2019-11-21T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/grab-overpricing/index.md"
            , "tags": ["tech life","current events","philippines"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1197335006806519808/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/five-am/",
            "url": "https://mirror.roytang.net/2019/11/five-am/",
            "path": "/2019/11/five-am/",
            "title": "Five AM",
            "content_html": "\u003cp\u003eThe world looks a bit different at 5 AM.\u003c/p\u003e\n\u003cp\u003eIn a bid to get back into the daily walking groove, I\u0026rsquo;m trying to shift back my daily walks to early in the morning, before breakfast. Recently I\u0026rsquo;ve been doing it in the afternoons or early evenings, but walking in the mornings has the distinct advantage that if for some reason I am unable to do it (maybe because I was super tired from the previous day, or the weather doesn\u0026rsquo;t cooperate, or just plain laziness), I have the rest of the day to catch up on it.\u003c/p\u003e\n\u003cp\u003eThis of course assuming I am able to wake up early enough. I don\u0026rsquo;t use an alarm anymore nowadays, I find that that I don\u0026rsquo;t need to. I\u0026rsquo;m not one of those people who don\u0026rsquo;t understand how morning people can exist; I don\u0026rsquo;t have a problem naturally waking up early in the morning, unless I\u0026rsquo;m in one of my extended \u003ca href=\"/2019/08/out-of-sync-with-the-world/\"\u003e\u0026ldquo;out of sync with the world\u0026rdquo;\u003c/a\u003e phases (in which case I have a bigger problem). Lately my sleep cycle has been pretty good. I\u0026rsquo;m able to naturally wake up early even though I usually go to sleep past 12. (I simply catch up with a couple more hours sleep after breakfast.)\u003c/p\u003e\n\u003cp\u003eThe Philippines isn\u0026rsquo;t one of those countries where sunrise time varies greatly depending on the season. Dawn usually breaks sometime between 5-6 am, even this late in the year. So walking outside at this time gives you the chance to see the sky transition from a drab night gray to whatever color it wants to be that day.\u003c/p\u003e\n\u003cp\u003eThe streets aren\u0026rsquo;t very busy at 5 AM, though some of the usually busy intersections already have a short queue, a hint of things to come for the days ahead. And even at this early hour, school buses are up and about picking up kids. At 5AM! What time are those kids waking up, 4:30? That\u0026rsquo;s insane. When I was in grade school, I think the earliest I got up was around 5:30, and even then I was basically a zombie that my mom had to drag to the sink so she could splash some water on my face. I understand that these days in Metro Manila, early pickups are necessary due to the traffic situation, but I really feel for those kids.\u003c/p\u003e\n\u003cp\u003eA number of establishments are already open at 5AM, including the neighborhood bakery, the nearby Jollibee (24 hrs) and Starbucks (I think also 24 hrs)? On the streets there are already jeeps queued up and filling with passengers, again waking up early to face the menace of Metro Manila traffic.\u003c/p\u003e\n\u003cp\u003eMy walk usually takes around 45 minutes. It\u0026rsquo;s not quite the \u0026ldquo;recommended\u0026rdquo; 10k daily steps that I used to be able to do, but we\u0026rsquo;ll get there someday. For now, I turn down the road leading back to our subdivision and look forward to breakfast.\u003c/p\u003e\n",
            "summary": "The world looks a bit different at 5 AM.\nIn a bid to get back into the daily walking groove, I\u0026rsquo;m trying to shift back my daily walks to early in the morning, before breakfast. Recently I\u0026rsquo;ve been doing it in the afternoons or early evenings, but walking in the mornings has the distinct advantage that if for some reason I am unable to do it (maybe because I was super tired from the previous day, or the weather doesn\u0026rsquo;t cooperate, or just plain laziness), I have the rest of the day to catch up on it.",
            "date_published": "2019-11-20T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/5-am/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196972579342475266/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/mtg-bannings/",
            "url": "https://mirror.roytang.net/2019/11/mtg-bannings/",
            "path": "/2019/11/mtg-bannings/",
            "title": "MTG: The bannings will continue until morale improves",
            "content_html": "\u003cp\u003eThe past few years have not been good for competitive balance in MTG. Following yesterday\u0026rsquo;s deservedly heavy-handed \u003ca href=\"https://magic.wizards.com/en/articles/archive/news/november-18-2019-banned-and-restricted-announcement\"\u003eB\u0026amp;R announcement\u003c/a\u003e, standard is now at 14 cards banned since 2017. Before 2017, the standard bannings have been relatively sparse. Working backwards:\u003c/p\u003e\n\u003cp\u003e2011 - cawblade standard, 2 cards banned\n2005 - affinity standard, 8 cards banned\n2004 - skullclamp banned\n1998-1999 - the infamous \u003ca href=\"https://mtg.gamepedia.com/Combo_Winter\"\u003ecombo winter\u003c/a\u003e, 9 cards banned\u003c/p\u003e\n\u003cp\u003eSo this period from 2017-2019 has seen the most bannings since the affinity era, and may even be comparable to the unquestionably disaster that was Urza block in `98-99.\u003c/p\u003e\n\u003cp\u003eThe ironic thing is that since 2017, Wizards has instituted a Play Design team within their R\u0026amp;D to help manage the play balance of their competitive formats. The Play Design team supposedly looks at sets around a year before release, so responsibility for the failures in playtesting that led to the unbalanced environments in 2018 and 2019 largely fall on them. They came out with an article yesterday \u003ca href=\"https://magic.wizards.com/en/articles/archive/feature/play-design-lessons-learned-2019-11-18\"\u003eacknowledging the shortcomings of Play Design\u003c/a\u003e, so at least they are aware and taking responsibility.\u003c/p\u003e\n\u003cp\u003eMost of the bannings are caused by one or more of the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003echeating on mana costs (aetherworks marvel, once upon a time)\u003c/li\u003e\n\u003cli\u003esuper pushed cards (oko, veil of summer, smuggler\u0026rsquo;s copter)\u003c/li\u003e\n\u003cli\u003elinear, parasitic mechanics they didn\u0026rsquo;t know how to balance (energy)\u003c/li\u003e\n\u003cli\u003ecards that faced less opposition after rotation (field of the dead)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSo, if I were the play design team, I would pay special attention to these things as they pass through play testing:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3 mana planeswalkers\u003c/li\u003e\n\u003cli\u003echeating on mana costs\u003c/li\u003e\n\u003cli\u003enew mechanics, especially linear, parasitic mechanics\u003c/li\u003e\n\u003cli\u003ecards that generate free resources for no additional cost (field of the dead)\u003c/li\u003e\n\u003cli\u003ecards whose answers are rotating out\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThese days I really only play Standard on Magic Arena, not much on paper, but it\u0026rsquo;s still interesting to follow. The high power level is kind of a good indicator in that we know they are pushing cards and trying to find the limits of an exciting competitive environment, but it also means they have to be super careful. Even some pros \u003ca href=\"https://twitter.com/PVDDR/status/1196463680671637504\"\u003ewere complaining\u003c/a\u003e that some of their expensive decks were now worthless after the bans, so the consecutive bannings are really bad for the playerbase and disincentivizing them from investing in the game.\u003c/p\u003e\n\u003cp\u003eI do hope the play design team has learned its lessons, and hopefully we start to get a more balanced competitive environment once Theros 2: Elspeth Boogaloo rolls out early next year.\u003c/p\u003e\n",
            "summary": "The past few years have not been good for competitive balance in MTG. Following yesterday\u0026rsquo;s deservedly heavy-handed B\u0026amp;R announcement, standard is now at 14 cards banned since 2017. Before 2017, the standard bannings have been relatively sparse. Working backwards:\n2011 - cawblade standard, 2 cards banned 2005 - affinity standard, 8 cards banned 2004 - skullclamp banned 1998-1999 - the infamous combo winter, 9 cards banned\nSo this period from 2017-2019 has seen the most bannings since the affinity era, and may even be comparable to the unquestionably disaster that was Urza block in `98-99.",
            "date_published": "2019-11-19T08:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/bannings-will-continue/index.md"
            , "tags": ["mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196766178833813504/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196545389823848448/",
            "url": "https://mirror.roytang.net/2019/11/1196545389823848448/",
            "path": "/2019/11/1196545389823848448/",
            "title": "",
            "content_html": "\u003cp\u003eNow is the winter of our disc one content\u003c/p\u003e\n",
            "summary": "Now is the winter of our disc one content",
            "date_published": "2019-11-18T21:47:06+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "notes",
            "source_path": "notes/2019/11/1196545389823848448/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196545389823848448/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/f7yj706/",
            "url": "https://mirror.roytang.net/2019/11/f7yj706/",
            "path": "/2019/11/f7yj706/",
            "title": "",
            "content_html": "\u003cp\u003eDecision trees like \u0026ldquo;which starter pokemon do you pick\u0026rdquo; aren\u0026rsquo;t things that should be embedded into your code as if/else statements. These should be data that your code loads.\u003c/p\u003e\n\u003cp\u003eFor this specific example, you could have a data file that has a list of all the available starter pokemon. How many are available to choose from? Your code will read these data files and present them as choices. The data files could include the dialog text and say, an ID string to indicate which pokemon would then be added into your party, something like this (JSON format, because it\u0026rsquo;s easier for me:\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003estarters: [\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003e{ \u0026quot;dialog\u0026quot;: \u0026quot;I choose Charmander!\u0026quot;, \u0026quot;pokemon_id\u0026quot;: \u0026quot;0001\u0026quot;},\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003e{ \u0026quot;dialog\u0026quot;: \u0026quot;I want Bulbasaur!\u0026quot;, \u0026quot;pokemon_id\u0026quot;: \u0026quot;0002\u0026quot;},\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003e{ \u0026quot;dialog\u0026quot;: \u0026quot;I want Pikachu!\u0026quot;, \u0026quot;pokemon_id\u0026quot;: \u0026quot;0003\u0026quot;}\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003e\u003ccode\u003e]\u003c/code\u003e\u003c/p\u003e\n\u003cp\u003e(I forgot who the 3rd starter was supposed to be, I\u0026rsquo;m not big on Pokemon. Also I\u0026rsquo;m guessing those aren\u0026rsquo;t the actual pokedex IDs)\u003c/p\u003e\n\u003cp\u003eEach item on the list could also contain some other info. For example in dialogue trees, you might have NPCs react differently depending on what you say, so in that case each node would have an id pointing to the specific NPC response.\u003c/p\u003e\n\u003cp\u003eThe idea is to separate the data from your code, since those are totally separate concerns. This is a general programming principle not specific to game development. In this way, you make it easier to modify your data (like decision trees) without necessarily having to rebuild your code. For example, you could change the dialog message for each pokemon starter choice, or maybe you could add more choices, or make the starter pokemon be Snorlax, MewTwo and Ekans for some reason (those are pokemon right? Lol). Bigger game studios will have separate tools to maintain those data files so that even nonprogrammers can help change those kinds of things in the game.\u003c/p\u003e\n",
            "summary": "Decision trees like \u0026ldquo;which starter pokemon do you pick\u0026rdquo; aren\u0026rsquo;t things that should be embedded into your code as if/else statements. These should be data that your code loads.\nFor this specific example, you could have a data file that has a list of all the available starter pokemon. How many are available to choose from? Your code will read these data files and present them as choices. The data files could include the dialog text and say, an ID string to indicate which pokemon would then be added into your party, something like this (JSON format, because it\u0026rsquo;s easier for me:",
            "date_published": "2019-11-18T16:54:16+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/f7yj706/index.md"
            , "tags": ["gamedev"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/gamedev/comments/dy4omz/how_to_you_prevent_a_rpg_from_ending_up_into_a/f7yj706/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196464077268086784/",
            "url": "https://mirror.roytang.net/2019/11/1196464077268086784/",
            "path": "/2019/11/1196464077268086784/",
            "title": "",
            "content_html": "\u003cp\u003e2010/2019 lol\u003c/p\u003e\n",
            "summary": "2010/2019 lol",
            "date_published": "2019-11-18T16:23:59+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1196464077268086784/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196464077268086784/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196462482098835463/",
            "url": "https://mirror.roytang.net/2019/11/1196462482098835463/",
            "path": "/2019/11/1196462482098835463/",
            "title": "",
            "content_html": "\u003cp\u003eThanks for the wildcards Oko! #mtg #magicarena\u003c/p\u003e\n",
            "summary": "Thanks for the wildcards Oko! #mtg #magicarena",
            "date_published": "2019-11-18T16:17:39+00:00",
            "date_modified": "2019-11-25T13:34:06+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/1196462482098835463/index.md"
            , "tags": ["mtg","magicarena"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196462482098835463/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/f7ybksk/",
            "url": "https://mirror.roytang.net/2019/11/f7ybksk/",
            "path": "/2019/11/f7ybksk/",
            "title": "",
            "content_html": "\u003cp\u003eextract your decision trees into data files outside of the code.\u003c/p\u003e\n",
            "summary": "extract your decision trees into data files outside of the code.",
            "date_published": "2019-11-18T15:37:07+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/f7ybksk/index.md"
            , "tags": ["gamedev"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/gamedev/comments/dy4omz/how_to_you_prevent_a_rpg_from_ending_up_into_a/f7ybksk/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196438733030977540/",
            "url": "https://mirror.roytang.net/2019/11/1196438733030977540/",
            "path": "/2019/11/1196438733030977540/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Woerlan/\"\u003e@Woerlan\u003c/a\u003e this is one of those instances where if MTG was a purely digital game, this would be super easy (just nerf Oko to have the 2nd ability be a -1. And maybe make OUAT a Sorcery or sth)\u003c/p\u003e\n",
            "summary": "@Woerlan this is one of those instances where if MTG was a purely digital game, this would be super easy (just nerf Oko to have the 2nd ability be a -1. And maybe make OUAT a Sorcery or sth)",
            "date_published": "2019-11-18T14:43:17+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1196438733030977540/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196438733030977540/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196436623698739201/",
            "url": "https://mirror.roytang.net/2019/11/1196436623698739201/",
            "path": "/2019/11/1196436623698739201/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/rovietoosin/\"\u003e@rovietoosin\u003c/a\u003e \u003ca href=\"https://twitter.com/triviastorm/\"\u003e@triviastorm\u003c/a\u003e hindi pala narerecognize nung bot before ang answers mo kasi hindi ka nya finafollow lol\u003c/p\u003e\n",
            "summary": "@rovietoosin @triviastorm hindi pala narerecognize nung bot before ang answers mo kasi hindi ka nya finafollow lol",
            "date_published": "2019-11-18T14:34:54+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1196436623698739201/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196436623698739201/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196408317439963136/",
            "url": "https://mirror.roytang.net/2019/11/1196408317439963136/",
            "path": "/2019/11/1196408317439963136/",
            "title": "",
            "content_html": "\u003cp\u003eGetting my licks in before the banhammer drops. B\u0026amp;R prediction: Noxious Grasp and Aether Gust banned in Standard. loljk #MTG\u003c/p\u003e\n",
            "summary": "Getting my licks in before the banhammer drops. B\u0026amp;R prediction: Noxious Grasp and Aether Gust banned in Standard. loljk #MTG",
            "date_published": "2019-11-18T12:42:25+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1196408317439963136/index.md"
            , "tags": ["MTG"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196408317439963136/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/a-cradle-for-imperfect-thoughts/",
            "url": "https://mirror.roytang.net/2019/11/a-cradle-for-imperfect-thoughts/",
            "path": "/2019/11/a-cradle-for-imperfect-thoughts/",
            "title": "A Cradle for Imperfect Thoughts",
            "content_html": "\u003cp\u003eA lot of people seem to think that blogging as an activity is about writing a well-thought out first draft, revising and researching and revising again until the post is perfected, then finally hitting publish (then possibly realize you had some editing errors and upadating and republishing). I tend to think this sort of perfectionism holds one back, I prefer to publish even when thoughts are yet half-formed and maybe even incomplete, laying the groundwork for revisiting the topic in a later post. One\u0026rsquo;s thoughts or positions on certain issues aren\u0026rsquo;t always set in stone, it can be helpful sometimes to commit to writing your thoughts as they are, in the moment, and iterating over them over a longer stretch of time, giving you a view into the history and evolution of your thinking.\u003c/p\u003e\n\u003cp\u003eWhat is a blog after all, if not a repository of your thoughts and ideas as they were in the moment, a history of your thinking through the years?\u003c/p\u003e\n",
            "summary": "A lot of people seem to think that blogging as an activity is about writing a well-thought out first draft, revising and researching and revising again until the post is perfected, then finally hitting publish (then possibly realize you had some editing errors and upadating and republishing). I tend to think this sort of perfectionism holds one back, I prefer to publish even when thoughts are yet half-formed and maybe even incomplete, laying the groundwork for revisiting the topic in a later post.",
            "date_published": "2019-11-18T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/imperfect-thoughts/index.md"
            , "tags": ["blogging"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196451652959719424/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1196114125996167169/",
            "url": "https://mirror.roytang.net/2019/11/1196114125996167169/",
            "path": "/2019/11/1196114125996167169/",
            "title": "",
            "content_html": "\u003cp\u003eOMG I\u0026rsquo;m finally done with this horrible coin flip of an #MagicArena event. This was only slightly worse than last week\u0026rsquo;s Elk madness. Only 1/3 of this months events were great, bleh. Should\u0026rsquo;ve just had one of them be brawl!\u003c/p\u003e\n",
            "summary": "OMG I\u0026rsquo;m finally done with this horrible coin flip of an #MagicArena event. This was only slightly worse than last week\u0026rsquo;s Elk madness. Only 1/3 of this months events were great, bleh. Should\u0026rsquo;ve just had one of them be brawl!",
            "date_published": "2019-11-17T17:13:25+00:00",
            "date_modified": "2019-11-25T13:34:06+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/1196114125996167169/index.md"
            , "tags": ["magicarena","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1196114125996167169/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/on-feed-readers/",
            "url": "https://mirror.roytang.net/2019/11/on-feed-readers/",
            "path": "/2019/11/on-feed-readers/",
            "title": "On Feed Readers",
            "content_html": "\u003cp\u003eI don\u0026rsquo;t use \u003ca href=\"https://www.inoreader.com/\"\u003eInoreader\u003c/a\u003e anymore, but a recent blog post of theirs recently appeared in my feeds that mentioned \u003ca href=\"https://blog.inoreader.com/2019/11/new-feature-sort-by-magic-and-article-popularity-indicators.html\"\u003ethey implemented \u0026ldquo;sort by magic\u0026rdquo;\u003c/a\u003e. This was a feature that \u003ca href=\"/2009/10/5149594629/\"\u003eGoogle reader had 10 YEARS AGO\u003c/a\u003e! There hasn\u0026rsquo;t been much innovation in the feed reader space in the last decade it seems, which is totally understandable given they are mostly tools used by internet \u0026ldquo;power users\u0026rdquo;, and mostly by older netheads, so the target market isn\u0026rsquo;t very large.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eWhen I talk about \u0026ldquo;feeds\u0026rdquo; and \u0026ldquo;feed readers\u0026rdquo;, I\u0026rsquo;m not talking only about RSS and the associated readers, but anything that lets me aggregate contents from a set of sources. This includes most social media streams (Twitter, etc), I guess Indieweb microformats readers (though I haven\u0026rsquo;t tried these a lot), and apps like \u003ca href=\"https://flipboard.com/\"\u003eFlipboard\u003c/a\u003e (which I typically use for my morning news).\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eRecently I installed a self-hosted \u003ca href=\"https://tt-rss.org/\"\u003eTiny Tiny RSS\u003c/a\u003e to take the place of my primary RSS feed reader. I also previously tried Inoreader and Feedly. The jump to TTRSS was mostly to avoid the free account limitations on those services. TTRSS is fine and it\u0026rsquo;s serviceable, but there\u0026rsquo;s still a lot of improvement I would like. I think about feed reader features a lot because (a) I like reading content from a wide variety of sources and feed readers help me do that; and (b) even back when Google Reader was still around I was kicking around the idea of writing my own feed reader. It\u0026rsquo;s one of those side projects that I want to build for myself but never get around to it. I\u0026rsquo;ll note down a couple of features I\u0026rsquo;ve been thinking about in the past decade.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eThe first flaw I find in most readers (including social media feeds) is that they typically treat all feeds the same way. In reality, I would like to be able to treat some feeds differently. I can think of at least two categories:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efeeds where I don\u0026rsquo;t mind missing some of their content (since I don\u0026rsquo;t always have time to read), and don\u0026rsquo;t mind just browsing their latest content like a magazine. Flipboard is great for this. Most social media feeds on the other hand seem to want to pull you away from this model by having their feeds be \u0026ldquo;algorithmic\u0026rdquo;. And for traditional RSS readers, having unread counts for this type of feed doesn\u0026rsquo;t make sense, and only annoys me and my compulsive need for zero unread counts.\u003c/li\u003e\n\u003cli\u003efeeds where I don\u0026rsquo;t want to miss any of their content. Maybe because it\u0026rsquo;s a particular source that I enjoy reading, or because it\u0026rsquo;s a feed I set up for notification purposes or such, or maybe the source is an events page where I want to know all the events they set up. Basically feeds that have a high signal-to-noise ratio for me (although ideally all the feeds I follow have high S/N ratio.) For this kind of feed, the unread counts in traditional RSS readers make sense.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI imagine there could be some in-between categories as well, possibly customizable. Something like a feed where I have unread counts, but also automatically mark as read articles that are too old? IDK.\u003c/p\u003e\n\u003cp\u003eI remembered this when I realized I could import my \u003ca href=\"https://roytang.net/2019/08/1167000875090378752/\"\u003eYoutube subscriptions as RSS\u003c/a\u003e. That gave me a whole lot of new feeds to follow, but I realized it was kind of a waste of time because most of the channels I follow are there for me to browse through when I\u0026rsquo;m looking for entertainment, but usually not the kind of content I want to regularly appear in my feeds. (So they\u0026rsquo;re under the first type.) Importing them basically added a lot of noise to my feed reader.\u003c/p\u003e\n\u003cp\u003eFacebook actually had something like you could add friends to a \u0026ldquo;Close Friends\u0026rdquo; list, and their posts would be prioritized for you and appear in your notification bar. I don\u0026rsquo;t FB much anymore, so IDK if this feature is still around, but as I recall you can\u0026rsquo;t use it with Pages.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAnother feature I\u0026rsquo;d like is grouping posts by topic, or the ability to highlight \u0026ldquo;related stories\u0026rdquo; for an article from other sources that I\u0026rsquo;m also following. For example, if there\u0026rsquo;s some breaking news story, and the article about this from NewsSourceA appears in my feed, I could maybe see a link to related articles about the same topic from NewsSourceB, NewsSourceC, and so on that I also follow. Or maybe choose to mark the topic as read or block further content about this topic.\u003c/p\u003e\n\u003cp\u003eThis is one of my major grips when using Flipboard, especially for the \u0026ldquo;Latest news\u0026rdquo; sections. There\u0026rsquo;ll be like 5 different articles about the latest Trump meltdown, and I encounter them at different points in the feed. I don\u0026rsquo;t mind reading about Trump meltdowns, but it would be more efficient if I could have each instance only appear in my feeds once. I understand this may be a bit challenging since it involves some automated content analysis though.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eI must admit I haven\u0026rsquo;t explored too much the paid features of services like Feedly or Inoreader, so maybe they support something similar to these features already. (I feel like it\u0026rsquo;s unlikely though. And I\u0026rsquo;m not really up for paying the monthly fees haha.) In addition to traditional RSS readers though, I\u0026rsquo;d also like my reader to be able to support following other kinds of sources like social media, ActivityStreams-compliant streams (Mastodon, etc), microformats feeds, and so on.\u003c/p\u003e\n\u003cp\u003eMaybe someday I\u0026rsquo;ll get around to finally building that feed reader I wanted for myself!\u003c/p\u003e\n",
            "summary": "I don\u0026rsquo;t use Inoreader anymore, but a recent blog post of theirs recently appeared in my feeds that mentioned they implemented \u0026ldquo;sort by magic\u0026rdquo;. This was a feature that Google reader had 10 YEARS AGO! There hasn\u0026rsquo;t been much innovation in the feed reader space in the last decade it seems, which is totally understandable given they are mostly tools used by internet \u0026ldquo;power users\u0026rdquo;, and mostly by older netheads, so the target market isn\u0026rsquo;t very large.",
            "date_published": "2019-11-17T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/on-feed-readers/index.md"
            , "tags": ["tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195916779861749760/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1195794038223294464/",
            "url": "https://mirror.roytang.net/2019/11/1195794038223294464/",
            "path": "/2019/11/1195794038223294464/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/visakanv/\"\u003e@visakanv\u003c/a\u003e ill look into it, but afaik searching via the twitter api doesnt have that filter\u003c/p\u003e\n",
            "summary": "@visakanv ill look into it, but afaik searching via the twitter api doesnt have that filter",
            "date_published": "2019-11-16T20:01:30+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1195794038223294464/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195794038223294464/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1195700917636497411/",
            "url": "https://mirror.roytang.net/2019/11/1195700917636497411/",
            "path": "/2019/11/1195700917636497411/",
            "title": "",
            "content_html": "\u003cp\u003eI got free 10k gems on #MagicArena courtesy of \u003ca href=\"https://twitter.com/urlichmtg/\"\u003e@urlichmtg\u003c/a\u003e \u0026rsquo;s giveaway. Many thanks!! :D\u003c/p\u003e\n",
            "summary": "I got free 10k gems on #MagicArena courtesy of @urlichmtg \u0026rsquo;s giveaway. Many thanks!! :D",
            "date_published": "2019-11-16T13:51:28+00:00",
            "date_modified": "2019-11-25T13:34:06+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/1195700917636497411/index.md"
            , "tags": ["magicarena","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195700917636497411/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1195700159666982912/",
            "url": "https://mirror.roytang.net/2019/11/1195700159666982912/",
            "path": "/2019/11/1195700159666982912/",
            "title": "",
            "content_html": "\u003cp\u003eOh wow! This is awesome! Thanks!! I’ve replied to your DM :)\u003c/p\u003e\n\u003ccite class=\"u-quotation-of h-cite\"\u003e\n    Quoted \u003ca  href='https://twitter.com/urlichmtg/status/1195696467945631744'\u003eurlichmtg\u0026#39;s tweet\u003c/a\u003e:\n\u003c/cite\u003e\n\u003cblockquote\u003e\n    \u003cp\u003eWe have a winner! \u003ca href=\"https://twitter.com/roytang/\"\u003e@roytang\u003c/a\u003e wins 10.000 gems in #MCVI giveaway edition! Congratulations to \u003ca href=\"https://twitter.com/roytang/\"\u003e@roytang\u003c/a\u003e, and big thank you to everyone who participated!\u003c/p\u003e\n\u003cp\u003eThe next edition of 10.000 gems giveaway for my lovely followers will be around #MythicChampionshipVII three weeks from this tweet! \u003ca href=\"https://twitter.com/urlichmtg/status/1191379585356709895\"\u003ehttps://twitter.com/urlichmtg/status/1191379585356709895\u003c/a\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n",
            "summary": "Oh wow! This is awesome! Thanks!! I’ve replied to your DM :)\nQuoted urlichmtg\u0026#39;s tweet:   We have a winner! @roytang wins 10.000 gems in #MCVI giveaway edition! Congratulations to @roytang, and big thank you to everyone who participated!\nThe next edition of 10.000 gems giveaway for my lovely followers will be around #MythicChampionshipVII three weeks from this tweet! https://twitter.com/urlichmtg/status/1191379585356709895\n ",
            "date_published": "2019-11-16T13:48:27+00:00",
            "date_modified": "2020-09-08T01:29:52+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1195700159666982912/index.md"
            , "tags": ["mcvi","mythicchampionshipvii"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195700159666982912/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/an-offline-walk/",
            "url": "https://mirror.roytang.net/2019/11/an-offline-walk/",
            "path": "/2019/11/an-offline-walk/",
            "title": "An Offline Walk",
            "content_html": "\u003cp\u003eThe other day, a family member mistakenly took my phone with them to the office so I was without a phone all day. This meant my daily walk had to be offline, which was a weird thing I hadn\u0026rsquo;t experienced in a while. I couldn\u0026rsquo;t help but note my hand\u0026rsquo;s instinctively reaching for the mobile phone that wasn\u0026rsquo;t there. Mobile phones are so ubiquitous in our daily lives, but sometimes it feels like a crutch how we can be totally dependent on them.\u003c/p\u003e\n\u003cp\u003eThings I can\u0026rsquo;t do on my walk if don\u0026rsquo;t have a mobile phone:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ebe contacted in an emergency\u003c/li\u003e\n\u003cli\u003econtact someone in an emergency\u003c/li\u003e\n\u003cli\u003etake a picture of something I find interesting\u003c/li\u003e\n\u003cli\u003etake a quick note of something I think of and want to remember later\u003c/li\u003e\n\u003cli\u003euse Google Maps if I get lost\u003c/li\u003e\n\u003cli\u003enot be bored when I sit down for a few minutes to take a break\u003c/li\u003e\n\u003cli\u003echeck my feeds every 7 minutes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThings I can do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eappreciate my surroundings\u003c/li\u003e\n\u003cli\u003ebe more observant\u003c/li\u003e\n\u003cli\u003etry to commit more things to memory (maybe strengthening my memory?)\u003c/li\u003e\n\u003cli\u003ewean myself off the OC behavior of checking my feeds every 7 minutes\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOld man rant, only tangentially related: People used to be able to go places and do meetups even without mobile phones. I think the advent of mobile phones made it more acceptable for people to be late to meetings because you could always message them and say you\u0026rsquo;re running late. In the old days, if you weren\u0026rsquo;t at the meetup point at the appointed time, you knew the other party was standing there tapping their feet impatiently not knowing whether you were actually still coming, so it was much more of a big deal.\u003c/p\u003e\n",
            "summary": "The other day, a family member mistakenly took my phone with them to the office so I was without a phone all day. This meant my daily walk had to be offline, which was a weird thing I hadn\u0026rsquo;t experienced in a while. I couldn\u0026rsquo;t help but note my hand\u0026rsquo;s instinctively reaching for the mobile phone that wasn\u0026rsquo;t there. Mobile phones are so ubiquitous in our daily lives, but sometimes it feels like a crutch how we can be totally dependent on them.",
            "date_published": "2019-11-16T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/an-offline-walk/index.md"
            , "tags": ["tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195500391577915393/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1195449257219608576/",
            "url": "https://mirror.roytang.net/2019/11/1195449257219608576/",
            "path": "/2019/11/1195449257219608576/",
            "title": "",
            "content_html": "\u003cp\u003eHaving some fun this morning\u003c/p\u003e\n",
            "summary": "Having some fun this morning",
            "date_published": "2019-11-15T21:11:27+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1195449257219608576/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195449257219608576/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1195226530093232134/",
            "url": "https://mirror.roytang.net/2019/11/1195226530093232134/",
            "path": "/2019/11/1195226530093232134/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/gangbadoy/\"\u003e@gangbadoy\u003c/a\u003e problema sa pilipinas e, kailangan all or nothing ang suporta. pwede naman mag criticize ng ilang bagay habang aprub ka pa rin sa iba\u003c/p\u003e\n",
            "summary": "@gangbadoy problema sa pilipinas e, kailangan all or nothing ang suporta. pwede naman mag criticize ng ilang bagay habang aprub ka pa rin sa iba",
            "date_published": "2019-11-15T06:26:25+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1195226530093232134/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195226530093232134/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/hong-kong-revolution-of-our-time/",
            "url": "https://mirror.roytang.net/2019/11/hong-kong-revolution-of-our-time/",
            "path": "/2019/11/hong-kong-revolution-of-our-time/",
            "title": "Hong Kong: The Revolution of Our Time",
            "content_html": "\u003cp\u003eHong Kong is on fire.\u003c/p\u003e\n\u003cp\u003eFor months now, protests and unrests, led mainly by university students, have \u003ca href=\"https://en.wikipedia.org/wiki/2019_Hong_Kong_protests\"\u003ewracked the city.\u003c/a\u003e Initially in response to a controversial China-backed extradition bill, it is also believed to be fueled by political and social inequality and interference by the Chinese government. As the months went on, the stakes have escalated in the wake of widespread anger at the way the police are brutally cracking down on protests. Many incidents of violence have been reported, mainly from the police, but some from the protestors as well.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not from Hong Kong, but I admit some fondness for the British territory - I\u0026rsquo;ve \u003ca href=\"/tags/hong-kong\"\u003etravelled there a few times\u003c/a\u003e and I worked for a Hong-Kong based company for more than a decade, so I know quite a number of people working there even now. I was hesitant to write down my thoughts on the current crisis, as things were moving and escalating quickly, and there was a good chance that whatever I write might be overtaken by events.\u003c/p\u003e\n\u003cp\u003eI stand in support of the protestors, and I am hopeful that they succeed, although I am not optimistic. They are standing against China, the fascist juggernaut of the modern world, and the odds of victory are low. This week, the police have laid siege to university campuses, and recently the \u003ca href=\"https://www.smh.com.au/world/asia/hong-kong-university-campus-like-a-warzone-as-night-time-battle-breaks-out-20191113-p53a1f.html\"\u003epolice have evacuated mainland students\u003c/a\u003e from HK, which seems to me as an indication that we are nearing some kind of tipping point, something akin to 1989\u0026rsquo;s Tiananmen massacre.\u003c/p\u003e\n\u003cp\u003eThe international response has been tepid at best, although both houses of the US legislature have passed or are preparing resolutions condemning the police brutality. Private companies have been embroiled in controversy for censoring efforts to voice support for the protestors, in a blatant example of how capitalism will not stand in support of freedom if it contradicts the bottom line. The gamer-relevant example is of course Blizzard, who suspended and censored Hearthstone pro Blitzchung for delivering this post\u0026rsquo;s title during a livestream.\u003c/p\u003e\n\u003cp\u003eThe Hong Kong protests are perhaps a microcosm of many of the problems faced by modern society: inequality, authoritarianism, state surveillance, police brutality, the indifference of capitalism, and even China itself. As the decade winds to a close, perhaps the HK revolution and its eventual outcome (whether that be the successful repression of the protests by China or a full-blown rebellion) provide a stark preview of what to expect in the decade to come. Indeed, Hong Kong is the revolution of our time.\u003c/p\u003e\n",
            "summary": "Hong Kong is on fire.\nFor months now, protests and unrests, led mainly by university students, have wracked the city. Initially in response to a controversial China-backed extradition bill, it is also believed to be fueled by political and social inequality and interference by the Chinese government. As the months went on, the stakes have escalated in the wake of widespread anger at the way the police are brutally cracking down on protests.",
            "date_published": "2019-11-15T00:00:00+00:00",
            "date_modified": "2019-11-23T05:46:16+08:00",
            "section": "post",
            "source_path": "post/2019/11/hong-kong-revolution-of-our-time/index.md"
            , "tags": ["current events","hong kong"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195160540429066241/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1195160540429066241#favorited-by-825037256",
                    "source_file": "like-20191115T032755-webmention-724458.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/tales-from-p2p/",
            "url": "https://mirror.roytang.net/2019/11/tales-from-p2p/",
            "path": "/2019/11/tales-from-p2p/",
            "title": "Tales from a P2P Bus",
            "content_html": "\u003cp\u003eIt\u0026rsquo;s a lot more uncommon for me to go to places like Ortigas or Makati nowadays, but when I do I almost always take the P2P bus. The P2P (Point-to-Point) buses were introduced in Metro Manila I think around late 2015/early 2016, as a pricier alternative to the usual city buses. The fares are more expensive, but the buses are also much more comfortable and they don\u0026rsquo;t make stops along their route, only at the endpoints, so their travel time is faster compared to the usual city buses.\u003c/p\u003e\n\u003cp\u003eDuring a recent P2P trip, the bus driver had another person with him that he mentioned was an \u0026ldquo;apprentice\u0026rdquo;, basically a new hire that was shadowing him to learn the route. During the 45 minute ride, the two of them talked quite a bit about the P2P business model (from the POV of the driver/employee of course). I learned some interesting things so I thought I\u0026rsquo;d write about it. All of these points I just overheard from the two so maybe take it with a grain of salt especially in regards to accuracy of numbers etc.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe more senior driver had only been in this job since July, but he seemed very satisfied with how much he was earning.\u003c/li\u003e\n\u003cli\u003eUnlike regular drivers and their boundary system, P2P drivers are salaried, with a daily salary of around P700 + P150 allowance. They are required to render 8 hrs/day for their daily pay.\u003c/li\u003e\n\u003cli\u003eThey are given an incentive based on the number of people they carry over a day. The example given was if you manage to ferry 225 people in one day, you get a P300 incentive; 300 people is a P500 incentive, and so on. From what I gather, 300 riders is already very high for a single day. The senior driver says this route is comparatively better than the other route (also from the same general endpoint), since that other route is longer and it\u0026rsquo;s harder to meet the incentives.\u003c/li\u003e\n\u003cli\u003eThey also have overtime pay, around P85-P100 per hour (the two had conflicting info).\u003c/li\u003e\n\u003cli\u003eThe more senior driver says the job is pretty good, \u003cem\u003e\u0026ldquo;basta masipag ka.\u0026quot;\u003c/em\u003e He always drives as many trips as he could to get as much overtime as possible; he sometimes finishes at 11pm, then just eats and goes home to sleep. \u003cem\u003e\u0026ldquo;Wala naman akong libangan\u0026rdquo;\u003c/em\u003e, he says. (This saddened me a bit.)\u003c/li\u003e\n\u003cli\u003eThe senior driver mentioned that they get paid on the 10th and the 25th, but there\u0026rsquo;s also a daily salary?? I think like maybe the allowance is given daily because he said \u0026ldquo;hindi ka magugutom kasi may pera araw-araw\u0026rdquo; or maybe the incentive is given daily? The overtime pay he has to file his extra hours, so that\u0026rsquo;s not a daily thing.\u003c/li\u003e\n\u003cli\u003eThe senior driver says that his last overtime filing was for 100+ hours. At P100/hour that\u0026rsquo;s more than P10K, so not bad.\u003c/li\u003e\n\u003cli\u003eThe senior driver says in this job, your driver\u0026rsquo;s license is much \u0026ldquo;safer\u0026rdquo; than a regular city bus driving job. He claims the traffic authorities \u003cem\u003enever\u003c/em\u003e apprehend P2P drivers. Presumably because it\u0026rsquo;s a government project? The apprentice says \u003cem\u003e\u0026ldquo;ah kaya pala hindi ka nagseseatbelt\u0026rdquo;\u003c/em\u003e, and the senior driver says yes, he never wears the seat belt, even when there\u0026rsquo;s a cop standing right in front of the bus. By contrast, if a cop spotted any normal city bus driver without a seat belt, that would be an automatic infraction.\u003c/li\u003e\n\u003cli\u003eGiven the economics of his job, the senior driver says he doesn\u0026rsquo;t feel the need to compete with the city bus drivers (\u003cem\u003e\u0026ldquo;hindi na ko nakikipaggitgitan\u0026rdquo;\u003c/em\u003e), and his drive is more relaxed since he doesn\u0026rsquo;t have to worry about picking up passengers etc. \u003cem\u003e\u0026ldquo;Parang naglalaro lang.\u0026quot;\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003eThe apprentice used to work as a 10-wheeler truck driver (hauling cargo). He says the pay was a bit higher in his last job, but they didn\u0026rsquo;t give him benefits (overtime, SSS, philhealth, etc). This seems illegal to me??\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eObviously I\u0026rsquo;m not from the same economic bracket as those targetted to work in this occupation, but it seems like a pretty good gig, compared to normal city bus driver jobs at least. I\u0026rsquo;m glad the economics are working out for both the drivers and the service providers, as the P2P buses are a pretty good alternative option for those who can afford it.\u003c/p\u003e\n",
            "summary": "It\u0026rsquo;s a lot more uncommon for me to go to places like Ortigas or Makati nowadays, but when I do I almost always take the P2P bus. The P2P (Point-to-Point) buses were introduced in Metro Manila I think around late 2015/early 2016, as a pricier alternative to the usual city buses. The fares are more expensive, but the buses are also much more comfortable and they don\u0026rsquo;t make stops along their route, only at the endpoints, so their travel time is faster compared to the usual city buses.",
            "date_published": "2019-11-14T00:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/tales-from-p2p/index.md"
            , "tags": ["philippines"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194798433502150658/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-955453269727363072",
                    "source_file": "like-20191114T022705-webmention-724213.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-43804316",
                    "source_file": "like-20191114T035606-webmention-724215.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-262052694",
                    "source_file": "like-20191114T065947-webmention-724238.json"
                }, { 
                    "url": "https://twitter.com/mlq3/status/1194798749609943040",
                    "source_file": "repost-20191114T022705-webmention-724212.json"
                }, { 
                    "url": "https://twitter.com/hoco27/status/1194869181134409728",
                    "source_file": "repost-20191114T065947-webmention-724237.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1194525792778121216/",
            "url": "https://mirror.roytang.net/2019/11/1194525792778121216/",
            "path": "/2019/11/1194525792778121216/",
            "title": "",
            "content_html": "\u003cp\u003eHong Kong protests are in their fifth month despite an escalating crackdown. How? One surprising answer: the fate of China\u0026rsquo;s Uyghurs. Many talked to me about it. They watched and learned. They\u0026rsquo;ve decided that they \u0026ldquo;may as well go down fighting.\u0026rdquo; My latest. \u003ca href=\"https://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/\"\u003ehttps://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Hong Kong protests are in their fifth month despite an escalating crackdown. How? One surprising answer: the fate of China\u0026rsquo;s Uyghurs. Many talked to me about it. They watched and learned. They\u0026rsquo;ve decided that they \u0026ldquo;may as well go down fighting.\u0026rdquo; My latest. https://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/",
            "date_published": "2019-11-13T08:01:56+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1194525792778121216/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194525792778121216/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/sql-dying-art/",
            "url": "https://mirror.roytang.net/2019/11/sql-dying-art/",
            "path": "/2019/11/sql-dying-art/",
            "title": "Is SQL a dying art?",
            "content_html": "\u003cp\u003eI was helping my brother check some database issues the other week, and he mentioned how impressed he was with how quickly I was able to come up with SQL queries on the fly. I told him that SQL was one of the skills I considered myself to have mastery over. This shouldn\u0026rsquo;t be surprising given my early career path:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efor most of my first year working as a software developer, I was working on reports which involved lovingly handcrafted (and oftentimes quite complicated) SQL queries. And there was a lot of Oracle PL/SQL too\u003c/li\u003e\n\u003cli\u003eby my second year, I was already conducting SQL training for new hires in the company\u003c/li\u003e\n\u003cli\u003eby my third year and onwards, I was already regularly asked to help other projects with their SQL performance issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMost of my experience was with Oracle SQL, but as the ANSI standard has evolved quite well, the knowledge translates well to other databases. (Maybe not the PL/SQL though.)\u003c/p\u003e\n\u003cp\u003eThese days I feel like SQL knowledge has become a much rarer skill among developers, chiefly for 2-3 reasons:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe introduction and widespread use of tools like frameworks with ORMs and business intelligence software, minimizing the amount of SQL that needs to be hand-written in most applications\u003c/li\u003e\n\u003cli\u003ethe modern software development stack is much more complicated than it used to be, particularly for web development. When I started out, almost everybody was a \u0026ldquo;full stack engineer\u0026rdquo;, and that meant having to be familiar with most technologies you were using, including the database layer. These days, for any nontrivial project, developers on a team will often need to be specialized, with many working only on frontend issues, some on backend, and any SQL or stored procedure work is handled by a specialist developer or a DBA.\u003c/li\u003e\n\u003cli\u003ea possible secondary reason is the rise of alternative data storage solutions such as NoSQL databases.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRealistically, the need for people who can write good SQL may never go away, but the poor of people who can do so may be getting smaller due to the reasons above. Well, maybe it\u0026rsquo;s a good thing for me, since scarcity means it may become a more valuable skill as time goes on!\u003c/p\u003e\n",
            "summary": "I was helping my brother check some database issues the other week, and he mentioned how impressed he was with how quickly I was able to come up with SQL queries on the fly. I told him that SQL was one of the skills I considered myself to have mastery over. This shouldn\u0026rsquo;t be surprising given my early career path:\n for most of my first year working as a software developer, I was working on reports which involved lovingly handcrafted (and oftentimes quite complicated) SQL queries.",
            "date_published": "2019-11-13T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/sql-dying-art/index.md"
            , "tags": ["software development","sql"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194436027081019406/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/prod-crisis/",
            "url": "https://mirror.roytang.net/2019/11/prod-crisis/",
            "path": "/2019/11/prod-crisis/",
            "title": "What to do in a production crisis",
            "content_html": "\u003cp\u003eDespite our best efforts as software developers, it can still happen: production goes down. Or some sort of bug introduces catastrophic data error. Hopefully you have a support/DevOps team to handle the response. If not, the dev team themselves have to step in. This usual means a mad rush to figure out what happened and how to fix it, sometimes during off hours and maybe even into the early morning, all while facing pressure from clients and higher-ups. I was advising another developer in such a situation a while back, and it was his first stint as technical lead so he was extra worried. I gave him a few tips to see him through the time of crisis.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eKeep calm. In Tagalog, \u003ca href=\"/2019/04/project-management-tip-kalma-lang/\"\u003ekalma lang\u003c/a\u003e. In a crisis, there can be a lot of stress and pressure to fix things immediately. It\u0026rsquo;s best to keep a level head and make sure the team is keeping it together. Don\u0026rsquo;t let your emotions carry you away, and try to avoid panic.\u003c/li\u003e\n\u003cli\u003eSolve one problem at a time until you can go home. This is a lesson from the movie \u003ca href=\"/2015/10/10154142633048912/\"\u003eThe Martian\u003c/a\u003e. In a crisis it can be difficult to focus on the task at hand and if you\u0026rsquo;re not thinking straight you might just charge in there blindly and move things around until things get better. Follow step #1, then figure out what are the most pressing problems that need to be solved immediately, then address them one at a time. It can also help your team morale to identify which issues can be left until the next day. This gives them a concrete sense of what is set of problems to focus on, and motivates them to solve those so they can go home.\u003c/li\u003e\n\u003cli\u003eBe extra careful. In times like these, you may find yourself needing to deploy hotfixes directly to production or maybe even update data directly in the production database, in the interest of expediency. It\u0026rsquo;s also during times like these that you are more likely to make a mistake, especially if your team is under stress and working overtime/during off hours. So it would pay to be extra careful, maybe add an additional layer of review before deploying things directly to production. You\u0026rsquo;re already in a crisis, don\u0026rsquo;t make things worse by making a sloppy mistake.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eHaving to provide tech support during such a crisis is something you shouldn\u0026rsquo;t wish on any developer, but sometimes it can\u0026rsquo;t be avoided. (Some might even consider it a kind of rite of passage so to speak). Make sure to have the right mindset to be able to operate well under such stressful conditions.\u003c/p\u003e\n",
            "summary": "Despite our best efforts as software developers, it can still happen: production goes down. Or some sort of bug introduces catastrophic data error. Hopefully you have a support/DevOps team to handle the response. If not, the dev team themselves have to step in. This usual means a mad rush to figure out what happened and how to fix it, sometimes during off hours and maybe even into the early morning, all while facing pressure from clients and higher-ups.",
            "date_published": "2019-11-12T00:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/prod-crisis/index.md"
            , "tags": ["software development"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194052290363232257/"}]
            
            , "comments": [
                { 
                    "url": "https://lostfocus.de/2019/11/23923/",
                    "source_file": "comment-20191112T084315-webmention-723389.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194052290363232257#favorited-by-2251223190",
                    "source_file": "like-20191113T022938-webmention-723865.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1193936749342277639/",
            "url": "https://mirror.roytang.net/2019/11/1193936749342277639/",
            "path": "/2019/11/1193936749342277639/",
            "title": "",
            "content_html": "\u003cp\u003eShould really be going to sleep, but I\u0026rsquo;m really enjoying reading the release notes for Mystery Booster lol\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\"\u003ehttps://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThoughts on the set: it\u0026rsquo;s clearly meant to be drafted for fun, don\u0026rsquo;t worry so much about the \u0026ldquo;value\u0026rdquo;, unless it turns out to be horribly overpriced\u003c/p\u003e\n",
            "summary": "Should really be going to sleep, but I\u0026rsquo;m really enjoying reading the release notes for Mystery Booster lol\nhttps://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\nThoughts on the set: it\u0026rsquo;s clearly meant to be drafted for fun, don\u0026rsquo;t worry so much about the \u0026ldquo;value\u0026rdquo;, unless it turns out to be horribly overpriced",
            "date_published": "2019-11-11T17:01:17+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1193936749342277639/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193936749342277639/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/anime-op/",
            "url": "https://mirror.roytang.net/2019/11/anime-op/",
            "path": "/2019/11/anime-op/",
            "title": "Anime Opening/Ending Themes",
            "content_html": "\u003cp\u003eHad a friendly discussion last night about our favorite anime theme music, figured I\u0026rsquo;d share some of my favorites. J-Pop in general and anime theme music in particular have a kind of energy that you just don\u0026rsquo;t get from Western music. I think that generally I tend to favor those that openings for series that I had a chance to watch on TV (instead of via streaming/online channels), since back in those days I had to sit through the openings! (So most of these are rather old!)\u003c/p\u003e\n\u003cp\u003eKimi Ga Suki da to Sakebitai from Slam Dunk by Baad:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/7qLwmho_240\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eHohoemi no Bakudan from Yu Yu Hakusho by Matsuko Mawatari:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/IEjRBJChZMA\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003e1/3 no Junjou na Kanjou from Rurouni Kenshin by Siam Shade:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/rzziisIJudY\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003e(RK in particular had a lot of tracks I liked, but let\u0026rsquo;s limit it to one per series)\u003c/p\u003e\n\u003cp\u003eChala Head Chala from Dragonball Z by Hironobu Kageyama:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/pYnLO7MVKno\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eWe Are! from One Piece by Hiroshi Kitadani:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/ZwXKz2CeHwY\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eThat\u0026rsquo;s all for now! Here\u0026rsquo;s a \u003ca href=\"https://open.spotify.com/playlist/1aUsKTSASpG2jPSDSzVICw\"\u003espotify playlist\u003c/a\u003e if you\u0026rsquo;re into that sort of thing.\u003c/p\u003e\n",
            "summary": "Had a friendly discussion last night about our favorite anime theme music, figured I\u0026rsquo;d share some of my favorites. J-Pop in general and anime theme music in particular have a kind of energy that you just don\u0026rsquo;t get from Western music. I think that generally I tend to favor those that openings for series that I had a chance to watch on TV (instead of via streaming/online channels), since back in those days I had to sit through the openings!",
            "date_published": "2019-11-11T05:07:32+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/anime-op/index.md"
            , "tags": ["anime","music"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193770770398400512/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1193558150223261697/",
            "url": "https://mirror.roytang.net/2019/11/1193558150223261697/",
            "path": "/2019/11/1193558150223261697/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-11-10T15:56:52+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1193558150223261697/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193558150223261697/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/indieweb/",
            "url": "https://mirror.roytang.net/2019/11/indieweb/",
            "path": "/2019/11/indieweb/",
            "title": "Indieweb Updates and Thoughts",
            "content_html": "\u003cp\u003eI \u003ca href=\"/2019/07/move-fast-break-things/\"\u003ementioned before\u003c/a\u003e that I was looking into indieweb stuff. There\u0026rsquo;s a \u003ca href=\"https://indieweb.org/\"\u003ewhole wiki of information\u003c/a\u003e about it if you\u0026rsquo;re into that sort of thing, but also \u003ca href=\"https://www.jvt.me/posts/2019/10/20/indieweb-talk/\"\u003ehere\u0026rsquo;s a recent post\u003c/a\u003e which kind of serves as an overview. I have some comments on the content of this post, more on that \u003ca href=\"#later\"\u003elater\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIndieweb things I\u0026rsquo;ve already implemented on this site:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave a personal domain (\u003ca href=\"/2006/02/welcome-to-roytang-net/\"\u003esince 2006\u003c/a\u003e)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://microformats.io/\"\u003emicroformats\u003c/a\u003e (h-card and h-feeds and h-entrys), though I would have to be using some sort of microformats reader to make sure everything there is hunky-dory (no concrete plans for this yet)\u003c/li\u003e\n\u003cli\u003ewebmention support, via \u003ca href=\"https://webmention.io/\"\u003ewebmention.io\u003c/a\u003e. Of course, I\u0026rsquo;m not actually interacting with anyone else on the indieweb yet, so this is mostly experimental and untested.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://indieweb.org/POSSE\"\u003ePOSSE\u003c/a\u003e (partially): blog posts are syndicated to Twitter and Mastodon, but I\u0026rsquo;m also still posting content on those platforms (and to Instagram)\u003c/li\u003e\n\u003cli\u003eowning my content: (almost) all posts I make to other social media channels now get backfed into the \u003ca href=\"/2019/10/archive-of-my-own/\"\u003earchive on this site\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThings I hope to be able to implement (no timetable):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePOSSE (full) - currently for notes and photos I still mostly post using Twitter and Instagram because their native posting features are more convenient (especially on mobile) compared to my current workflow of \u0026ldquo;push a markdown file to git\u0026rdquo;. This is largely contingent on me implementing the next item:\u003c/li\u003e\n\u003cli\u003eA web interface for posting to the site. A web interface should be sufficient convenient for mobile use. Optionally using the next item:\u003c/li\u003e\n\u003cli\u003eMicropub. I\u0026rsquo;m still iffy whether I really need the protocol. It could be handy in certain situations.\u003c/li\u003e\n\u003cli\u003eI\u0026rsquo;ve also been \u003ca href=\"https://mastodon.technology/@roytang/102954512082445097\"\u003edigging into ActivityPub\u003c/a\u003e lately. My hope is to eventually have this site itself serve as an ActivityPub server, such that one would be able to follow me on Mastodon via something like \u003ca href=\"mailto:roy@roytang.net\"\u003eroy@roytang.net\u003c/a\u003e. Similar to how \u003ca href=\"https://aaronparecki.com/aaronpk\"\u003eAaron Parecki has done it\u003c/a\u003e. I\u0026rsquo;ve already done some exploratory work on this but it might be a ways off (low priority I guess.)\u003c/li\u003e\n\u003cli\u003eArchive Mastodon posts into this site (this is kinda ironic for some reason)\u003c/li\u003e\n\u003cli\u003eAutomatic sending out of webmentions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca id=\"later\"\u003e#\u003c/a\u003e Anyway, back to the post I linked above. My main criticism for the indieweb movement at the moment is that I don\u0026rsquo;t see a path to mass adoption, especially for the purposes of moving people away from silos like Facebook. Maybe that\u0026rsquo;s not really one of the goals. My main issue is with two of the principles outlined in the post above (read the post again for more details):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u0026ldquo;Make What You Need / Scratch Your Itch\u0026rdquo;\u003c/li\u003e\n\u003cli\u003e\u0026ldquo;Use What You Make / Dogfood\u0026rdquo;\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe thing about these concepts is that there is a lot of work involved and there are significant barriers to entry for getting involved. I mean, most people aren\u0026rsquo;t going to (won\u0026rsquo;t be able to) bother with the first step (getting your own domain), much more be able to \u0026ldquo;make what you need\u0026rdquo;. It\u0026rsquo;s ok for people like me who are comfortable with the highly technical and have a bunch of free time, but for the average person it seems unlikely.\u003c/p\u003e\n\u003cp\u003eI can imagine there might be created a service that supports most of the Indieweb features and can easily be adopted by the mass market, although that has a lot of its own challenges as well, and it\u0026rsquo;s kind of like replacing one kind of silo with another? At least it would be a more open silo I guess? I think \u003ca href=\"https://micro.blog/\"\u003emicro.blog\u003c/a\u003e already supports the indieweb stuff, but I haven\u0026rsquo;t yet looked too closely into that.\u003c/p\u003e\n\u003cp\u003eI am still moving forward with the indieweb stuff, and I am hopeful that it manages to coalesce into something that can challenge the way the modern internet works, but that may be a long way off. As far as I can tell, adoption is not yet very widespread, and AFAICT the main people driving the effort with their \u003ca href=\"https://indieweb.org/events/2019-11-13-homebrew-website-club\"\u003eHomebrew Website Clubs\u003c/a\u003e are in Western countries. It\u0026rsquo;s even possible that I\u0026rsquo;m the first in the Philippines looking into this Indieweb stuff. :)\u003c/p\u003e\n",
            "summary": "I mentioned before that I was looking into indieweb stuff. There\u0026rsquo;s a whole wiki of information about it if you\u0026rsquo;re into that sort of thing, but also here\u0026rsquo;s a recent post which kind of serves as an overview. I have some comments on the content of this post, more on that later.\nIndieweb things I\u0026rsquo;ve already implemented on this site:\n have a personal domain (since 2006) microformats (h-card and h-feeds and h-entrys), though I would have to be using some sort of microformats reader to make sure everything there is hunky-dory (no concrete plans for this yet) webmention support, via webmention.",
            "date_published": "2019-11-10T15:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/indieweb/index.md"
            , "tags": ["tech life","meta","changelog"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193551787376156672/"}]
            
            , "comments": [
                { 
                    "url": "https://stream.jeremycherfas.net/2019/good-work-so-far-as-you-note",
                    "source_file": "comment-20191110T153701-webmention-722915.json"
                }, { 
                    "url": "http://known.kevinmarks.com/2019/hello-and-welcome-to-the-indieweb",
                    "source_file": "comment-20191110T153800-webmention-722916.json"
                }, { 
                    "url": "https://www.jvt.me/mf2/2019/11/w4tgj/",
                    "source_file": "comment-20191110T211800-webmention-723052.json"
                }, { 
                    "url": "https://janboddez.tech/notes/946613625",
                    "source_file": "comment-20191111T092014-webmention-723186.json"
                }, { 
                    "url": "https://beko.famkos.net/2019/11/11/microformat-parser/",
                    "source_file": "comment-20191111T102301-webmention-723190.json"
                }, { 
                    "url": "https://twitter.com/NurseMcHurt/status/1193962253445414913",
                    "source_file": "comment-20191111T185234-webmention-723280.json"
                }, { 
                    "url": "https://gregorlove.com/2019/11/hello-and-welcome/",
                    "source_file": "comment-20191111T185755-webmention-723281.json"
                }, { 
                    "url": "https://boffosocko.com/2019/11/11/indieweb-updates-and-thoughts-roy-tang/",
                    "source_file": "comment-20191111T224645-webmention-723306.json"
                }, { 
                    "url": "https://simply.micro.jenett.org/2019/11/11/20:50:10/",
                    "source_file": "comment-20191112T015018-webmention-723325.json"
                }, { 
                    "url": "https://grant.codes/2019/11/11/11-00-37",
                    "source_file": "like-20191111T110047-webmention-723194.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-2691886662",
                    "source_file": "like-20191111T195013-webmention-723291.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-1154684923",
                    "source_file": "like-20191111T195014-webmention-723292.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-5398102",
                    "source_file": "like-20191111T211331-webmention-723300.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-2868925860",
                    "source_file": "like-20191111T234435-webmention-723317.json"
                }, { 
                    "url": "https://blog.voss.co/2019/indieweb-updates-and-thoughts-middot-roy-tang",
                    "source_file": "like-20191115T235212-webmention-724735.json"
                }, { 
                    "url": "https://hub.iwebthings.com/simply-micro-2019-11-11-205010/",
                    "source_file": "like-20200114T225333-webmention-744477.json"
                }, { 
                    "url": "https://twitter.com/kevinmarks/status/1193553850424266757",
                    "source_file": "repost-20191110T154940-webmention-722920.json"
                }, { 
                    "url": "https://twitter.com/tchambers/status/1193667075757281281",
                    "source_file": "repost-20191110T233837-webmention-723088.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4op_a_h17a/",
            "url": "https://mirror.roytang.net/2019/11/b4op_a_h17a/",
            "path": "/2019/11/b4op_a_h17a/",
            "title": "",
            "content_html": "\u003cp\u003eFirst #ps4 purchase for the year #pickups\u003c/p\u003e\n",
            "summary": "First #ps4 purchase for the year #pickups",
            "date_published": "2019-11-09T07:08:35+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4op_a_h17a/index.md"
            , "tags": ["ps4","pickups"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193062813448785920/"},{"type":"instagram","url":"https://instagram.com/p/B4op_a_h17a/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/so-good-they-cant-ignore-you/",
            "url": "https://mirror.roytang.net/2019/11/so-good-they-cant-ignore-you/",
            "path": "/2019/11/so-good-they-cant-ignore-you/",
            "title": "Book Review: So Good They Cant Ignore You by Cal Newport",
            "content_html": "\u003cp\u003eAha! I finally managed to finish a book again!\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;ve heard of Cal Newport since years ago tangentially due to his Study Hacks blog, which was pretty good at the time. I haven\u0026rsquo;t followed his career too closely, but he\u0026rsquo;s an academic at Georgetown apparently. I wasn\u0026rsquo;t looking for any career advice in particular, but I did have a recommendation for this book from somewhere so I thought I\u0026rsquo;d give it a go.\u003c/p\u003e\n\u003cp\u003eThe book is \u003cem\u003eSo Good They Can\u0026rsquo;t Ignore You\u003c/em\u003e, and focuses on what it takes to have a \u0026ldquo;successful career\u0026rdquo;.\u003c/p\u003e\n\u003cp\u003eMy favorite thing about this book is that from the get-go, the author discards something most self-improvement books focus on: passion. The author discards passion as non-essential. A lot of self-improvement books also lay out a bunch of principles and rules and wink at the reader and say something to the effect of \u0026ldquo;You just have to do all of this stuff, and you\u0026rsquo;ll be super successful!\u0026rdquo;, as if all of those rules + a bit of passion are some sort of secret ingredient that allow you to skip past all the hard work necessary to find success. This book doesn\u0026rsquo;t shy away from the concept of hard work. Instead, it embraces it, in the form of what the author calls \u0026ldquo;career capital\u0026rdquo;. Basically, you need to earn enough \u0026ldquo;career capital\u0026rdquo; in order to then exchange that capital for the trappings of a successful career, such as more control over your time. \u0026ldquo;Career capital\u0026rdquo; is what makes you \u0026ldquo;so good they can\u0026rsquo;t ignore you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLike many books of this type, the ideas are presented as if the author came by them scientific analysis, but really the basis seems to be a series of anecdotal success stories of people whose career paths coincide with the author\u0026rsquo;s central thesis. This is not inherently a bad thing, though it does weaken the foundation of the books claims that it\u0026rsquo;s not backed by a detailed scientific study. But for purposes of laying out his ideas in an entertaining manner, the format is certainly sufficient. The success stories are really the meat of the book, designed to lay out the author\u0026rsquo;s rules and show how they are applicable to real, actual careers. And in most of the success stories, he traces their story for more than a decade of building up \u0026ldquo;career capital\u0026rdquo;, again emphasizing hard work over dreaming of overnight success.\u003c/p\u003e\n\u003cp\u003eI personally relate to the concept of not being defined by passion and instead working hard to earn \u0026ldquo;career capital\u0026rdquo; and the idea that you can cash that capital in for more control. This mirrors my own career path where I spent more than a decade working for some multinational company, not really specializing in anything in particular and developing a variety of interests before deciding to use that career capital to go freelance and establish more control over my life. What I don\u0026rsquo;t have yet, is the overarching \u0026ldquo;mission\u0026rdquo; described by the author\u0026rsquo;s Rule #4. I don\u0026rsquo;t have a unifying vision driving my life forward, probably a result of my being very \u003ca href=\"/2019/11/unfocused/\"\u003eunfocused\u003c/a\u003e. Or perhaps I already have one and it is yet to be clearly articulated? Hmm, we\u0026rsquo;ll see. In any case, I find the book\u0026rsquo;s contents quite relevant to my own career and the ideas presented here will probably be relevant to me personally as I try to crystallize my own plans for the future.\u003c/p\u003e\n\u003cp\u003eThe book is a relatively short (Kindle version says 276 pages, and a lot of that is notes and links) and a quick read (I finished it piecemeal over 3 days, but could have easily finished in 1). I think I got it on sale a few months ago for around $4, not bad for that price, and a decent pickup for anyone looking to chart a clearer career path.\u003c/p\u003e\n",
            "summary": "Aha! I finally managed to finish a book again!\nI\u0026rsquo;ve heard of Cal Newport since years ago tangentially due to his Study Hacks blog, which was pretty good at the time. I haven\u0026rsquo;t followed his career too closely, but he\u0026rsquo;s an academic at Georgetown apparently. I wasn\u0026rsquo;t looking for any career advice in particular, but I did have a recommendation for this book from somewhere so I thought I\u0026rsquo;d give it a go.",
            "date_published": "2019-11-09T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/book-review-so-good-they-cant-ignore-you/index.md"
            , "tags": ["books","review"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192987972989325312/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1192929877449527298/",
            "url": "https://mirror.roytang.net/2019/11/1192929877449527298/",
            "path": "/2019/11/1192929877449527298/",
            "title": "",
            "content_html": "\u003cp\u003eThe weight of last night’s decisions bear heavily upon me\u003c/p\u003e\n",
            "summary": "The weight of last night’s decisions bear heavily upon me",
            "date_published": "2019-11-08T22:20:21+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "notes",
            "source_path": "notes/2019/11/1192929877449527298/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192929877449527298/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/removed-webfont/",
            "url": "https://mirror.roytang.net/2019/11/removed-webfont/",
            "path": "/2019/11/removed-webfont/",
            "title": "",
            "content_html": "\u003cp\u003eFontAwesome has been fun and all, but in the interest of reducing load time and external dependencies, I removed the FA dependency on this blog and switched to SVG icons instead. Icons are from \u003ca href=\"http://svgicons.sparkk.fr/\"\u003ehere\u003c/a\u003e, specifically the \u003ca href=\"https://dribbble.com/shots/1934932-77-Essential-Icons-Free-Download\"\u003eset by Bryn Taylor\u003c/a\u003e and the Special Social Icon Set #9. Not all the icons carried over, especially some of the social ones (Mastodon, etc). Workarounds had to be made. Hopefully nothing breaks!\u003c/p\u003e\n",
            "summary": "FontAwesome has been fun and all, but in the interest of reducing load time and external dependencies, I removed the FA dependency on this blog and switched to SVG icons instead. Icons are from here, specifically the set by Bryn Taylor and the Special Social Icon Set #9. Not all the icons carried over, especially some of the social ones (Mastodon, etc). Workarounds had to be made. Hopefully nothing breaks!",
            "date_published": "2019-11-08T23:18:49+08:00",
            "date_modified": "2019-11-08T23:22:40+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/removed-webfont.md"
            , "tags": ["meta","changelog"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/unfocused/",
            "url": "https://mirror.roytang.net/2019/11/unfocused/",
            "path": "/2019/11/unfocused/",
            "title": "Unfocused",
            "content_html": "\u003cp\u003eI am envious sometimes of people who are able to narrow down their interests to a specific scope, it\u0026rsquo;s kind of like a lot of their decisions are made easier. Consider a person whose only hobby/interest is something like sports (not necessarily all sports, or just one sport, just sports in general).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003elooking for something to do in your spare time? Sports!\u003c/li\u003e\n\u003cli\u003ewant to watch something on TV? Sports!\u003c/li\u003e\n\u003cli\u003epicking up a newspaper, but don\u0026rsquo;t have much time to read? Sports section!\u003c/li\u003e\n\u003cli\u003eneed a small talk topic? Sports!\u003c/li\u003e\n\u003cli\u003edo your social media posts have a focused topic? Sports!\u003c/li\u003e\n\u003cli\u003ewant to start a blog/podcast/youtube channel and need a topic? Sports!\u003c/li\u003e\n\u003cli\u003egiving a TED talk? Sports!\u003c/li\u003e\n\u003cli\u003ewant to write a book? Sports!\u003c/li\u003e\n\u003cli\u003ewant to learn something new? Find a new sport!\u003c/li\u003e\n\u003cli\u003eneed an advocacy? Find something related to sports!\u003c/li\u003e\n\u003cli\u003ewant to play video games? Sports games!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e(\u0026ldquo;Sports\u0026rdquo; is just an example, it might as well be \u0026ldquo;arts and crafts\u0026rdquo; or \u0026ldquo;birdwatching\u0026rdquo; or something else.)\u003c/p\u003e\n\u003cp\u003eCompare that with someone like myself, who has like a bajillion hobbies/interests, if I needed to think about things like the above, I would have to choose among topics like (in no particular order, and non extensive):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003esoftware development (this already covers a lot of subtopics by itself!)\u003c/li\u003e\n\u003cli\u003ethe tech industry\u003c/li\u003e\n\u003cli\u003estartups/entrepreneurship\u003c/li\u003e\n\u003cli\u003egeneral science/advances in science\u003c/li\u003e\n\u003cli\u003egaming (pc, console, handheld, boardgames, esports)\u003c/li\u003e\n\u003cli\u003egame design/development\u003c/li\u003e\n\u003cli\u003emagic the gathering\u003c/li\u003e\n\u003cli\u003ebooks (sci-fi, fantasy)\u003c/li\u003e\n\u003cli\u003ecomics (marvel, dc, manga, webcomics, etc)\u003c/li\u003e\n\u003cli\u003ewriting\u003c/li\u003e\n\u003cli\u003eart/drawing/sketching\u003c/li\u003e\n\u003cli\u003epolitics/current events\u003c/li\u003e\n\u003cli\u003ejokes/puns\u003c/li\u003e\n\u003cli\u003eblogging\u003c/li\u003e\n\u003cli\u003emyths and legends/history\u003c/li\u003e\n\u003cli\u003einternet subculture/memes/shitposting\u003c/li\u003e\n\u003cli\u003etrivia\u003c/li\u003e\n\u003cli\u003eself-improvement/productivity/optimization\u003c/li\u003e\n\u003cli\u003egeneral pop/geek culture (movies/tv)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe wide variety of interests makes it more difficult to stay focused on and specialize in a particular niche. This blog is a great example: it\u0026rsquo;s not the sort of thing that is difficult to monetize or focus into a large audience because I tend to write about a lot of things and no one thing in particular. I\u0026rsquo;ve tried spinning off separate blogs that focus on particular topics only: I\u0026rsquo;ve started an MtG-focused blog and a comic-book focused blog. I can put in the effort for these things because I do have interest, but because of the wide variety of interests, my focus on each one inevitably waxes and wanes, and when I look away from those particular niches to focus on other things for a while, those blogs suffer and eventually die.\u003c/p\u003e\n\u003cp\u003eI was thinking about this because the other day I was trying to sort/arrange my RSS feeds and I was like \u0026ldquo;Why am I following so many damn feeds?\u0026rdquo; and the answer was of course because I\u0026rsquo;m interested in so many things. I like reading things, but I also can\u0026rsquo;t read everything!\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not saying it\u0026rsquo;s a bad thing (or necessarily better or worse than a life with more focused interests!). But at best it\u0026rsquo;s a double-edged sword. It is difficult to find focus true, and one tends to jump from topic to topic at a moment\u0026rsquo;s notice. But there are a lot of perks as well. Life is almost always interesting, there is very little downtime, unless you choose it. There is always some event, some convention, some announcement, some new release to look forward to. Life is short and there is so much of it to appreciate and enjoy that for me personally it would feel like a waste to be so narrowly-focused. The world is huge and there is so much of it to embrace that it seems a shame to stay in one tiny corner of it for all your life.\u003c/p\u003e\n\u003cp\u003eI guess I will kind of just lean into it and enjoy the chaos it brings to life!\u003c/p\u003e\n",
            "summary": "I am envious sometimes of people who are able to narrow down their interests to a specific scope, it\u0026rsquo;s kind of like a lot of their decisions are made easier. Consider a person whose only hobby/interest is something like sports (not necessarily all sports, or just one sport, just sports in general).\n looking for something to do in your spare time? Sports! want to watch something on TV? Sports! picking up a newspaper, but don\u0026rsquo;t have much time to read?",
            "date_published": "2019-11-08T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/unfocused/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192676847038992390/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/python-yield/",
            "url": "https://mirror.roytang.net/2019/11/python-yield/",
            "path": "/2019/11/python-yield/",
            "title": "DevNotes: Python's yield",
            "content_html": "\u003cp\u003eI\u0026rsquo;ve been using Python for well over 10 years, and I still don\u0026rsquo;t have an intuitive mastery of one of its keywords: \u003ccode\u003eyield\u003c/code\u003e. Everytime I see it in someone\u0026rsquo;s code I need to stop and mentally remind myself what it does. I figured I\u0026rsquo;d write a devnote to help improve my recall.\u003c/p\u003e\n\u003cp\u003eTypically, \u003ccode\u003eyield\u003c/code\u003e is used in a function with a loop, like so:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003edef\u003c/span\u003e \u003cspan style=\"color:#a6e22e\"\u003esome_func\u003c/span\u003e(lim):\n    \u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e i \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e range(\u003cspan style=\"color:#ae81ff\"\u003e0\u003c/span\u003e, lim):\n        \u003cspan style=\"color:#66d9ef\"\u003eyield\u003c/span\u003e i\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003e\u003ccode\u003eyield\u003c/code\u003e means the function returns a \u0026ldquo;generator\u0026rdquo; that can be used as an iterable in a loop:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e val \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e some_func(\u003cspan style=\"color:#ae81ff\"\u003e5\u003c/span\u003e):\n    \u003cspan style=\"color:#66d9ef\"\u003eprint\u003c/span\u003e(val)\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eYou can also straight up convert the generator into a list via something like \u003ccode\u003elist(some_func(5))\u003c/code\u003e.\u003c/p\u003e\n\u003cp\u003eThe equivalent function, without using \u003ccode\u003eyield\u003c/code\u003e would be something like:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003edef\u003c/span\u003e \u003cspan style=\"color:#a6e22e\"\u003esome_func\u003c/span\u003e(lim):\n    result \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e []\n    \u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e i \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e range(\u003cspan style=\"color:#ae81ff\"\u003e0\u003c/span\u003e, lim):\n        result\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003eappend(i)\n    \u003cspan style=\"color:#66d9ef\"\u003ereturn\u003c/span\u003e result\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eThis is definitely the kind of function I\u0026rsquo;ve written often! Now that I\u0026rsquo;ve actually written it down, \u003ccode\u003eyield\u003c/code\u003e is rather straightforward, and hopefully it can help me shorten some of the python code I\u0026rsquo;ll be writing in the future!\u003c/p\u003e\n",
            "summary": "I\u0026rsquo;ve been using Python for well over 10 years, and I still don\u0026rsquo;t have an intuitive mastery of one of its keywords: yield. Everytime I see it in someone\u0026rsquo;s code I need to stop and mentally remind myself what it does. I figured I\u0026rsquo;d write a devnote to help improve my recall.\nTypically, yield is used in a function with a loop, like so:\ndef some_func(lim): for i in range(0, lim): yield i yield means the function returns a \u0026ldquo;generator\u0026rdquo; that can be used as an iterable in a loop:",
            "date_published": "2019-11-07T00:00:00+00:00",
            "date_modified": "2020-09-16T14:57:40+08:00",
            "section": "post",
            "source_path": "post/2019/11/python-yield/index.md"
            , "tags": ["software development","devnotes"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192280118468792321/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1192280118468792321#favorited-by-1000529293171150849",
                    "source_file": "like-20191107T233128-webmention-722387.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/dsg036/",
            "url": "https://mirror.roytang.net/2019/11/dsg036/",
            "path": "/2019/11/dsg036/",
            "title": "",
            "content_html": "\u003ch4 id=\"posted-on-ronepiece-found-these-in-storage-from-years-ago-forgot-where-i-got-them-idk-why-luffy-has-a-stickhttpsredditcomronepiececommentsdsg036found_these_in_storage_from_years_ago_forgot\"\u003ePosted on r/OnePiece: \u003ca href=\"https://reddit.com/r/OnePiece/comments/dsg036/found_these_in_storage_from_years_ago_forgot/\"\u003eFound these in storage from years ago. Forgot where I got them. IDK why Luffy has a stick.\u003c/a\u003e\u003c/h4\u003e\n",
            "summary": "Posted on r/OnePiece: Found these in storage from years ago. Forgot where I got them. IDK why Luffy has a stick. ",
            "date_published": "2019-11-06T21:03:01+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/dsg036/index.md"
            , "tags": ["onepiece"]
            , "syndicated": [{"type":"reddit","url":"https://reddit.com/r/OnePiece/comments/dsg036/found_these_in_storage_from_years_ago_forgot/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/handover-documentation/",
            "url": "https://mirror.roytang.net/2019/11/handover-documentation/",
            "path": "/2019/11/handover-documentation/",
            "title": "The Perils of Handover Documentation",
            "content_html": "\u003cp\u003eA while back I found myself having to figure out how to compile/build/run a mobile application. The developers previously assigned to the project were no longer available to consult with, but they did leave behind some documentation. However, their documentation quality left a lot to be desired. The instructions they left basically amounted to:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003ccode\u003enpm install\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eionic serve\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eionic codrova run android\u003c/code\u003e/\u003ccode\u003eios\u003c/code\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eOkay, first sign of trouble is that their instructions were basically commands that anyone who knew the app used Ionic would be able to Google. But ok, I gave this a shot, even though I had not used Ionic/Cordova before, I assumed the simple documentation meant it would be straightforward (spoiler: it was not).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirst problem: \u003ccode\u003enpm install\u003c/code\u003e fails. Okaaaay. I dig around for a bit and figure out there\u0026rsquo;s an incompatibility between one of the packages and my node version (12). Some more digging around tells me that the previous developers likely were using Node 8. I switch to Node 8 and \u003ccode\u003enpm install\u003c/code\u003e finishes successfully, somehow.\u003c/li\u003e\n\u003cli\u003eSecond problem: \u003ccode\u003eionic serve\u003c/code\u003e throws an error from one of the dependencies. A bit more digging around. Reading ionic docs. Stackoverflow. Turns out there was some extra configuration needed to be added if you\u0026rsquo;re doing this stuff on Windows. (I later found out the previous developers had used Ubuntu.)\u003c/li\u003e\n\u003cli\u003eThird problem: \u003ccode\u003eionic serve\u003c/code\u003e throws a whole bunch of typescript errors. Why? After facepalming for a bit, I dig around again. And dig some more. Looks like dependency issues. But the \u003ccode\u003epackage.json\u003c/code\u003e has dozens of dependencies, it would take me forever to figure out the problem. I find myself digging through the repository\u0026rsquo;s commit history trying to figure out if there was a recent change to the \u003ccode\u003epackage.json\u003c/code\u003e that would cause the issue. What I notice instead is that a couple of weeks before the handover, someone deleted \u003ccode\u003epackage-lock.json\u003c/code\u003e from the repository for some unknown reason. Deciding to try it out, I restore the old version of \u003ccode\u003epackage-lock.json\u003c/code\u003e, do the whole \u003ccode\u003enpm install\u003c/code\u003e dance again, and sure enough the typescript errors vanish. But we\u0026rsquo;re not yet done.\u003c/li\u003e\n\u003cli\u003eFourth problem: \u003ccode\u003eionic serve\u003c/code\u003e no longer throws an error, but when it launches the browser, there\u0026rsquo;s a cyclic error stacktrace shown. Some stackoverflow answers tells me this is because something can\u0026rsquo;t be serialize it, and I trace the problem to a generic error handler that just calls \u003ccode\u003econsole.log\u003c/code\u003e. I comment this out so that I can see the actual error, which is \u0026ldquo;cordova doesn\u0026rsquo;t exist\u0026rdquo; (or something to that effect). I realize this means that the mobile app uses some native-specific things, so Cordova is required and it\u0026rsquo;s not going to work when served via web, so why did they include this step?\u003c/li\u003e\n\u003cli\u003eSo instead I do \u003ccode\u003eionic cordova run android\u003c/code\u003e (after installing the necessary Android Studio/SDK things\u0026hellip;this was after my \u003ca href=\"/2019/09/two-backups/\"\u003erecent computer troubles\u003c/a\u003e, so I had a fresh OS install.) And yes, long story short, I am finally able to get the Android app running in an emulator (and eventually in a device, and then the iOS version as well).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI recounted this because I could use it as lesson to note that even when you do have documentation, there are so many ways the documentation can be insufficient. In this case:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe dependencies/requirements were not specified\u003c/li\u003e\n\u003cli\u003ethey did not have someone actually go through these steps from a fresh install to verify things would work\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA case could also be made that they should have just had something like a Docker setup available, but they actually did have a \u003ccode\u003edocker-compose.yml\u003c/code\u003e in the repository! Sadly, it wouldn\u0026rsquo;t have worked either because it referenced some environment variables that I had no idea what the value needed to be. And besides, my PC doesn\u0026rsquo;t support Docker (silly Windows Home), but looking at the docker image did clue me in to what Node version to use.\u003c/p\u003e\n\u003cp\u003eIn this instance, it was also a problem was that the old team was asked to provide the documentation only after the handover (due to circumstances beyond our control). Ideally, a handover would have them available for consultation should there be problems found with their documentation, and the documentation would only be cleared for acceptance after such review. (Realistically, a lot of documentation like user manuals wouldn\u0026rsquo;t even be looked at, but in this case, the ability to build the application was kind of crucial!)\u003c/p\u003e\n",
            "summary": "A while back I found myself having to figure out how to compile/build/run a mobile application. The developers previously assigned to the project were no longer available to consult with, but they did leave behind some documentation. However, their documentation quality left a lot to be desired. The instructions they left basically amounted to:\n npm install ionic serve ionic codrova run android/ios  Okay, first sign of trouble is that their instructions were basically commands that anyone who knew the app used Ionic would be able to Google.",
            "date_published": "2019-11-06T12:07:37+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/documentation/index.md"
            , "tags": ["software development"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192065025537716226/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4ftel9hegp/",
            "url": "https://mirror.roytang.net/2019/11/b4ftel9hegp/",
            "path": "/2019/11/b4ftel9hegp/",
            "title": "",
            "content_html": "\u003cp\u003e#sketchdaily dumplings. another quick one for catchup purposes\u003c/p\u003e\n",
            "summary": "#sketchdaily dumplings. another quick one for catchup purposes",
            "date_published": "2019-11-05T16:02:10+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4fTel9heGp/index.md"
            , "tags": ["sketchdaily"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191747542209486853/"},{"type":"instagram","url":"https://instagram.com/p/B4fTel9heGp/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/drfjpn/november_4th_dumplings/f6m8qxc/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4fpyqbhbke/",
            "url": "https://mirror.roytang.net/2019/11/b4fpyqbhbke/",
            "path": "/2019/11/b4fpyqbhbke/",
            "title": "",
            "content_html": "\u003cp\u003eCharging monstrosaur from ixalan rough sketch #sketchdaily #mtg. This is one of those things where I’d like to flesh it out and color it but I don’t have time and I’m already a few days behind on the daily sketches. maybe I’ll revisit it in the future\u003c/p\u003e\n",
            "summary": "Charging monstrosaur from ixalan rough sketch #sketchdaily #mtg. This is one of those things where I’d like to flesh it out and color it but I don’t have time and I’m already a few days behind on the daily sketches. maybe I’ll revisit it in the future",
            "date_published": "2019-11-05T15:17:41+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4fPyQbhbkE/index.md"
            , "tags": ["sketchdaily","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191736349210091520/"},{"type":"instagram","url":"https://instagram.com/p/B4fPyQbhbkE/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dqydoa/november_3rd_tufted_coquette/f6m4r4o/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1191702488740548608/",
            "url": "https://mirror.roytang.net/2019/11/1191702488740548608/",
            "path": "/2019/11/1191702488740548608/",
            "title": "",
            "content_html": "\u003cp\u003eA bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.\u003c/p\u003e\n",
            "summary": "A bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.",
            "date_published": "2019-11-05T13:03:08+00:00",
            "date_modified": "2019-11-05T13:22:32+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1191702488740548608/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191702488740548608/"}]
            
            
            }
        
    ]
     , "prev": "/p/25/feed.json" 
     , "next": "/p/27/feed.json" 
}