{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2019/09/1168122098872545281/",
            "url": "https://mirror.roytang.net/2019/09/1168122098872545281/",
            "path": "/2019/09/1168122098872545281/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/wrongwaygoback/\"\u003e@wrongwaygoback\u003c/a\u003e Shocks arent rotating yet tho?\u003c/p\u003e\n",
            "summary": "@wrongwaygoback Shocks arent rotating yet tho?",
            "date_published": "2019-09-01T11:23:05+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/09/1168122098872545281/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1168122098872545281/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/09/",
            "url": "https://mirror.roytang.net/2019/09/",
            "path": "/2019/09/",
            "title": "Monthly Archives for 09 2019",
            "content_html": "",
            "summary": "",
            "date_published": "2019-09-01T00:00:00+00:00",
            "date_modified": "2019-09-01T15:00:18+00:00",
            "section": "archm",
            "source_path": "archm/2019-09.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/09/mtg-arena-thoughts-on-historic/",
            "url": "https://mirror.roytang.net/2019/09/mtg-arena-thoughts-on-historic/",
            "path": "/2019/09/mtg-arena-thoughts-on-historic/",
            "title": "MTG Arena: Thoughts on Historic",
            "content_html": "\u003cp\u003eMagic Arena\u0026rsquo;s community was in an uproar this past weekend over the latest \u003ca href=\"https://magic.wizards.com/en/articles/archive/magic-digital/mtg-arena-state-beta-august-29-2019\"\u003estate of the beta\u003c/a\u003e, mostly over the announced plans for Arena\u0026rsquo;s eternal Historic format that will become relevant with the coming rotation. It\u0026rsquo;s likely that Wizards will backpedal in some way in response to the community, but here are my thoughts for now:\u003c/p\u003e\n\u003ch3 id=\"historic-cards-to-cost-double-wildcards-to-craft\"\u003eHistoric cards to cost double wildcards to craft\u003c/h3\u003e\n\u003cp\u003eThis is the universally-reviled bit and has been the target of much outrage, accursing Wizards of being greedy etc. On this point I am in agreement with the community that yes, this sucks. On the other hand, I\u0026rsquo;ve learned not to be outraged by ridiculous DLC/microstransaction pricing. If something is too unaffordable, I simply won\u0026rsquo;t indulge it. If I can\u0026rsquo;t afford to craft a historic deck, I won\u0026rsquo;t play the format, until I can. More on this later.\u003c/p\u003e\n\u003cp\u003eWotC\u0026rsquo;s plans for Historic looks to me like they are trying to replicate the \u0026ldquo;scarcity\u0026rdquo; inherent to paper eternal formats like Modern and Legacy. Arena is actually a bit more generous that either MTGO or HS, since both of those don\u0026rsquo;t sell boosters from older sets in their stores. WotC still plans to have Historic sets available, though only in 45-pack bundles (I don\u0026rsquo;t care about this either, as I rarely purchase packs anyway, but some people also dislike this change). The 2-for-1 crafting cost is still uniquely Arena and thus their own bad decision.\u003c/p\u003e\n\u003cp\u003eIn general, digital games have to have slightly different business models than IRL counterparts. Arena is unique in this regard since it\u0026rsquo;s the only modern digital CCG that has a strong paper analogue. Trying to replicate the scarcity of paper Magic may have made sense for MTGO, since that platform allows trading and thus cashing out, but for Arena it doesn\u0026rsquo;t make sense.\u003c/p\u003e\n\u003cp\u003eMost likely the goal is to ensure that Standard is the main gameplay mode especially for newer players, as Standard generall drives sales. But increasing the crafting cost is unnecessary. The barrier to entry for Historic will already be pretty high for a new player anyway, even if the crafting cost was 1-to-1, since a new player will have more sets to catch up with. There is no sensible reason for doing this, as it is only setting Historic up for failure.\u003c/p\u003e\n\u003ch3 id=\"curated-cards-to-be-periodically-added-to-historic\"\u003eCurated cards to be periodically added to Historic\u003c/h3\u003e\n\u003cp\u003eFor this one, the community is more split. There are those like me who consider this a good idea, as long as they are conservative with the power level of the curated cards added to historic. My personal preference is that they release cards that were pretty good in standard during their time, but haven\u0026rsquo;t really found a good place in Modern, so that they have a chance to shine. Clouding the issue is a \u003ca href=\"https://twitter.com/MTG_Arena/status/1167184191215165440\"\u003erecent tweet by the official twitter\u003c/a\u003e where they suggest that examples of curated cards could be Brainstorm, Firebolt, Wurmcoil Engine, and Dark Confidant, all of which are at least Modern power level.\u003c/p\u003e\n\u003cp\u003eThose who dislike this change seem to be mainly because they don\u0026rsquo;t want Historic to be Modern or Legacy. I\u0026rsquo;ll be honest, I would love it if I could play Modern on Arena. But technically, it\u0026rsquo;s not likely that the historic format will ever be the same as Modern (or Legacy), unless WotC goes crazy. It\u0026rsquo;s highly unlikely that they would add the Tron lands or Storm cards or Dredge cards into Historic for example. It would take a lot of cards for historic to even come close to Modern. But I understand the concern \u0026ndash; there are a lot of broken cards in Modern and Legacy, and WotC is made up of humans, so there is a nontrivial risk that they will screw up and add something ridiculous into Historic, breaking the format. The Brainstorm inclusion in the tweet linked above certainly doesn\u0026rsquo;t help.\u003c/p\u003e\n\u003cp\u003eI understand the appeal of having an eternal format that is Arena sets only, moving forward. Some also want the previous Arena-implemented sets (Shadows over Innistrad, Kaladesh, and Amonkhet) to be included as well. Some prefer that Arena start adding sets one by one working backwards and stopping at Magic Origins. In general, these are all in the same vein. The idea generally is that more recent sets are more \u0026ldquo;balanced\u0026rdquo; in terms of power level, especially since Play Design is now a thing, thus the format will probably be healthier in generally than Modern which is a turn 4 format.\u003c/p\u003e\n\u003cp\u003eThere\u0026rsquo;s also a secondary concern that adding curated cards so often (the initial plan is quarterly) will shake up the metagame more often and make Historic even more expensive as a format to get into, as you need to be getting new cards every so often. The assumption is that the curated cards will be high power level staples which would be necessary to participate in the format. Again, such concern could be mitigated by careful curation. If the curation is done well, each batch of new cards could introduce new strategies and make small changes to the metagame without necessarily invalidating entire decks. And again, there is a nontrivial risk of screw-ups.\u003c/p\u003e\n\u003cp\u003eTo assuage these concerns in general, what I would do if were WotC would be to introduce two eternal formats instead. One is just Arena eternal - all Arena sets (maybe including Amonkhet, but people don\u0026rsquo;t seem to like Kaladesh very much \u003ca href=\"https://gatherer.wizards.com/Pages/Card/Details.aspx?multiverseid=417766\"\u003efor some reason\u003c/a\u003e), and a second one which is basically just what they\u0026rsquo;re already planning for Historic. More options is always better (although it might \u0026ldquo;confuse the new players\u0026rdquo;, whatever that means).\u003c/p\u003e\n\u003ch3 id=\"managing-your-own-expectations\"\u003eManaging your own expectations\u003c/h3\u003e\n\u003cp\u003eCircling back to my point earlier. If Historic is too cost prohibitive, I won\u0026rsquo;t play it, until I can. In many ways, it\u0026rsquo;s a case of managing your own expectations for an online game. I like playing Magic, and Arena lets me do that at a manageable cost (i.e. free and conveniently). The addition of the Historic format doesn\u0026rsquo;t change that. I can still play Standard regardless of whether I can afford Historic or not. Until this state of the beta, I wasn\u0026rsquo;t even thinking about what happens to my cards that are rotating out, whether I\u0026rsquo;ll be able to use them again or not. For most of those cards, I drafted them, I played with them, I used them with standard decks and I generally enjoyed my time playing Arena (Nexus of Fate notwithstanding). It helps that I am a f2p player, as all I invested was my time, and since I enjoyed my time, it was not wasted time for me no matter what happens to those cards.\u003c/p\u003e\n\u003cp\u003eI guess it\u0026rsquo;s a different matter if you\u0026rsquo;ve been paying for the cards? IDK, I have a friend who\u0026rsquo;s bought at least a bundle every time a new set comes in, I haven\u0026rsquo;t heard any complaints from him. If you\u0026rsquo;ve invested more into this game, I get that it\u0026rsquo;s a feel bad if you can\u0026rsquo;t make the most of the game by participating in all the available modes because of cost.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s a bit like Wild in Hearthstone. I played Hearthstone for a while before rotation became a thing, so I had a lot of cards that are now only playable in Wild. I don\u0026rsquo;t really play HS anymore, but in the short time when I was active and Wild was available, I probably played only a handful of games. And I never disenchanted all those cards, even if I didn\u0026rsquo;t get to play them much. I don\u0026rsquo;t care that they\u0026rsquo;re just sitting there not doing anything.\u003c/p\u003e\n\u003ch3 id=\"in-conclusion\"\u003eIn conclusion\u003c/h3\u003e\n\u003cp\u003eI\u0026rsquo;m looking forward to how WotC responds to the outrage.\u003c/p\u003e\n",
            "summary": "Magic Arena\u0026rsquo;s community was in an uproar this past weekend over the latest state of the beta, mostly over the announced plans for Arena\u0026rsquo;s eternal Historic format that will become relevant with the coming rotation. It\u0026rsquo;s likely that Wizards will backpedal in some way in response to the community, but here are my thoughts for now:\nHistoric cards to cost double wildcards to craft This is the universally-reviled bit and has been the target of much outrage, accursing Wizards of being greedy etc.",
            "date_published": "2019-09-01T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/09/mtg-arena-historic/index.md"
            , "tags": ["ccgs","mtg","gaming"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1168183317507858433/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167885693051236358/",
            "url": "https://mirror.roytang.net/2019/08/1167885693051236358/",
            "path": "/2019/08/1167885693051236358/",
            "title": "",
            "content_html": "\u003cp\u003eTwitter should let us add private notes to people we follow. So I can remember why I follow people or how I learned about them in the first place\u003c/p\u003e\n",
            "summary": "Twitter should let us add private notes to people we follow. So I can remember why I follow people or how I learned about them in the first place",
            "date_published": "2019-08-31T19:43:42+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167885693051236358/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167885693051236358/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/watching-lately-aug-2019/",
            "url": "https://mirror.roytang.net/2019/08/watching-lately-aug-2019/",
            "path": "/2019/08/watching-lately-aug-2019/",
            "title": "Watching Lately: August 2019: Young Justice, The Boys, Fleabag, One Cut of the Dead",
            "content_html": "\u003cp\u003eHmm, surprisingly I haven\u0026rsquo;t watched too much stuff this month.\u003c/p\u003e\n\u003ch3 id=\"eigasai\"\u003eEigasai\u003c/h3\u003e\n\u003cp\u003eI watched a Japanese film at Eigasai in UP Diliman for the first time ever, upon the invite of some friends. We saw \u003cstrong\u003eOne Cut of the Dead\u003c/strong\u003e a comedy zombie film. It was great and it was hilarious, although you must make sure not to lose patience with the first thirty minutes. I went in blind not knowing anything about it other than \u0026ldquo;Japanese comedy zombie movie\u0026rdquo;, so you should too! Easily one of the funniest movies I\u0026rsquo;ve seen in recent years.\u003c/p\u003e\n\u003ch3 id=\"young-justice\"\u003eYoung Justice\u003c/h3\u003e\n\u003cp\u003eBack half of Young Justice Outsiders finished this week. I\u0026rsquo;ve honestly been a bit whelmed for this half of the season as I feel like they\u0026rsquo;re all over the place and there\u0026rsquo;s too many plot threads going on at once. Still an enjoyable watch especially for DC fans of course. The thing about having such a large cast is that it\u0026rsquo;s difficult to focus on any one of them too long, but this season was all about Halo, Geoforce and Cyborg so the arc endings pretty much revolved around those three. It feels like so many status quo changes happened in the last episode though, felt a bit crammed. Also, some spoilers:\u003c/p\u003e\n\n\u003cdetails class=\"spoiler\"\u003e\n    \u003csummary\u003e(Spoilers)\u003c/summary\u003e\n    \u003cul\u003e\n\u003cli\u003eI feel like the Light declaring at the end that their gains were sufficient vs Luthor\u0026rsquo;s original plans seemed ridiculous (i.e. controlling Markovia vs controlling and registering all superhumans). They already had one puppet nation under their control (Queen Bee is right there!) and they\u0026rsquo;re literally planning to go against Darkseid, how does controlling Markovia help? Feels like a very post-facto justification.\u003c/li\u003e\n\u003cli\u003eI did like that they chose not to complete their Judas Contract re-telling in a similar manner and we get a \u0026ldquo;redeemed\u0026rdquo; Tara to contrast with the \u0026ldquo;fallen\u0026rdquo; Geoforce\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c/details\u003e\n\u003cp /\u003e\n\n\u003ch3 id=\"fleabag\"\u003eFleabag\u003c/h3\u003e\n\u003cp\u003eI didn\u0026rsquo;t know anything about this Amazon Prime series going in either, only that it was a comedy and it was well-reviewed. I did enjoy watching it, although it\u0026rsquo;s more of a tragic comedy than anything else. Basically about how people deal with absurdly difficult situations in their daily life. The story is well-told, but I\u0026rsquo;m not sure I get all the hype.\u003c/p\u003e\n\u003ch3 id=\"the-boys\"\u003eThe Boys\u003c/h3\u003e\n\u003cp\u003eAnother Amazon Prime series. I hadn\u0026rsquo;t read the source material, and I was a bit turned off by the first episode, but I powered through. I knew it would be dark going in, and possibly gratuitous in terms of the sex and violence at some points, so not many surprises there. The plot seems in my head to be \u0026ldquo;What if superheroes were driven by a greedy corporation\u0026rdquo;, which certainly doesn\u0026rsquo;t help address my \u003ca href=\"/2018/10/capitalism/\"\u003emisgivings about capitalism\u003c/a\u003e. The plot also reminds me of Sanderson\u0026rsquo;s book Reckoners, which was also a story about a resistance trying to oppose a superhuman regime led by a Superman-like figure.\u003c/p\u003e\n\u003cp\u003eLooking over the Wikipedia entry for the comic book series, it seems the TV show had some significant divergences, which is understandable, so I don\u0026rsquo;t think I\u0026rsquo;ll be seeking out the comic books. The series was enjoyable enough to binge over a few days, although some parts are a bit predictable. I did like the treatment given to Hugh and Annie/Starlight. The cast is pretty good too, I almost didn\u0026rsquo;t recognize Simon Pegg (because it was such a serious role) and Elisabeth Shue (because\u0026hellip;I haven\u0026rsquo;t seen her in anything in a while?). Oh and Gus Fring is also here!\u003c/p\u003e\n\u003cp\u003eI think I ended up enjoying the season overall, as it tackles a lot of issues I relate with. I will probably be watching Season 2.\u003c/p\u003e\n\u003ch3 id=\"rockos-modern-life-static-cling\"\u003eRocko\u0026rsquo;s Modern Life: Static Cling\u003c/h3\u003e\n\u003cp\u003eNetflix tried to bring Rocko into the modern era, although strangely none of the characters have aged at all. Although they are cartoon characters so I guess that makes sense? The special is about as ridiculous as the old cartoon was, unsurprisingly, although it does try to convey a message about how change is an inevitable part of life. I did like that they had a reference to my favorite episode, R-E-C-Y-C-L-E Recycle~\u003c/p\u003e\n\u003cp\u003eMore next month! Maybe!\u003c/p\u003e\n",
            "summary": "Hmm, surprisingly I haven\u0026rsquo;t watched too much stuff this month.\nEigasai I watched a Japanese film at Eigasai in UP Diliman for the first time ever, upon the invite of some friends. We saw One Cut of the Dead a comedy zombie film. It was great and it was hilarious, although you must make sure not to lose patience with the first thirty minutes. I went in blind not knowing anything about it other than \u0026ldquo;Japanese comedy zombie movie\u0026rdquo;, so you should too!",
            "date_published": "2019-08-31T00:00:00+00:00",
            "date_modified": "2021-04-02T11:01:07+08:00",
            "section": "post",
            "source_path": "post/2019/08/watching-lately-aug-2019/index.md"
            , "tags": ["Pop Culture","Movies","TV","watching lately"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167591080860295171/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1167591080860295171#favorited-by-148522466",
                    "source_file": "like-20190831T160002-webmention-681182.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/cxguf6/",
            "url": "https://mirror.roytang.net/2019/08/cxguf6/",
            "path": "/2019/08/cxguf6/",
            "title": "",
            "content_html": "\u003ch4 id=\"posted-on-rmagicarena-settings-aside-the-issues-with-wildcard-pricing-what-curated-cards-would-you-like-to-see-enter-the-historic-formathttpsredditcomrmagicarenacommentscxguf6settings_aside_the_issues_with_wildcard_pricing\"\u003ePosted on r/MagicArena: \u003ca href=\"https://reddit.com/r/MagicArena/comments/cxguf6/settings_aside_the_issues_with_wildcard_pricing/\"\u003eSettings aside the issues with wildcard pricing, what curated cards would you like to see enter the Historic format?\u003c/a\u003e\u003c/h4\u003e\n\u003cp\u003eOf course the suggestions from Wotc twitter (Bob, Bolt and Wurmcoil) are a bit ridiculous. I imagine that a lower power level would be needed. Historic needs to differentiate itself from Standard but not be as ridiculous as modern, and build up slowly but surely. I would like to see cards that had their time in Standard but haven\u0026rsquo;t really found a good place in Modern. I don\u0026rsquo;t agree with those saying it should be Origins-forward though, I think that\u0026rsquo;s unnecessarily restrictive.\u003c/p\u003e\n\u003cp\u003eSome of my initial ideas (the first 10 are color balanced, but the rest are not):\u003c/p\u003e\n\u003cp\u003eKnight of the White Orchid\u003c/p\u003e\n\u003cp\u003eKeiga, the Tide Star\u003c/p\u003e\n\u003cp\u003eKorlash, Heir to Blackblade\u003c/p\u003e\n\u003cp\u003ePia and Kiran Nalaar\u003c/p\u003e\n\u003cp\u003eWren\u0026rsquo;s Run Packmaster\u003c/p\u003e\n\u003cp\u003eOjutai\u0026rsquo;s Command\u003c/p\u003e\n\u003cp\u003eShadowmage Infiltrator\u003c/p\u003e\n\u003cp\u003eDemigod of Revenge\u003c/p\u003e\n\u003cp\u003eHuntmaster of the Fells\u003c/p\u003e\n\u003cp\u003eDauntless Escort\u003c/p\u003e\n\u003cp\u003eSiege Rhino\u003c/p\u003e\n\u003cp\u003eCruel Ultimatum\u003c/p\u003e\n\u003cp\u003eDesolation Angel\u003c/p\u003e\n\u003cp\u003eMystical Teachings\u003c/p\u003e\n\u003cp\u003eChar\u003c/p\u003e\n\u003cp\u003eKessig Wolf Run\u003c/p\u003e\n",
            "summary": "Posted on r/MagicArena: Settings aside the issues with wildcard pricing, what curated cards would you like to see enter the Historic format? Of course the suggestions from Wotc twitter (Bob, Bolt and Wurmcoil) are a bit ridiculous. I imagine that a lower power level would be needed. Historic needs to differentiate itself from Standard but not be as ridiculous as modern, and build up slowly but surely. I would like to see cards that had their time in Standard but haven\u0026rsquo;t really found a good place in Modern.",
            "date_published": "2019-08-30T21:21:17+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/cxguf6/index.md"
            , "tags": ["magicarena"]
            , "syndicated": [{"type":"reddit","url":"https://reddit.com/r/MagicArena/comments/cxguf6/settings_aside_the_issues_with_wildcard_pricing/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/b1ynk3whtsf/",
            "url": "https://mirror.roytang.net/2019/08/b1ynk3whtsf/",
            "path": "/2019/08/b1ynk3whtsf/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-08-30T10:17:14+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/08/B1yNK3WhtsF/index.md"
            
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B1yNK3WhtsF/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167385879800926215/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167366753992593408/",
            "url": "https://mirror.roytang.net/2019/08/1167366753992593408/",
            "path": "/2019/08/1167366753992593408/",
            "title": "",
            "content_html": "\u003cp\u003ePutting yourself out there is stressful\u003c/p\u003e\n",
            "summary": "Putting yourself out there is stressful",
            "date_published": "2019-08-30T09:21:37+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167366753992593408/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167366753992593408/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/cx27b1/",
            "url": "https://mirror.roytang.net/2019/08/cx27b1/",
            "path": "/2019/08/cx27b1/",
            "title": "",
            "content_html": "\u003ch4 id=\"posted-on-rcoins-how-to-clean-grimy-and-rusty-coinshttpsredditcomrcoinscommentscx27b1how_to_clean_grimy_and_rusty_coins\"\u003ePosted on r/coins: \u003ca href=\"https://reddit.com/r/coins/comments/cx27b1/how_to_clean_grimy_and_rusty_coins/\"\u003eHow to clean grimy and rusty coins?\u003c/a\u003e\u003c/h4\u003e\n\u003cp\u003eI had a bunch of old coins from different countries and they were stored in a rusty metal container that was also exposed to water at some point. I checked it recently and many of the coins inside are covered in rust and grime and some of them are even stuck toģether. Any recommendations for cleaning them? Picture: \u003ca href=\"https://photos.app.goo.gl/AVSQzxfTjYVjwSqM8\"\u003ehttps://photos.app.goo.gl/AVSQzxfTjYVjwSqM8\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Posted on r/coins: How to clean grimy and rusty coins? I had a bunch of old coins from different countries and they were stored in a rusty metal container that was also exposed to water at some point. I checked it recently and many of the coins inside are covered in rust and grime and some of them are even stuck toģether. Any recommendations for cleaning them? Picture: https://photos.app.goo.gl/AVSQzxfTjYVjwSqM8",
            "date_published": "2019-08-29T23:10:20+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/cx27b1/index.md"
            , "tags": ["coins"]
            , "syndicated": [{"type":"reddit","url":"https://reddit.com/r/coins/comments/cx27b1/how_to_clean_grimy_and_rusty_coins/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/eyiq4sa/",
            "url": "https://mirror.roytang.net/2019/08/eyiq4sa/",
            "path": "/2019/08/eyiq4sa/",
            "title": "",
            "content_html": "\u003cp\u003ei’m not a serious collector or anything; these are mostly just leftover coins from foreign trips. so i’m not looking so much to preserve value, more like in the future i’d like to be able to pull them out and go “ah these are from my trip to so-and-so country, etc” i hope that makes sense\u003c/p\u003e\n",
            "summary": "i’m not a serious collector or anything; these are mostly just leftover coins from foreign trips. so i’m not looking so much to preserve value, more like in the future i’d like to be able to pull them out and go “ah these are from my trip to so-and-so country, etc” i hope that makes sense",
            "date_published": "2019-08-29T19:12:52+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/eyiq4sa/index.md"
            , "tags": ["coins"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/coins/comments/cx27b1/how_to_clean_grimy_and_rusty_coins/eyiq4sa/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167144053441351680/",
            "url": "https://mirror.roytang.net/2019/08/1167144053441351680/",
            "path": "/2019/08/1167144053441351680/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/magnifique_f8h/\"\u003e@magnifique_f8h\u003c/a\u003e what you can do half and half?\u003c/p\u003e\n",
            "summary": "@magnifique_f8h what you can do half and half?",
            "date_published": "2019-08-29T18:36:41+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167144053441351680/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167144053441351680/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/10157712766068912/",
            "url": "https://mirror.roytang.net/2019/08/10157712766068912/",
            "path": "/2019/08/10157712766068912/",
            "title": "",
            "content_html": "\u003cp\u003eSurvey: If you didn\u0026rsquo;t need to work, what would you be doing all day?\u003c/p\u003e\n",
            "summary": "Survey: If you didn\u0026rsquo;t need to work, what would you be doing all day?",
            "date_published": "2019-08-29T17:02:00+00:00",
            "date_modified": "2019-09-28T20:48:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/10157712766068912/index.md"
            
            , "syndicated": [{"type":"facebook","url":"https://www.facebook.com/stephen.roy.tang/posts/10157712766068912"}]
            
            , "comments": [
                { 
                    "url": "https://www.facebook.com/jonathan.tan.399041",
                    "source_file": "comment-20190829-000000-e5215935-56f2-4005-b897-c826d3b3b491.json"
                }, { 
                    "url": "https://www.facebook.com/robert.kee.33",
                    "source_file": "comment-20190829-000001-2ab7d856-6b51-418b-aecc-acdc32bd4b59.json"
                }, { 
                    "url": "https://www.facebook.com/cecile.monina",
                    "source_file": "comment-20190829-000002-2bbc4849-e75f-439a-b532-f9a95e4cdea7.json"
                }, { 
                    "url": "https://www.facebook.com/morristan",
                    "source_file": "comment-20190829-000003-ea79d6ba-dddd-4feb-b994-fd3bc907721e.json"
                }, { 
                    "url": "https://www.facebook.com/joyapreyes",
                    "source_file": "comment-20190829-000004-3a3add5e-afde-4d85-b395-1962b1fee139.json"
                }, { 
                    "url": "https://www.facebook.com/wesplaton",
                    "source_file": "comment-20190829-000005-a7669031-fcca-4bcf-b40d-f62429e072cd.json"
                }, { 
                    "url": "https://www.facebook.com/law.sia",
                    "source_file": "comment-20190829-000006-c76f960c-1e51-4a91-bbee-cefe9aa41a64.json"
                }, { 
                    "url": "https://www.facebook.com/maui.listana",
                    "source_file": "comment-20190829-000007-dd23e9bb-6a41-42d2-b022-bdecc4480b23.json"
                }, { 
                    "url": "https://www.facebook.com/claudine.umali",
                    "source_file": "comment-20190829-000008-d1e8f922-0770-4d68-b5af-86cd7f6f0878.json"
                }, { 
                    "url": "https://www.facebook.com/solar.archpope",
                    "source_file": "comment-20190829-000009-4c8186c8-f4ad-441b-ae5b-58acbe62f608.json"
                }, { 
                    "url": "https://www.facebook.com/lissramgurl01",
                    "source_file": "comment-20190829-000010-86326bf8-cc57-4e5b-a7eb-2f6da9642c04.json"
                }, { 
                    "url": "https://www.facebook.com/romancoat",
                    "source_file": "comment-20190829-000011-c20098f6-c4d3-4926-91a3-60513ebd459f.json"
                }, { 
                    "url": "https://www.facebook.com/joseph.discipulo",
                    "source_file": "comment-20190829-000012-1d7654db-b820-4473-aaf9-c25b2b62e887.json"
                }, { 
                    "url": "https://www.facebook.com/jennifer.l.roxas.9",
                    "source_file": "comment-20190829-000013-83748969-5e11-49e3-85ba-e4cb6ba121a7.json"
                }, { 
                    "url": "https://www.facebook.com/faithdonna",
                    "source_file": "comment-20190829-000014-6d7e9549-485e-44cf-9ffa-bc9c60be52e1.json"
                }, { 
                    "url": "https://www.facebook.com/barayantan",
                    "source_file": "comment-20190829-000015-75c043ca-1264-4864-9571-65b8ed98a426.json"
                }, { 
                    "url": "https://www.facebook.com/lponce",
                    "source_file": "comment-20190829-000016-6982111f-62cb-4720-b91c-d46e410bede1.json"
                }, { 
                    "url": "https://www.facebook.com/wblancosantos",
                    "source_file": "comment-20190829-000017-b75338bc-5276-45c6-8b47-77ccfab6f062.json"
                }, { 
                    "url": "https://www.facebook.com/leahaguirre",
                    "source_file": "comment-20190829-000018-830ae995-3188-4568-8ce3-638b61cbc37c.json"
                }, { 
                    "url": "https://www.facebook.com/luc.valencia",
                    "source_file": "comment-20190829-001000-f7163076-afe4-4193-bdad-695a0d963506.json"
                }, { 
                    "url": "https://www.facebook.com/wesplaton",
                    "source_file": "comment-20190829-001001-d034df4e-863b-46a1-9c46-a7cb8a5d9dbd.json"
                }, { 
                    "url": "https://www.facebook.com/artsorianojr",
                    "source_file": "comment-20190829-001002-da716d4c-4fa2-4a84-badc-a20bda8aac58.json"
                }, { 
                    "url": "https://www.facebook.com/wesplaton",
                    "source_file": "comment-20190829-001003-cd4f6c1f-b970-4958-9aed-6dc5c531ca95.json"
                }, { 
                    "url": "https://www.facebook.com/artsorianojr",
                    "source_file": "comment-20190829-001004-ea40e262-c765-4192-819c-6e39ded0a84d.json"
                }, { 
                    "url": "https://www.facebook.com/SabrinaTri",
                    "source_file": "comment-20190830-000019-e2e25d6a-c36d-4024-b2e7-ad4f94479661.json"
                }, { 
                    "url": "https://www.facebook.com/xenia.p.david",
                    "source_file": "comment-20190830-000020-63c0d661-9ba7-40bc-a959-d1c9890a3f3e.json"
                }, { 
                    "url": "https://www.facebook.com/lorie.santos.3958",
                    "source_file": "comment-20190830-000021-f7eaab0e-d4b1-4ec8-b8ed-a084b15f6223.json"
                }, { 
                    "url": "https://www.facebook.com/jvee.veneracion",
                    "source_file": "comment-20190830-000022-9246deff-e6f8-4f4f-98a7-0525e41e5540.json"
                }, { 
                    "url": "https://www.facebook.com/michael.santos.583",
                    "source_file": "comment-20190830-000023-65064e68-9ac6-42c9-9f28-278b7fb7322b.json"
                }, { 
                    "url": "https://www.facebook.com/elridge.gammad",
                    "source_file": "comment-20190830-000024-89c97b8a-1500-417d-b5ea-6472af263a36.json"
                }, { 
                    "url": "https://www.facebook.com/amielmalay",
                    "source_file": "comment-20190830-000025-d0e057bf-6d13-49c1-b789-0af904940035.json"
                }, { 
                    "url": "https://www.facebook.com/luc.valencia",
                    "source_file": "comment-20190830-000026-1107a93d-923d-427d-af4d-eeec92e88033.json"
                }, { 
                    "url": "https://www.facebook.com/jvee.veneracion",
                    "source_file": "comment-20190830-003640-42d1eba8-fd6b-44ac-9ed3-a831e4de9910.json"
                }, { 
                    "url": "https://www.facebook.com/lorie.santos.3958",
                    "source_file": "comment-20190830-003641-e0861d7d-a32c-4a01-ad6d-6bcfcffc55d7.json"
                }, { 
                    "url": "https://www.facebook.com/jvee.veneracion",
                    "source_file": "comment-20190830-003642-fac9de51-ccb7-40b0-aff1-f4b6fb1ed36a.json"
                }, { 
                    "url": "https://www.facebook.com/lissramgurl01",
                    "source_file": "comment-20190830-004500-0f14b371-9639-4ca9-963a-99e092455da9.json"
                }, { 
                    "url": "https://www.facebook.com/stephen.roy.tang",
                    "source_file": "comment-20190830-004501-0482565b-02f9-4996-b209-dfebbfd8bab2.json"
                }, { 
                    "url": "https://www.facebook.com/luc.valencia",
                    "source_file": "comment-20190830-004502-89c180fa-6318-4967-a97a-21da367f624c.json"
                }, { 
                    "url": "https://www.facebook.com/phwraengck",
                    "source_file": "comment-20190831-000027-095e3a54-b942-4d35-bbfd-f620dc0d3db4.json"
                }, { 
                    "url": "https://www.facebook.com/digolo",
                    "source_file": "comment-20190901-000028-74e4a1c5-6b69-475c-9213-51f4ee76feac.json"
                }, { 
                    "url": "https://www.facebook.com/angelica.lirag",
                    "source_file": "comment-20190901-000029-7cda6ff1-6136-41a3-9c65-c9b60d065f74.json"
                }, { 
                    "url": "https://www.facebook.com/noemiamor.jardino",
                    "source_file": "comment-20190901-000030-22e8ef74-6916-41bb-b38e-c8040bd98b59.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/python-s-strftime-directives/",
            "url": "https://mirror.roytang.net/2019/08/python-s-strftime-directives/",
            "path": "/2019/08/python-s-strftime-directives/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-08-29T09:12:53-05:00",
            "date_modified": "2020-02-10T07:11:30+08:00",
            "section": "links",
            "source_path": "links/2019/08/python-s-strftime-directives/index.md"
            
            , "syndicated": [{"type":"pocket","url":"https://strftime.org/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167081147387568133/"}]
            ,"link": "https://strftime.org/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167029305169170433/",
            "url": "https://mirror.roytang.net/2019/08/1167029305169170433/",
            "path": "/2019/08/1167029305169170433/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e ah i forgot to put the “stay at home” part lol\u003c/p\u003e\n",
            "summary": "@Westraid ah i forgot to put the “stay at home” part lol",
            "date_published": "2019-08-29T11:00:43+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167029305169170433/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167029305169170433/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167025554916143104/",
            "url": "https://mirror.roytang.net/2019/08/1167025554916143104/",
            "path": "/2019/08/1167025554916143104/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e its the perfect season for videogames\u003c/p\u003e\n",
            "summary": "@Westraid its the perfect season for videogames",
            "date_published": "2019-08-29T10:45:49+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167025554916143104/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167025554916143104/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1167000875090378752/",
            "url": "https://mirror.roytang.net/2019/08/1167000875090378752/",
            "path": "/2019/08/1167000875090378752/",
            "title": "",
            "content_html": "\u003cp\u003eYoutube subscriptions support RSS! Wew, that\u0026rsquo;s a game changer. But I also found out that Inoreader free plan limits me to 150 feeds and I can\u0026rsquo;t import all my subscribed channels lol. Time to shop around for a new reader! \u003ca href=\"https://support.google.com/youtube/answer/6224202?hl=en\u0026amp;authuser=0\"\u003ehttps://support.google.com/youtube/answer/6224202?hl=en\u0026amp;authuser=0\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Youtube subscriptions support RSS! Wew, that\u0026rsquo;s a game changer. But I also found out that Inoreader free plan limits me to 150 feeds and I can\u0026rsquo;t import all my subscribed channels lol. Time to shop around for a new reader! https://support.google.com/youtube/answer/6224202?hl=en\u0026amp;authuser=0",
            "date_published": "2019-08-29T09:07:45+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/08/1167000875090378752/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1167000875090378752/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/",
            "url": "https://mirror.roytang.net/2019/08/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/",
            "path": "/2019/08/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-08-29T02:08:20-05:00",
            "date_modified": "2020-02-10T07:11:30+08:00",
            "section": "links",
            "source_path": "links/2019/08/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/index.md"
            
            , "syndicated": [{"type":"pocket","url":"https://www.forbes.com/sites/zakdoffman/2019/08/25/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption"}]
            ,"link": "https://www.forbes.com/sites/zakdoffman/2019/08/25/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/ephemeral-social-media/",
            "url": "https://mirror.roytang.net/2019/08/ephemeral-social-media/",
            "path": "/2019/08/ephemeral-social-media/",
            "title": "Ephemeral social media",
            "content_html": "\u003cp\u003eI read this post: \u003ca href=\"https://victoria.dev/verbose/why-im-automatically-deleting-my-old-tweets-using-aws-lambda/\"\u003eWhy I\u0026rsquo;m automatically deleting my old tweets using AWS Lambda\u003c/a\u003e where the justification for regularly deleting your old social media content is that they are no longer representative of the current version of you and thus can be misleading. This has certainly been the case when famous people\u0026rsquo;s older tweets resurface (James Gunn comes to mind).\u003c/p\u003e\n\u003cp\u003eTo each his own and I kind of understand the intent, but this kind of thinking is a bit anathema to me. In fact, I tweeted this just a few days ago:\u003c/p\u003e\n\n\n    On \n    \u003ca href=\"/2019/08/1166149784350027776/\"\u003e\u003ctime datetime=\"2019-08-27 00:45:49\"\u003e27 Aug 2019 12:45am\u003c/time\u003e\u003c/a\u003e\n    I wrote:\n    \u003cblockquote\u003e\n        \u003cp\u003eAs a digital pack rat, it always annoys me when I remember how much of my own pre-cloud data I am no longer able to recover\u003c/p\u003e\n\n        \n\n\n\n\n\n\n    \u003c/blockquote\u003e\n\n\u003cp\u003eIn fact, I wrote the tweet above because I was annoyed that there was no more way to recover older things like chat logs from now-defunct messenger apps (Yahoo Messenger, ICQ, AIM) that I used back in the day. I\u0026rsquo;m sure most of the content there was inane and probably of no relevance to anyone other than me, but I wish I had found a way to archive them anyway. Unlike physical posessions which eat up space and can be problematic when sorting and arranging, digital archives are much cheaper to retain and easier to access.\u003c/p\u003e\n\u003cp\u003eI think for me, the fact that my older social media posts reflect a past and possibly different version of me are a feature, not a bug. It means I can use social media to dig through my own history and as a supplement to memory, a sort of \u003ca href=\"/2018/05/logs-and-memories-and-audit-trails/\"\u003eaudit trail\u003c/a\u003e of my thoughts. I guess it is a tendency of that \u0026ldquo;pack rat\u0026rdquo; side of me. It may be unnecessary sentiment, but I find that as I grow older, the more I appreciate the ability to have artifacts of the past to look through.\u003c/p\u003e\n",
            "summary": "I read this post: Why I\u0026rsquo;m automatically deleting my old tweets using AWS Lambda where the justification for regularly deleting your old social media content is that they are no longer representative of the current version of you and thus can be misleading. This has certainly been the case when famous people\u0026rsquo;s older tweets resurface (James Gunn comes to mind).\nTo each his own and I kind of understand the intent, but this kind of thinking is a bit anathema to me.",
            "date_published": "2019-08-29T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/ephemeral/index.md"
            , "tags": ["tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166866136694177792/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166618522270797825/",
            "url": "https://mirror.roytang.net/2019/08/1166618522270797825/",
            "path": "/2019/08/1166618522270797825/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/shanselman/\"\u003e@shanselman\u003c/a\u003e Thanks!\u003c/p\u003e\n",
            "summary": "@shanselman Thanks!",
            "date_published": "2019-08-28T07:48:25+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166618522270797825/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166618522270797825/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166613356591104000/",
            "url": "https://mirror.roytang.net/2019/08/1166613356591104000/",
            "path": "/2019/08/1166613356591104000/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/shanselman/\"\u003e@shanselman\u003c/a\u003e How to do this?\u003c/p\u003e\n",
            "summary": "@shanselman How to do this?",
            "date_published": "2019-08-28T07:27:53+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166613356591104000/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166613356591104000/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166570974810124289/",
            "url": "https://mirror.roytang.net/2019/08/1166570974810124289/",
            "path": "/2019/08/1166570974810124289/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/momblogger/\"\u003e@momblogger\u003c/a\u003e with recent newspapers conveniently and conspicuously in the pictures for good measure\u003c/p\u003e\n",
            "summary": "@momblogger with recent newspapers conveniently and conspicuously in the pictures for good measure",
            "date_published": "2019-08-28T04:39:28+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166570974810124289/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166570974810124289/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/python-markov-chains/",
            "url": "https://mirror.roytang.net/2019/08/python-markov-chains/",
            "path": "/2019/08/python-markov-chains/",
            "title": "Python: Markov Chains",
            "content_html": "\u003cp\u003eBack when I was still learning Python in 2008, one of the first \u0026ldquo;fun\u0026rdquo; scripts I wrote was a text generator using \u003ca href=\"https://en.wikipedia.org/wiki/Markov_chain\"\u003eMarkov chains\u003c/a\u003e. I\u0026rsquo;d run it against all the chat logs I had with people at work and serve the results from a webserver on my computer. THe results were often amusing and sometimes hilarious.\u003c/p\u003e\n\u003cp\u003eSince I\u0026rsquo;ve been going through my old scripts lately, I thought I\u0026rsquo;d update that script to Python 3 (read: add parentheses around print params and use \u003ca href=\"/2019/08/devnotes-python-pathlib/\"\u003epathlib\u003c/a\u003e) and run it against all the posts on this here site. I added the script to my deploy script for this site (thus further worsening my build times), so it should generate a new page every hour or so. I also added the generated markdown file to gitignore so it never gets saved to the repo. Every output of this script will be fleeting and ephemeral!\u003c/p\u003e\n\u003cp\u003eYou can view the output \u003ca href=\"/demos/markov\"\u003ehere\u003c/a\u003e. You can view the script source \u003ca href=\"https://github.com/roytang/blog/blob/master/utils/markov.py\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n",
            "summary": "Back when I was still learning Python in 2008, one of the first \u0026ldquo;fun\u0026rdquo; scripts I wrote was a text generator using Markov chains. I\u0026rsquo;d run it against all the chat logs I had with people at work and serve the results from a webserver on my computer. THe results were often amusing and sometimes hilarious.\nSince I\u0026rsquo;ve been going through my old scripts lately, I thought I\u0026rsquo;d update that script to Python 3 (read: add parentheses around print params and use pathlib) and run it against all the posts on this here site.",
            "date_published": "2019-08-28T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/markov-chain/index.md"
            , "tags": ["software development","python"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166502708343390210/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166331230557626368/",
            "url": "https://mirror.roytang.net/2019/08/1166331230557626368/",
            "path": "/2019/08/1166331230557626368/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/capnfabs/\"\u003e@capnfabs\u003c/a\u003e \u003ca href=\"https://twitter.com/newsycombinator/\"\u003e@newsycombinator\u003c/a\u003e Wow was i unknowingly following two different bots lol\u003c/p\u003e\n",
            "summary": "@capnfabs @newsycombinator Wow was i unknowingly following two different bots lol",
            "date_published": "2019-08-27T12:46:49+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166331230557626368/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166331230557626368/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166311187002220545/",
            "url": "https://mirror.roytang.net/2019/08/1166311187002220545/",
            "path": "/2019/08/1166311187002220545/",
            "title": "",
            "content_html": "\u003cp\u003ePeople dunked on this tweet, saying, in essence, \u0026ldquo;This isn\u0026rsquo;t 100% correct - you shouldn\u0026rsquo;t pay attention.\u0026rdquo; But that misses the point. The value of any model is that it\u0026rsquo;s simpler than reality so that you can gain insight. Here are the insights I have gained from this model. \u003ca href=\"https://twitter.com/RichRogers_/status/1159872097205805056\"\u003ehttps://twitter.com/RichRogers_/status/1159872097205805056\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "People dunked on this tweet, saying, in essence, \u0026ldquo;This isn\u0026rsquo;t 100% correct - you shouldn\u0026rsquo;t pay attention.\u0026rdquo; But that misses the point. The value of any model is that it\u0026rsquo;s simpler than reality so that you can gain insight. Here are the insights I have gained from this model. https://twitter.com/RichRogers_/status/1159872097205805056",
            "date_published": "2019-08-27T11:27:10+00:00",
            "date_modified": "2020-08-19T14:11:33+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166311187002220545/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166311187002220545/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166309740529344512/",
            "url": "https://mirror.roytang.net/2019/08/1166309740529344512/",
            "path": "/2019/08/1166309740529344512/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/newsycombinator/\"\u003e@newsycombinator\u003c/a\u003e Hi! Why did you stop posting a link to the news.yc comments for each link? I found it useful if i wanted to see discussion after reading the article. (Idk if you will reply to me coz youre probly a bot)\u003c/p\u003e\n",
            "summary": "@newsycombinator Hi! Why did you stop posting a link to the news.yc comments for each link? I found it useful if i wanted to see discussion after reading the article. (Idk if you will reply to me coz youre probly a bot)",
            "date_published": "2019-08-27T11:21:25+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166309740529344512/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166309740529344512/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166149784350027776/",
            "url": "https://mirror.roytang.net/2019/08/1166149784350027776/",
            "path": "/2019/08/1166149784350027776/",
            "title": "",
            "content_html": "\u003cp\u003eAs a digital pack rat, it always annoys me when I remember how much of my own pre-cloud data I am no longer able to recover\u003c/p\u003e\n",
            "summary": "As a digital pack rat, it always annoys me when I remember how much of my own pre-cloud data I am no longer able to recover",
            "date_published": "2019-08-27T00:45:49+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166149784350027776/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166149784350027776/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/devnotes-python-pathlib/",
            "url": "https://mirror.roytang.net/2019/08/devnotes-python-pathlib/",
            "path": "/2019/08/devnotes-python-pathlib/",
            "title": "Devnotes: Python Pathlib",
            "content_html": "\u003cp\u003eEver since I started learning Python back in 2008ish, I\u0026rsquo;ve been using it as my primary scripting language for various tasks such as processing log files, organizing my own file system, processing stuff on this blog, and so on. A lot of it is basically moving files around. In the days of Python 2, that involved a lot of imports of different libraries like \u003ccode\u003eos\u003c/code\u003e, \u003ccode\u003eshutil\u003c/code\u003e and \u003ccode\u003eglob\u003c/code\u003e. It can become a bit messy with so many imports, and I often can\u0026rsquo;t remember which import I need for a particular case and end up having to search for the documentation (or stackoverflow, let\u0026rsquo;s not kid ourselves here).\u003c/p\u003e\n\u003cp\u003eWith Python 3, a new cleaner option is available to replace all of the above libraries: \u003ca href=\"https://docs.python.org/3/library/pathlib.html\"\u003ePathlib\u003c/a\u003e, introduced in Python 3.4, provides an object-oriented way of doing file operations, replacing many of the most common uses I had for the libraries above. Some sample usage:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#f92672\"\u003efrom\u003c/span\u003e pathlib \u003cspan style=\"color:#f92672\"\u003eimport\u003c/span\u003e path\n\n\u003cspan style=\"color:#75715e\"\u003e# Declaring a path object is just passing the path string\u003c/span\u003e\np \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e Path(\u003cspan style=\"color:#e6db74\"\u003e\u0026#34;/home/roytang/stuff\u0026#34;\u003c/span\u003e)\n\n\u003cspan style=\"color:#75715e\"\u003e# Other paths can be derived using the / operator\u003c/span\u003e\nsubdir \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e p \u003cspan style=\"color:#f92672\"\u003e/\u003c/span\u003e \u003cspan style=\"color:#e6db74\"\u003e\u0026#34;favorites\u0026#34;\u003c/span\u003e\n\n\u003cspan style=\"color:#75715e\"\u003e# p.glob replaces stuff like os.walk and glob.glob\u003c/span\u003e\n\u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e mdfile \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e p\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003eglob(\u003cspan style=\"color:#e6db74\"\u003e\u0026#34;**/*.md\u0026#34;\u003c/span\u003e):\n    \u003cspan style=\"color:#66d9ef\"\u003eprint\u003c/span\u003e(str(mdfile))\n\n    \u003cspan style=\"color:#75715e\"\u003e# path objects have properties for individual path elements\u003c/span\u003e\n    filename \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e mdfile\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003ename\n    stem \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e mdfile\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003estem \u003cspan style=\"color:#75715e\"\u003e# filename without extension\u003c/span\u003e\n\n    \u003cspan style=\"color:#75715e\"\u003e# path.exists() replaces os.exists()\u003c/span\u003e\n    newdir \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e subdir \u003cspan style=\"color:#f92672\"\u003e/\u003c/span\u003e stem \n    \u003cspan style=\"color:#66d9ef\"\u003eif\u003c/span\u003e \u003cspan style=\"color:#f92672\"\u003enot\u003c/span\u003e newdir\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003eexists():\n        \u003cspan style=\"color:#75715e\"\u003e# path.mkdir replaces os.makedirs\u003c/span\u003e\n        newdir\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003emkdir(parents\u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003eTrue)\n\n    newfile \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e newdir \u003cspan style=\"color:#f92672\"\u003e/\u003c/span\u003e newfile \u003cspan style=\"color:#75715e\"\u003e# path objects can be either files or dirs\u003c/span\u003e\n    \u003cspan style=\"color:#75715e\"\u003e# for file copying, you still need shutil!\u003c/span\u003e\n    \u003cspan style=\"color:#f92672\"\u003eimport\u003c/span\u003e shutil\n    shutil\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003ecopy(str(mdfile), str(newfile))\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eFor me it\u0026rsquo;s much cleaner to use than the old methods and require less imports (most of the time). I eventually hope to migrate all my older scripts to use Pathlib (the same way I migrated them away from Python 2 a while back), and moving forward I plan to use it primarily for filesystem operations.\u003c/p\u003e\n",
            "summary": "Ever since I started learning Python back in 2008ish, I\u0026rsquo;ve been using it as my primary scripting language for various tasks such as processing log files, organizing my own file system, processing stuff on this blog, and so on. A lot of it is basically moving files around. In the days of Python 2, that involved a lot of imports of different libraries like os, shutil and glob. It can become a bit messy with so many imports, and I often can\u0026rsquo;t remember which import I need for a particular case and end up having to search for the documentation (or stackoverflow, let\u0026rsquo;s not kid ourselves here).",
            "date_published": "2019-08-27T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/devnotes-python-pathlib/index.md"
            , "tags": ["software development","devnotes","python"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166140339972952064/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166131672439349248/",
            "url": "https://mirror.roytang.net/2019/08/1166131672439349248/",
            "path": "/2019/08/1166131672439349248/",
            "title": "",
            "content_html": "\u003cp\u003eI’m feeling good today. So, you know what that means. It’s giveaway time. I will be doing a giveaway of a Nintendo Switch Lite.\u003c/p\u003e\n\u003cp\u003eFollow, Like and Retweet\u003c/p\u003e\n\u003cp\u003eWinner will be selected on September 21st.\u003c/p\u003e\n\u003cp\u003eGood luck to everyone. 🙃\u003c/p\u003e\n",
            "summary": "I’m feeling good today. So, you know what that means. It’s giveaway time. I will be doing a giveaway of a Nintendo Switch Lite.\nFollow, Like and Retweet\nWinner will be selected on September 21st.\nGood luck to everyone. 🙃",
            "date_published": "2019-08-26T23:33:51+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1166131672439349248/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166131672439349248/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1166005001304469506/",
            "url": "https://mirror.roytang.net/2019/08/1166005001304469506/",
            "path": "/2019/08/1166005001304469506/",
            "title": "",
            "content_html": "\u003cp\u003eWe\u0026rsquo;re finally free! #mtg #modern\u003c/p\u003e\n",
            "summary": "We\u0026rsquo;re finally free! #mtg #modern",
            "date_published": "2019-08-26T15:10:30+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "photos",
            "source_path": "photos/2019/08/1166005001304469506/index.md"
            , "tags": ["mtg","modern"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1166005001304469506/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/marketplace-ethics/",
            "url": "https://mirror.roytang.net/2019/08/marketplace-ethics/",
            "path": "/2019/08/marketplace-ethics/",
            "title": "Marketplace Ethics",
            "content_html": "\u003cp\u003eI brought up among one of my friend groups this Reddit thread where the poster says they were able to buy hundreds of dollars worth of \u003ca href=\"/tags/mtg/\"\u003eMagic\u003c/a\u003e cards from a garage sale for around $70. (Not gonna link to the original thread because it might seem like I\u0026rsquo;m shaming the OP.)\u003c/p\u003e\n\u003cp\u003eNot that there\u0026rsquo;s anything bad with such \u0026ldquo;garage sale finds\u0026rdquo;, as it were. These things are posted every so often on subreddits especially those dedicated to some sort of collectible. I mentioned that while I would be very excited to find something like this in the wild, I might have an attack of conscience because I\u0026rsquo;m potentially cheating someone out of fair market value and taking advantage of their ignorance. I\u0026rsquo;m probably more likely to feel this way if I was dealing with a seller personally (like at a garage sale), rather than some entity indirectly (like at a big store for example).\u003c/p\u003e\n\u003cp\u003eObviously, my ethical dilemma is only for the scenario where there is an information imbalance - where I as the buyer have information about the product\u0026rsquo;s fair market value that the seller is not aware of. If the seller knew full well the actual value of what he\u0026rsquo;s selling and he still sells at that price, then I will gladly buy it cheap with no concerns.\u003c/p\u003e\n\u003ch3 id=\"this-is-why-im-not-a-salesman\"\u003eThis is why I\u0026rsquo;m not a salesman\u003c/h3\u003e\n\u003cp\u003eIn such a case, the way to assuage my ethical concerns would be to bring up the possible imbalance. Something along the lines of \u0026ldquo;I think you\u0026rsquo;re selling this for much less than what it\u0026rsquo;s worth!\u0026rdquo;, and if he nods and still wants to sell at that price anyway, then both of you complete the transaction happily.\u003c/p\u003e\n\u003cp\u003eFriend O commented:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eI think people have a kind of \u0026ldquo;code of ethics\u0026rdquo; that applies to marketplaces\u003c/p\u003e\n\u003cp\u003ethat\u0026rsquo;s a bit different from everyday ethics\u003c/p\u003e\n\u003cp\u003ejust like how doctors/lawyers/priests have a code of ethics specific to their contexts\u003c/p\u003e\n\u003cp\u003ethe idea is that participants in the marketplace should assume that everyone else is doing their due dilligence when it comes to price/quality research\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eSo I guess I can satisfy my concerns as well by telling myself that \u0026ldquo;Caveat Emptor\u0026rdquo; applies in the opposite direction as well, so \u0026ldquo;Caveat Venditor\u0026rdquo;?\u003c/p\u003e\n\u003ch3 id=\"hold-yourself-to-a-higher-standard\"\u003eHold yourself to a higher standard\u003c/h3\u003e\n\u003cp\u003eI am only presenting an ethical dilemma here as it applies to myself when I am the buyer in the above scenario, or otherwise the one with information advantage in the situation.\u003c/p\u003e\n\u003cp\u003eI have been on the receiving end of bad trades before of course, numerous times. Such often happens when I foolishly decide to participate in a transaction without doing the necessary research, so I guess Caveat Venditor is accurate. I don\u0026rsquo;t lay blame on the other party for taking advantage of my ignorance either; after a bad trade I will most likely blame myself. Therefore, I don\u0026rsquo;t expect other people I am transacting with to treat me as fairly as I want to treat other people should I have the advantage.\u003c/p\u003e\n\u003cp\u003eFriend J pointed out that holding myself to a higher standard like this can be considered a bit elitist since it\u0026rsquo;s like considering yourself \u0026ldquo;better\u0026rdquo; than others. I think of it more like managing expectations of other people. Other people don\u0026rsquo;t have the same life experiences and values as I do, so some things are more important for me than for them. I would of course love it if everyone was conditioned to treat everyone else fairly in this manner - society would be much the better for it, but I understand the reality of human wants and needs enough to know that\u0026rsquo;s a pipe dream at best.\u003c/p\u003e\n\u003ch3 id=\"all-in-theory\"\u003eAll in theory\u003c/h3\u003e\n\u003cp\u003eAnyway, all of this is untested, because I haven\u0026rsquo;t been lucky enough to find a deal like I originally described. Maybe when I\u0026rsquo;m there at that point in time all my ethical questions give way to impulse or greed and I\u0026rsquo;m already at home gleefully counting my winnings before the dilemma comes to mind. But I like to think thought experiments like these help to flesh out one\u0026rsquo;s thought processes so that when the time comes, one is more likely to behave appropriately.\u003c/p\u003e\n",
            "summary": "I brought up among one of my friend groups this Reddit thread where the poster says they were able to buy hundreds of dollars worth of Magic cards from a garage sale for around $70. (Not gonna link to the original thread because it might seem like I\u0026rsquo;m shaming the OP.)\nNot that there\u0026rsquo;s anything bad with such \u0026ldquo;garage sale finds\u0026rdquo;, as it were. These things are posted every so often on subreddits especially those dedicated to some sort of collectible.",
            "date_published": "2019-08-26T00:00:00+00:00",
            "date_modified": "2021-03-13T20:33:27+08:00",
            "section": "post",
            "source_path": "post/2019/08/marketplace-ethics/index.md"
            , "tags": ["philosophy"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165777925502898176/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1165583254763839488/",
            "url": "https://mirror.roytang.net/2019/08/1165583254763839488/",
            "path": "/2019/08/1165583254763839488/",
            "title": "",
            "content_html": "\u003cp\u003eChinese Agencies \u0026lsquo;Crack Telegram\u0026rsquo;: A Timely Warning For End-To-End Encryption \u003ca href=\"https://www.forbes.com/sites/zakdoffman/2019/08/25/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/\"\u003ehttps://www.forbes.com/sites/zakdoffman/2019/08/25/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Chinese Agencies \u0026lsquo;Crack Telegram\u0026rsquo;: A Timely Warning For End-To-End Encryption https://www.forbes.com/sites/zakdoffman/2019/08/25/chinese-agencies-crack-telegram-a-timely-warning-for-end-to-end-encryption/",
            "date_published": "2019-08-25T11:14:38+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/08/1165583254763839488/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165583254763839488/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/nothing-fails-like-success/",
            "url": "https://mirror.roytang.net/2019/08/nothing-fails-like-success/",
            "path": "/2019/08/nothing-fails-like-success/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-08-25T04:50:11-05:00",
            "date_modified": "2020-02-10T07:11:30+08:00",
            "section": "links",
            "source_path": "links/2019/08/nothing-fails-like-success/index.md"
            
            , "syndicated": [{"type":"pocket","url":"https://alistapart.com/article/nothing-fails-like-success/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165565383056793600/"}]
            ,"link": "https://alistapart.com/article/nothing-fails-like-success/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/three-hearts/",
            "url": "https://mirror.roytang.net/2019/08/three-hearts/",
            "path": "/2019/08/three-hearts/",
            "title": "Three Hearts",
            "content_html": "\u003ch3 id=\"shogun\"\u003eShogun\u003c/h3\u003e\n\u003cp\u003eThere\u0026rsquo;s a quote I like from \u003ca href=\"/2018/11/shogun-and-the-rest-of-james-clavells-asian-saga/\"\u003eJames Clavell\u0026rsquo;s novel Shogun\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e“It\u0026rsquo;s a saying they have, that a man has a false heart in his mouth for the world to see, another in his breast to show to his special friends and his family, and the real one, the true one, the secret one, which is never known to anyone except to himself alone, hidden only God knows where.”\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThe novel implies this was a Japanese saying, which may not be accurate, Clavell \u003ca href=\"https://japanese.stackexchange.com/questions/18973/question-about-supposedly-a-japanese-proverb\"\u003eprobably based it on Jesuit writings from that era\u003c/a\u003e. That being said, I like this quote because I think it\u0026rsquo;s applicable to all people, not just the Japanese, especially in this modern age.\u003c/p\u003e\n\u003ch3 id=\"unlimited-hearts\"\u003eUnlimited Hearts\u003c/h3\u003e\n\u003cp\u003eOften we are not even limited to three \u0026ldquo;hearts\u0026rdquo;. Other people can see and bear witness to your life, but they only see a sliver, a fraction of what it is to be you, and only what you choose to let them see. How other people experience you varies for each group. You have your set of high school friends, who know of your early days of hijinks, your work friends who know how you react to stress and how you unwind, your relatives who know how you are during the holidays in the face of family turmoil, and so on. None of them know the real you, not completely.\u003c/p\u003e\n\u003ch3 id=\"true-heart\"\u003eTrue Heart\u003c/h3\u003e\n\u003cp\u003eIt can\u0026rsquo;t be helped that the \u0026ldquo;true\u0026rdquo; version of each person is known only to that person alone. No one else lives the same life exactly.\u003c/p\u003e\n\u003cp\u003eConsider myself. I write a lot about what\u0026rsquo;s going on in my life, whether through social media or through this blog. I strive to be open and honest and true in my dealings with other people, and I am almost always willing to offer up my thoughts without filter, if asked. But despite that, the picture I present to the world is still always incomplete. There are things I omit and things I hold back and things I don\u0026rsquo;t like to talk about. It\u0026rsquo;s something I have since learned to respect in other people as well, despite my inquisitive nature: to hold back when they obviously don\u0026rsquo;t want to talk about something.\u003c/p\u003e\n\u003cp\u003e(Don\u0026rsquo;t worry I haven\u0026rsquo;t secretly committed any heinous crimes.)\u003c/p\u003e\n\u003ch3 id=\"public-facing\"\u003ePublic-facing\u003c/h3\u003e\n\u003cp\u003eI was reminded of this quote only because I was reading some discussion about private content on the internet. In general, if I post something on the internet, I don\u0026rsquo;t expect it to be private, not completely. Otherwise, why post it on the internet at all? Anything on the internet has the chance to be exposed later, one way or another, and we should be careful accordingly. And \u0026ldquo;on the internet\u0026rdquo; here isn\u0026rsquo;t even limited to websites and blogs and social media. \u0026ldquo;Private\u0026rdquo; communications are a weak point too, as anyone can capture a screenshot anytime. If you want to keep secrets, then don\u0026rsquo;t put them on a network.\u003c/p\u003e\n\u003cp\u003eThree can keep a secret if two of them are dead.\u003c/p\u003e\n\u003ch3 id=\"black-mirror\"\u003eBlack Mirror\u003c/h3\u003e\n\u003cp\u003eThere\u0026rsquo;s a Black Mirror episode where the personality of a human who passed away is recreated based on his social media postings and what not. Because of the nature of humans, I don\u0026rsquo;t believe this process can ever be 100% accurate. What you will get is a shadow of the original human, an approximation of who he chose to present himself as. His true self will have been forever lost.\u003c/p\u003e\n",
            "summary": "Shogun There\u0026rsquo;s a quote I like from James Clavell\u0026rsquo;s novel Shogun:\n “It\u0026rsquo;s a saying they have, that a man has a false heart in his mouth for the world to see, another in his breast to show to his special friends and his family, and the real one, the true one, the secret one, which is never known to anyone except to himself alone, hidden only God knows where.”",
            "date_published": "2019-08-25T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/three-hearts/index.md"
            , "tags": ["quotes","tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165416348576636928/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/b1jazoqhxyi/",
            "url": "https://mirror.roytang.net/2019/08/b1jazoqhxyi/",
            "path": "/2019/08/b1jazoqhxyi/",
            "title": "",
            "content_html": "\u003cp\u003eGuido. I was originally gonna draw Hulk, but I realized I could continue the X-Factor theme instead. #xmen #sketch #strongguy\u003c/p\u003e\n",
            "summary": "Guido. I was originally gonna draw Hulk, but I realized I could continue the X-Factor theme instead. #xmen #sketch #strongguy",
            "date_published": "2019-08-24T16:24:15+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/08/B1jaZoqhXyi/index.md"
            , "tags": ["strongguy","sketch","xmen","ownyourgram"]
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B1jaZoqhXyi/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165299931772522497/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/seeking-the-productive-life-some-details-of-my-personal-infrastructure/",
            "url": "https://mirror.roytang.net/2019/08/seeking-the-productive-life-some-details-of-my-personal-infrastructure/",
            "path": "/2019/08/seeking-the-productive-life-some-details-of-my-personal-infrastructure/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-08-24T06:05:25-05:00",
            "date_modified": "2020-02-10T07:11:30+08:00",
            "section": "links",
            "source_path": "links/2019/08/seeking-the-productive-life-some-details-of-my-personal-infrastructure/index.md"
            
            , "syndicated": [{"type":"pocket","url":"https://writing.stephenwolfram.com/2019/02/seeking-the-productive-life-some-details-of-my-personal-infrastructure/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165220789450346497/"}]
            ,"link": "https://writings.stephenwolfram.com/2019/02/seeking-the-productive-life-some-details-of-my-personal-infrastructure/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1165182644650299394/",
            "url": "https://mirror.roytang.net/2019/08/1165182644650299394/",
            "path": "/2019/08/1165182644650299394/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/wrongwaygoback/\"\u003e@wrongwaygoback\u003c/a\u003e no you can\u0026rsquo;t\u003c/p\u003e\n",
            "summary": "@wrongwaygoback no you can\u0026rsquo;t",
            "date_published": "2019-08-24T08:42:45+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1165182644650299394/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165182644650299394/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/b1ijzohhnux/",
            "url": "https://mirror.roytang.net/2019/08/b1ijzohhnux/",
            "path": "/2019/08/b1ijzohhnux/",
            "title": "",
            "content_html": "\u003cp\u003eLeaves. This is also a #test #pleaseignore\u003c/p\u003e\n",
            "summary": "Leaves. This is also a #test #pleaseignore",
            "date_published": "2019-08-24T04:39:57+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/08/B1iJzOHhnuX/index.md"
            , "tags": ["test","pleaseignore"]
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B1iJzOHhnuX/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165134973524959232/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/devnotes-migrating-mercurial-to-git/",
            "url": "https://mirror.roytang.net/2019/08/devnotes-migrating-mercurial-to-git/",
            "path": "/2019/08/devnotes-migrating-mercurial-to-git/",
            "title": "Devnotes: Migrating Mercurial to Git",
            "content_html": "\u003cp\u003eBig news in online repositories this week is that \u003ca href=\"https://bitbucket.org/blog/sunsetting-mercurial-support-in-bitbucket\"\u003eBitbucket is sunsetting support for Mercurial\u003c/a\u003e! This might be the death knell for Mercurial, although Git was already the super popular choice before. Back when I started using online source control for my personal coding projects I started out with Bitbucket over Github because they offered unlimited private repos and Mercurial (which I had already tried out before at work, so at first I preferred it over git). Now that Gitlab and Github both offer unlimited private repos, there\u0026rsquo;s no reason to stick with Bitbucket either. I had already migrated most of my private Git repos to Gitlab before, but hadn\u0026rsquo;t realized until now that I also had a couple of Mercurial repos there that needed to be migrated as well. I hadn\u0026rsquo;t touched those repos in so long that I didn\u0026rsquo;t even have Mercurial installed locally anymore! (Although I\u0026rsquo;m still using the code locally!)\u003c/p\u003e\n\u003cp\u003eLuckily, converting a mercurial repo to git turned out to be straightforward thanks to a project called \u003ca href=\"https://repo.or.cz/fast-export.git\"\u003efast-export\u003c/a\u003e. Modified instructions from a convenient \u003ca href=\"https://stackoverflow.com/questions/10710250/converting-mercurial-folder-to-a-git-repository#\"\u003estackoverflow post\u003c/a\u003e:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-bash\" data-lang=\"bash\"\u003ebrew install hg \u003cspan style=\"color:#75715e\"\u003e# install hg on my mac first\u003c/span\u003e\ncd ~\nhg clone https://user@bitbucket.org/user/reponame\ngit clone git://repo.or.cz/fast-export.git\ngit init git_repo\ncd git_repo\n~/fast-export/hg-fast-export.sh -r ~/reponame\ngit checkout HEAD\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eThe process was fairly quick, and the commit history from the Mercurial side was even retained, I would have been happy just retaining HEAD! After that, I just create a new private repo on Gitlab, set that as the remote, then push to Gitlab as usual.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s a good thing I remembered to check my Bitbucket account, as apparently they will be deleting the old Mercurial repos when time is up!\u003c/p\u003e\n",
            "summary": "Big news in online repositories this week is that Bitbucket is sunsetting support for Mercurial! This might be the death knell for Mercurial, although Git was already the super popular choice before. Back when I started using online source control for my personal coding projects I started out with Bitbucket over Github because they offered unlimited private repos and Mercurial (which I had already tried out before at work, so at first I preferred it over git).",
            "date_published": "2019-08-24T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/migrate-mercurial-to-git/index.md"
            , "tags": ["software development","tech life","devnotes"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1165053929215975424/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164694432085495809/",
            "url": "https://mirror.roytang.net/2019/08/1164694432085495809/",
            "path": "/2019/08/1164694432085495809/",
            "title": "",
            "content_html": "\u003cp\u003eThis cant possibly be a healthy sleep rhythm\u003c/p\u003e\n",
            "summary": "This cant possibly be a healthy sleep rhythm",
            "date_published": "2019-08-23T00:22:46+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "photos",
            "source_path": "photos/2019/08/1164694432085495809/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164694432085495809/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/edith-finch/",
            "url": "https://mirror.roytang.net/2019/08/edith-finch/",
            "path": "/2019/08/edith-finch/",
            "title": "Games: What Remains of Edith Finch",
            "content_html": "\u003cp\u003eI might be lending out my PS4 next month when the latest annual release of a sports franchise rolls around, so I figured I\u0026rsquo;d finish off a PS4 game before the console vanishes on me for a few months. \u003cem\u003eWhat Remains of Edith Finch\u003c/em\u003e came out on PS+ a couple of months ago and people are always raving about how good it is and how it\u0026rsquo;s relatively short, so I decided to give it a go. I went in blind, not knowing anything, since mysteriously no one on Reddit could explain what makes the game good. This is understandably so as any sort of information kind of spoils the story for you. As such, consider yourself warned that this review might be considered spoiler-y. Overall if you like story-based games, just go ahead and play this one, then come back here to read the review if you\u0026rsquo;d like.\u003c/p\u003e\n\u003ch3 id=\"1-narratives\"\u003e1 Narratives\u003c/h3\u003e\n\u003cp\u003e\u003cem\u003eWhat Remains of Edith Finch\u003c/em\u003e is a first-person exploration game. The gameplay is largely focused around the story and advancing the narrative. The story revolves around the Finch family and their so-called \u0026ldquo;curse\u0026rdquo; which causes many of the family members to die of unusual causes. You spend the game exploring the now-abandoned Finch family house where five generations of Finches have lived since coming to America. As you explore the house you come across shrines for each deceased Finch family member, and each one takes you into a different scenario narrating their individual stories. Each family member\u0026rsquo;s story is told in a different manner: there\u0026rsquo;s one told as if it were a comic book, one told from the point of view of a baby in a bathtub, several are seen through the lens of a child\u0026rsquo;s imagination, and so on. The presentation of the substories and the main story exploring the house is very clever, with the actual text of the narratives often appearing throughout the environment, guiding you where to go next.\u003c/p\u003e\n\u003ch3 id=\"2-gameplay\"\u003e2 Gameplay\u003c/h3\u003e\n\u003cp\u003eGameplay is primarily based on exploration and experimentation. In the main story you explore the house and unlock secret passages and crawl through tunnels and climb to the roof and so on. There are no failure states in the gameplay, you simply keep pushing forward. If you get stuck, you walk around until you figure out a way to advance.\u003c/p\u003e\n\u003cp\u003eThe individual substories are the same way, although many of them adjust the control schemes and expect you to experiment accordingly. As an example, in one of the substories you get to fly around as an owl, then later crawl around a cruise ship as some kind of tentacle monster. In another, you\u0026rsquo;re a baby in a bathtub imagining your toys coming to life. In yet another, you\u0026rsquo;re an assembly-line worker in a cannery dreaming of a fantasy world, and you must explore your fantasy world and slice off fishheads at the cannery at the same time.\u003c/p\u003e\n\u003cp\u003eThe substories take place in their own little sandboxes, so to speak, and many of them seem like tech demos of cool things a developer would want to try like \u0026ldquo;Ooh, let\u0026rsquo;s make the player a shark on land and he has to fall into the ocean!\u0026rdquo; or \u0026ldquo;Let\u0026rsquo;s make a scenario where the player is just flying a kite!\u0026rdquo; It\u0026rsquo;s not a proble, and it does create some interesting ways of presenting the narratives.\u003c/p\u003e\n\u003cp\u003eAll of this happens from the first person view, which was a bit problematic at times. Since I\u0026rsquo;m getting along with age, I\u0026rsquo;m not as good with first person gaming as I used to be, and playing with this view for an extended period of time can give me some dizziness. Luckily, the game was quite short, and I managed to finish it in two sittings. (Maybe 1.5 hours total)\u003c/p\u003e\n\u003ch3 id=\"3-achievements\"\u003e3 Achievements?\u003c/h3\u003e\n\u003cp\u003eI usually try to go for achievement completion before posting a review, especially for story-based games like this. But this time I didn\u0026rsquo;t bother. Most of the achievements are silly things that you can do during the exploration gameplay, like knocking all of the balls off a pool table. Most can be acquired after completing the game the first time, since that unlocks the ability to replay individual substories. But there was one achievement that required looking through every peephole/telescope in the game, and that seemed like I couldn\u0026rsquo;t do it without replaying everything from the beginning. That didn\u0026rsquo;t appeal to me because (a) I might get dizzy again; and (b) this is the sort of game where it\u0026rsquo;s best experienced the first time around, and successive playthroughs won\u0026rsquo;t be of much value.\u003c/p\u003e\n\u003ch3 id=\"4-overall\"\u003e4 Overall\u003c/h3\u003e\n\u003cp\u003e\u0026hellip;I liked it, though not as much as say, Life is Strange. The exploration of the house is great and the all of the scenes and sandboxes are well set up and very detailed, although the overarching Finch family story is a thinly-veiled framing device to bring together the individual substories. The game is well worth the 1-2 hours to go through it.\u003c/p\u003e\n",
            "summary": "I might be lending out my PS4 next month when the latest annual release of a sports franchise rolls around, so I figured I\u0026rsquo;d finish off a PS4 game before the console vanishes on me for a few months. What Remains of Edith Finch came out on PS+ a couple of months ago and people are always raving about how good it is and how it\u0026rsquo;s relatively short, so I decided to give it a go.",
            "date_published": "2019-08-23T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/edith-finch/index.md"
            , "tags": ["gaming"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164691569775190016/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164523842238214144/",
            "url": "https://mirror.roytang.net/2019/08/1164523842238214144/",
            "path": "/2019/08/1164523842238214144/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e it\u0026rsquo;s the color of the bear that\u0026rsquo;s too much. If my pet was a black bear would I be out of luck? lol\u003c/p\u003e\n",
            "summary": "@Westraid it\u0026rsquo;s the color of the bear that\u0026rsquo;s too much. If my pet was a black bear would I be out of luck? lol",
            "date_published": "2019-08-22T13:04:54+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164523842238214144/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164523842238214144/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164507187751706624/",
            "url": "https://mirror.roytang.net/2019/08/1164507187751706624/",
            "path": "/2019/08/1164507187751706624/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e This seems oddly specific\u003c/p\u003e\n",
            "summary": "@Westraid This seems oddly specific",
            "date_published": "2019-08-22T11:58:43+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164507187751706624/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164507187751706624/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164506207354159104/",
            "url": "https://mirror.roytang.net/2019/08/1164506207354159104/",
            "path": "/2019/08/1164506207354159104/",
            "title": "",
            "content_html": "\u003cp\u003eLawrence Ferlinghetti, 100 years old today. Thank you.\u003c/p\u003e\n",
            "summary": "Lawrence Ferlinghetti, 100 years old today. Thank you.",
            "date_published": "2019-08-22T11:54:49+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164506207354159104/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164506207354159104/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164491442846224384/",
            "url": "https://mirror.roytang.net/2019/08/1164491442846224384/",
            "path": "/2019/08/1164491442846224384/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/gangbadoy/\"\u003e@gangbadoy\u003c/a\u003e panget ang response sa trial balloon nila e\u003c/p\u003e\n",
            "summary": "@gangbadoy panget ang response sa trial balloon nila e",
            "date_published": "2019-08-22T10:56:09+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164491442846224384/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164491442846224384/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164486925694070784/",
            "url": "https://mirror.roytang.net/2019/08/1164486925694070784/",
            "path": "/2019/08/1164486925694070784/",
            "title": "",
            "content_html": "\u003cp\u003eLast night I was in a loo and a woman entered the only other stall crying. I did the awkward shout over and asked if she was ok or wanted to talk about it, or needed a hug\u003c/p\u003e\n",
            "summary": "Last night I was in a loo and a woman entered the only other stall crying. I did the awkward shout over and asked if she was ok or wanted to talk about it, or needed a hug",
            "date_published": "2019-08-22T10:38:12+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164486925694070784/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164486925694070784/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/the-great-memory-scare-of-2019/",
            "url": "https://mirror.roytang.net/2019/08/the-great-memory-scare-of-2019/",
            "path": "/2019/08/the-great-memory-scare-of-2019/",
            "title": "The Great Memory Scare of 2019",
            "content_html": "\u003cp\u003eMy current desktop PC has been with me since late 2015, so going on 4 years now. I bought relatively high-end parts for it at the time, hoping to be a bit future-proof so that it would last me longer than previous desktops. So I was a bit worried when I started encountering issues during the recent weeks.\u003c/p\u003e\n\u003cp\u003eHere\u0026rsquo;s the timeline:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMay 2019, before my overseas trip. It happened a few times that the computer would completely shut down while I was playing \u003ca href=\"/2019/04/starcraft-2/\"\u003eStarcraft 2\u003c/a\u003e coop. The displays would go black, but they still had power, and for a little while the OS would keep going. I know this because I could still hear the game sounds for a bit. Eventually the PC would be inaccessible, even via network. Only choice would be to hard reset. It didn\u0026rsquo;t happen regularly enough for me to figure it out before we left for the 5 week trip.\u003c/li\u003e\n\u003cli\u003eJuly 2019. After getting back from the trip, I encountered the Starcraft 2 issue again. Some reading indicated early concerns that SC2 may be killing video cards, but that was from 4 years ago! Besides, after my quick hard reboot, the GPU temp would be quite normal so I didn\u0026rsquo;t think that was the issue. The problem began to happen regularly, until I could not play SC2 at all. Eventually, a friend suggested I tried lowering SC2 graphics settings and surprisingly that worked! Things looked terrible, but I didn\u0026rsquo;t mind, and I could play again.\u003c/li\u003e\n\u003cli\u003eEVO weekend, Aug 3-4 2019. I started playing Dragonball Fighter Z because it had a free weekend promo. I enjoyed the game and eventually bought it before the free weekend finished. The loading times were a bit long on my system, but tolerable.\u003c/li\u003e\n\u003cli\u003eAfter EVO weekend, I tried installing Microsoft Windows update 1903, as my current version was nearing end of life. Update went smoothly.\u003c/li\u003e\n\u003cli\u003eAfter the update, I noticed the performance of DBFZ had drastically worsened. Incredibly long loading times, occasionaly framerate drops during battles.\u003c/li\u003e\n\u003cli\u003eOn Aug 5, first BSOD encountered:\u003c/li\u003e\n\u003c/ul\u003e\n\u003ca href=\"#85c44ca416915055df00fa0efaff0f78-lightbox\"\u003e\n    \u003cfigure\u003e\n      \u003cimg src=\"/2019/08/the-great-memory-scare-of-2019/bluescreen_hu952dd7ed026f0f96b5127da3081ac276_1135197_300x0_resize_box_2.png\" alt=\"\" title=\"\" class=\"tn\" /\u003e\n      \u003cfigcaption\u003e (Click to view full-size)\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003c/a\u003e\n\u003cdiv class=\"lightbox\" id=\"85c44ca416915055df00fa0efaff0f78-lightbox\" style=\"display: none;\"\u003e\n  \u003ca href=\"#_\"\u003e\n    \u003cimg src=\"/2019/08/the-great-memory-scare-of-2019/bluescreen.png\" /\u003e\n  \u003c/a\u003e\n  \u003cdiv class=\"lightbox_overlay\"\u003e\n    \u003cp\u003e\u003c/p\u003e\n    \u003ctime class=\"dt-published\" datetime=\"22 Aug 2019 12:00am\"\u003e22 Aug 2019 12:00am\u003c/time\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003cul\u003e\n\u003cli\u003ebecause of the recent Windows update, I assumed first that was the cause of the problems. So I rolled it back first and observed the behavior.\u003c/li\u003e\n\u003cli\u003eover the next two weeks, additional instances of BSODs were observed, along with occasional crashes where the PC just straight freezes in place (often with annoying beeping sound) and a hard reset is needed. The crashes would happen even during normal usage (browsing etc) and sometimes even while the PC was unattended!\u003c/li\u003e\n\u003cli\u003elast week I got fed up and started doing serious diagnostics:\n\u003cul\u003e\n\u003cli\u003eI re-installed the Windows 10 1903 update\u003c/li\u003e\n\u003cli\u003eI updated my graphics drivers\u003c/li\u003e\n\u003cli\u003eI uninstalled a bunch of unnecessary old stuff\u003c/li\u003e\n\u003cli\u003eI ran \u003ccode\u003echkdsk\u003c/code\u003e and \u003ccode\u003esfc\u003c/code\u003e. System File Checker found some issues and repaired them! Maybe that fixed things? Nope.\u003c/li\u003e\n\u003cli\u003eI tried running the Windows Memory Diagnostic tool. Standard check froze up the first time, but was successful on the second try.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eAt this point I was still hoping it was a software issue (since hardware issues generally require cash to fix), but all signs pointed to either video card (due to SC2) or memory (due to memory diagnostic failure) problems. Time to test each component in turn!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ca href=\"#0467e22f95d101d351c8514706ce2ace-lightbox\"\u003e\n    \u003cfigure\u003e\n      \u003cimg src=\"/2019/08/the-great-memory-scare-of-2019/20190819_080244_hub4ddedb5154cb122abe7c37065511f9d_1316978_300x0_resize_q75_box.jpg\" alt=\"\" title=\"\" class=\"tn\" /\u003e\n      \u003cfigcaption\u003e (Click to view full-size)\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003c/a\u003e\n\u003cdiv class=\"lightbox\" id=\"0467e22f95d101d351c8514706ce2ace-lightbox\" style=\"display: none;\"\u003e\n  \u003ca href=\"#_\"\u003e\n    \u003cimg src=\"/2019/08/the-great-memory-scare-of-2019/20190819_080244.jpg\" /\u003e\n  \u003c/a\u003e\n  \u003cdiv class=\"lightbox_overlay\"\u003e\n    \u003cp\u003e\u003c/p\u003e\n    \u003ctime class=\"dt-published\" datetime=\"22 Aug 2019 12:00am\"\u003e22 Aug 2019 12:00am\u003c/time\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003cul\u003e\n\u003cli\u003eI\u0026rsquo;m no stranger to digging through computer parts, but this is literally my least favorite part of being PC master race: having to figure out which of your hardware components is failing. At least my PC case is a lot more organized and spacious this time; my older PCs had super tight layouts that were hard to manipulate\n\u003cul\u003e\n\u003cli\u003eI started with the easy one: I moved my monitors to the onboard graphics card and enabled it in the BIOS. If the issue is the video card, then I shouldn\u0026rsquo;t encounter it while using the onboard graphics. Nope, had a crash less than an hour in.\u003c/li\u003e\n\u003cli\u003eNext we try the memory. I had two 8gb DDR3 ram sticks installed. I removed one of the sticks (pretty sure I could live on 8gb RAM tbh) and then rebooted and ran the memory diagnostics. Pass! I used the PC for one whole day with this config, even playing some SC2 and DBFZ and no issues were encountered. Things were looking up, it was likely there was a faulty memory stick!\u003c/li\u003e\n\u003cli\u003ethe next day I decided to confirm it by swapping the memory sticks. Oops, now PC wouldn\u0026rsquo;t boot. Displays don\u0026rsquo;t get any signal, USB devices (mouse and keyboard unpowered). Is it because of the faulty memory stick? I swap back the \u0026ldquo;good\u0026rdquo; RAM, but still the same issue. I try a few other combinations, different RAM slots, but no such luck.\u003c/li\u003e\n\u003cli\u003eThis was last Monday (Quezon City holiday!). I concede defeat and acknowledge that this is beyond my power. I call up a nearby EasyPC branch and ask if they can take a look at it for me. I take a quick Grab there and the guy starts taking a look. He starts by pulling out the mem sticks and the vid card and cleaning out the connectors with an eraser. He pops out the CMOS battery to reset the board. He plugs them back in but the PC doesn\u0026rsquo;t boot. He tells me the motherboard is dead. He tries some thing with a jumper, and the MB comes back to life!\u003c/li\u003e\n\u003cli\u003eI have my full 16GB back. He tells me the memory problems were probably due to the dirty connectors and suggests I take the desktop back home to do an extended memory diagnostic. I agree, since I don\u0026rsquo;t want to leave it at the shop. I happily pay the repair fee plus a small tip and take another Grab back home. I was expecting that I would have to shell out for new memory sticks as the best case! The whole process took less than an hour. This is one of those examples where I was wasting too many man-hours trying to do something myself!\u003c/li\u003e\n\u003cli\u003eBack home, I run the standard Memory Diagnostic first and it passes! Hooray. I use the PC for a while, no issues. Before going to sleep, I start the extended Memory Diagnostic and left it running overnight. In the morning, it was still going around 10 hours after it started, at less than 80% of the first pass! I reduce the passes from 2 to 1, because to be honest I wasn\u0026rsquo;t going to wait another 10-12 hours for a second pass! Luckily, the test finished a couple of hours later without issues.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eHooray! All is well! Generally, at least. It\u0026rsquo;s been 48 hours and no crashes or BSODs or such have been encountered. Gaming seems fine. There seems to be a minor problem of Windows Explorer randomly spiking in CPU usage every so often, but that\u0026rsquo;s probably some software issue I\u0026rsquo;ll have to figure out independently. In any case, the Great Memory Scare of 2019 was over, and I get to keep using this desktop, hopefully for a lot longer!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI was a bit amused at how sad I felt when I first realized there might be a hardware problem with the PC, especially since I was hoping it would last me for years down the line. I may be a bit too attached to it lol. Well, my desktop generally does give me joy, so I\u0026rsquo;m not Kondo-ing it anytime soon!\u003c/p\u003e\n",
            "summary": "My current desktop PC has been with me since late 2015, so going on 4 years now. I bought relatively high-end parts for it at the time, hoping to be a bit future-proof so that it would last me longer than previous desktops. So I was a bit worried when I started encountering issues during the recent weeks.\nHere\u0026rsquo;s the timeline:\n May 2019, before my overseas trip. It happened a few times that the computer would completely shut down while I was playing Starcraft 2 coop.",
            "date_published": "2019-08-22T00:00:00+00:00",
            "date_modified": "2020-10-20T15:25:02+08:00",
            "section": "post",
            "source_path": "post/2019/08/great-memory-scare/index.md"
            , "tags": ["tech life","gaming"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164328992012460033/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/b1buw8mhgqb/",
            "url": "https://mirror.roytang.net/2019/08/b1buw8mhgqb/",
            "path": "/2019/08/b1buw8mhgqb/",
            "title": "",
            "content_html": "\u003cp\u003ePolaris. Back to digital again, and trying out colors. A bit happier with my proportions this time. Now 3 out of 6 of the Peter David era X-Factor #sketch #xmen #polaris\u003c/p\u003e\n",
            "summary": "Polaris. Back to digital again, and trying out colors. A bit happier with my proportions this time. Now 3 out of 6 of the Peter David era X-Factor #sketch #xmen #polaris",
            "date_published": "2019-08-21T16:48:16+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/08/B1buw8MhgQB/index.md"
            , "tags": ["sketch","xmen","polaris"]
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B1buw8MhgQB/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164233838765195265/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/1164185878261981189/",
            "url": "https://mirror.roytang.net/2019/08/1164185878261981189/",
            "path": "/2019/08/1164185878261981189/",
            "title": "",
            "content_html": "\u003cp\u003eTHIS IS FINE\u003c/p\u003e\n\u003ccite class=\"u-quotation-of h-cite\"\u003e\n    Quoted \u003ca  href='https://twitter.com/CNN/status/1164174061787856896'\u003eCNN\u0026#39;s tweet\u003c/a\u003e:\n\u003c/cite\u003e\n\u003cblockquote\u003e\n    More than one and a half soccer fields of Amazon rainforest are being destroyed every minute of every day, according to Brazil\u0026rsquo;s National Institute for Space Research \u003ca href=\"http://cnn.it/2zeYTV6\"\u003ehttp://cnn.it/2zeYTV6\u003c/a\u003e\n\u003c/blockquote\u003e\n",
            "summary": "THIS IS FINE\nQuoted CNN\u0026#39;s tweet:   More than one and a half soccer fields of Amazon rainforest are being destroyed every minute of every day, according to Brazil\u0026rsquo;s National Institute for Space Research http://cnn.it/2zeYTV6  ",
            "date_published": "2019-08-21T14:41:57+00:00",
            "date_modified": "2020-08-18T15:22:38+08:00",
            "section": "notes",
            "source_path": "notes/2019/08/1164185878261981189/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164185878261981189/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/b1ba1tvbzo1/",
            "url": "https://mirror.roytang.net/2019/08/b1ba1tvbzo1/",
            "path": "/2019/08/b1ba1tvbzo1/",
            "title": "",
            "content_html": "\u003cp\u003ePizza rickroll. This is a test.\u003c/p\u003e\n",
            "summary": "Pizza rickroll. This is a test.",
            "date_published": "2019-08-21T10:06:58+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/08/B1bA1tvBzO1/index.md"
            
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B1bA1tvBzO1/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1164125616674922502/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/08/internet-commercialization/",
            "url": "https://mirror.roytang.net/2019/08/internet-commercialization/",
            "path": "/2019/08/internet-commercialization/",
            "title": "Internet Commercialization",
            "content_html": "\u003ch3 id=\"0\"\u003e0\u003c/h3\u003e\n\u003cp\u003eA while back, I read this post from 2015: \u003ca href=\"http://veekaybee.github.io/2015/07/28/who-is-doing-this-to-my-internet/\"\u003eWho is doing this to my internet?\u003c/a\u003e lamenting the changing nature of the internet due to commercialization and advertising.\u003c/p\u003e\n\u003ch3 id=\"1\"\u003e1\u003c/h3\u003e\n\u003cp\u003eIt\u0026rsquo;s a bit funny that the OP was lamenting about the \u0026ldquo;good old days\u0026rdquo; of the internet back in \u003cstrong\u003e2012\u003c/strong\u003e, when by then the big social media networks like Facebook and Twitter were already relatively well-entrenched. When I think of the \u0026ldquo;good old days\u0026rdquo; of the internet I tend to harken back pre-social media to the heyday of blogging around 2005-2008 maybe? Those were times when instead of everybody holed up in social media silos, there were still a lot of people running independent websites and blogs.\u003c/p\u003e\n\u003cp\u003eCommercialization and advertising pretty much ruined blogging too, well before the silos started consolidating people\u0026rsquo;s personal writings into their title-less posts and shares and retweets. When people caught on that you could run advertising on your blogs and earn money from increasing traffic, there began a trend of content writers who would write for money. Even now you can see job listings on sites like Upwork for people needed to write content for blogs, with the aim of earning money off advertising.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;ll be honest and tell you I thought about this myself, and added the Google Adsense to the blog back in the day. But that would never really have worked out for me, as to make money off blogging you have to find a niche and to focus on that topic and be writing about that constantly and be doing SEO and marketing to drive the traffic to you site. Being focused to one topic and marketing are kind of very off-brand for me. I like being able to write about whatever I want and whatever comes to mind. I did try spinning off some dedicated blogs at some point, for topics like for \u003ca href=\"http://royondjango.blogspot.com/\"\u003eDjango programming\u003c/a\u003e, \u003ca href=\"/2007/09/roy-on-magic/\"\u003eMagic the Gathering\u003c/a\u003e, and I even made a \u003ca href=\"https://ireadcomicbooks.tumblr.com/\"\u003ecomic-book focused tumblr\u003c/a\u003e. The efforts never last too long. Like I said, focus doesn\u0026rsquo;t become me.\u003c/p\u003e\n\u003cp\u003eSocial media killed blogging (or tried to anyway), but advertising ruined blogging in the same way it ruined social media. People thought they could earn money, so they changed what they posted to try to earn more views/followers/clicks. It became less about being genuine (if it ever was) and more about pandering to a wider audience and driving traffic. There was a rise in clickbait and polarizing headlines and replicating content from other sites. Things like truth or originality didn\u0026rsquo;t matter, clicks and views did.\u003c/p\u003e\n\u003ch3 id=\"2\"\u003e2\u003c/h3\u003e\n\u003cp\u003eI\u0026rsquo;m not begrudging anyone their right to try to earn a living. I just wish the business model didn\u0026rsquo;t have to be so annoying lol. The advertising business model existed before the internet of course, and was good enough to drive \u0026ldquo;free\u0026rdquo; industries like radio and television. So when people wanted to start making money off the internet, it was easy to adopt the same model. People online were used to other people providing content for free after all.\u003c/p\u003e\n\u003cp\u003eWhat other business models could exist on the internet?\u003c/p\u003e\n\u003cp\u003eThere\u0026rsquo;s hiding content behind a paywall, which is the approach of newspapers like the New York Times or the Washington Post or sites like Medium. That kind of thing gets annoying too and commercialization can ruin the site as well. I recently read \u003ca href=\"https://blog.elementary.io/welcome-to-the-new-blog/\"\u003ethis writeup\u003c/a\u003e about how a company moved their blog away from Medium because it gradually became a worse proposition as they started to monetize.\u003c/p\u003e\n\u003cp\u003eLooking at free-to-play gaming, there\u0026rsquo;s one other model that I think could work: microtransactions. I mean something like cosmetics and content packs and making money off \u0026ldquo;whales\u0026rdquo;, the same way games like Hearthstone and Magic Arena does it. Magic Arena\u0026rsquo;s model doesn\u0026rsquo;t annoy me at all. I don\u0026rsquo;t play regularly enough to want to buy things and am content just being free-to-play. But that doesn\u0026rsquo;t stop other people from making purchases for cosmetics and so on.\u003c/p\u003e\n\u003cp\u003eAlthough I realize I might not enjoy that world either. Imagine if Twitter or Instagram had cosmetic purchases where you could buy like stuff to decorate your profile page or custom frames for your posts or something like that. I think it would be a huge hit among some people, at the same time be really annoying for other people (people like me lol).\u003c/p\u003e\n\u003ch3 id=\"3\"\u003e3\u003c/h3\u003e\n\u003cp\u003eI guess what I\u0026rsquo;m saying is: I wish we could live in an (online) world where people weren\u0026rsquo;t constantly trying to make money off each other. I realize that this comes from a position of privilege - of having enough so that I don\u0026rsquo;t need to be thinking about earning money all the time. I realize that\u0026rsquo;s not the world works and that commercialization is a sad reality that I have to live with, but a man can dream.\u003c/p\u003e\n",
            "summary": "0 A while back, I read this post from 2015: Who is doing this to my internet? lamenting the changing nature of the internet due to commercialization and advertising.\n1 It\u0026rsquo;s a bit funny that the OP was lamenting about the \u0026ldquo;good old days\u0026rdquo; of the internet back in 2012, when by then the big social media networks like Facebook and Twitter were already relatively well-entrenched. When I think of the \u0026ldquo;good old days\u0026rdquo; of the internet I tend to harken back pre-social media to the heyday of blogging around 2005-2008 maybe?",
            "date_published": "2019-08-21T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/08/internet-commercialization/index.md"
            , "tags": ["tech life","blogging"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1163966623872692229/"}]
            
            
            }
        
    ]
     , "prev": "/p/34/feed.json" 
     , "next": "/p/36/feed.json" 
}