{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2019/07/10157619219683912/",
            "url": "https://mirror.roytang.net/2019/07/10157619219683912/",
            "path": "/2019/07/10157619219683912/",
            "title": "",
            "content_html": "\u003cp\u003eSurvey: What is your favorite place on earth?\u003c/p\u003e\n",
            "summary": "Survey: What is your favorite place on earth?",
            "date_published": "2019-07-22T22:46:00+00:00",
            "date_modified": "2019-09-28T20:48:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/10157619219683912/index.md"
            
            , "syndicated": [{"type":"facebook","url":"https://www.facebook.com/stephen.roy.tang/posts/10157619219683912"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1153301292787232771/",
            "url": "https://mirror.roytang.net/2019/07/1153301292787232771/",
            "path": "/2019/07/1153301292787232771/",
            "title": "",
            "content_html": "\u003cp\u003eMust love dogs\u003c/p\u003e\n",
            "summary": "Must love dogs",
            "date_published": "2019-07-22T13:50:30+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "photos",
            "source_path": "photos/2019/07/1153301292787232771/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1153301292787232771/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/b0ondovbdll/",
            "url": "https://mirror.roytang.net/2019/07/b0ondovbdll/",
            "path": "/2019/07/b0ondovbdll/",
            "title": "",
            "content_html": "\u003cp\u003eI came upon a small Japanese art exhibit in shangrila last week\u003c/p\u003e\n",
            "summary": "I came upon a small Japanese art exhibit in shangrila last week",
            "date_published": "2019-07-22T07:12:12+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/07/B0ONDoVBdlL/index.md"
            
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/B0ONDoVBdlL/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/a-look-back-at-the-marvel-cinematic-universe/",
            "url": "https://mirror.roytang.net/2019/07/a-look-back-at-the-marvel-cinematic-universe/",
            "path": "/2019/07/a-look-back-at-the-marvel-cinematic-universe/",
            "title": "A Look Back at the Marvel Cinematic Universe",
            "content_html": "\u003cp\u003eI know I already made a \u003ca href=\"https://roytang.net/2019/04/more-thoughts-on-avengers-endgame-and-the-mcu/\"\u003ewhole post about the MCU after Endgame came out\u003c/a\u003e, but after the MCU Phase 4 announcements this past weekend at SDCC I was a bit hyped. I thought it would be fun to look back at the past 10 years of MCU Phase 1-3 and see what I wrote about the movies.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIron Man (2008)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSurprisingly, I had written nothing about watching this film at all, and I don\u0026rsquo;t remember going to the cinema to watch it. The movie came out between Batman Begins and The Dark Knight, so my hype was undeniably towards the Batman movies back then. Before the MCU, Iron Man was a B-list hero at best, and back then no one could ever have imagined how far the MCU would go.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Incredible Hulk (2008)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"/2008/06/movies-june-2008/\"\u003e\u0026ldquo;Movies \u0026ndash; June 2008\u0026rdquo;\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eEdward Norton is cast brilliantly here, a choice on the same level as Robert Downey Jr as Iron Man. And they addressed the issue of Hulk’s stretchy pants!\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eIron Man 2 (2010)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIt took them 2 years to get to a 2nd movie. They probably weren\u0026rsquo;t prepared for how well received Iron Man was!\u003c/p\u003e\n\u003cp\u003eAll I have for this movie is \u003ca href=\"https://twitter.com/roytang/status/13253318934\"\u003efrom a tweet\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eIron Man 2 was okay, but it was pretty much more of the same. Therefore it does not wow as much as the first movie did.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eThor (2011)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCouldn\u0026rsquo;t find any notes about this movie either. Well, except that I thought it \u003ca href=\"https://twitter.com/roytang/status/82967835080527872\"\u003ewas better than Green Lantern\u003c/a\u003e (an understatement). I do remember being impressed visually by the Asgard set-pieces.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCaptain America the First Avenger (2011)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://twitter.com/roytang/status/96637161473966080\"\u003etwitter\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eCaptain America was fine. Definitely better than Thor/Green Lantern\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI guess I started ranking them around this time, although maintaing an overall ranking was pretty much impossible.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAvengers (2012)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://twitter.com/roytang/status/195064455208501248\"\u003etwitter\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eAvengers was very enjoyable, funny and action-packed. Re-reading Ultimates v1 now lol\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI wish I had more to say, but I wasn\u0026rsquo;t in the habit yet of more detailed reviews back then. On to phase two!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIron Man 3 (2013)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://twitter.com/roytang/status/328877325867446273\"\u003etwitter\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e#IronMan3 It was ok. Not as great as some people have said, but probably better than 2. \u003ca href=\"https://twitter.com/alvinjtang\"\u003e@alvinjtang\u003c/a\u003e says it\u0026rsquo;ll look worse in a few years.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eThor The Dark World (2013)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://twitter.com/roytang/status/396176381819621376\"\u003etwitter\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThor2 was okay, I like it more than Iron Man 3, mostly because I like the Star Wars x High Fantasy style\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThor2 is generally considered one of the lowest-ranked movies of the MCU, but as a comic book fan I\u0026rsquo;m very forgiving and I guess this means I generally liked all of them!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCaptain America Winter Solider (2014)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://twitter.com/roytang/status/449064262581768192\"\u003etwitter\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eCap America 2 snap judgment: fun movie, better than Iron Man 3/Thor 2. Great for comic fans!\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eAgain, an understatement, as I would later go on to consider Winter Soldier possibly my favorite MCU movie of all time.\u003c/p\u003e\n\u003cp\u003eI also said in \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10152883332768912\"\u003ea Facebook post\u003c/a\u003e that the movie would have been perfect if he had only done Final Justice lol.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eGuardians of the Galaxy (2014)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom a \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10153122948543912\"\u003eFacebook post\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eGuardians was a very funny and fun movie, but it\u0026rsquo;s hard to say best Marvel movie so far, since I really liked Winter Soldier. And as a comic fan, I\u0026rsquo;m not that fond of how the Nova Corps was portrayed; I guess it\u0026rsquo;s understandable since they\u0026rsquo;re not the heroes here. There\u0026rsquo;s a lot of stuff for comic fans to enjoy though\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e2014 was a great year for the MCU, as both of these movies are among my MCU favorites.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAge of Ultron (2015)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom a \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10153724990238912\"\u003eFacebook post\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eSpoiler-free Age of Ultron review: It\u0026rsquo;s great, go watch it. I loved it. I wish there had been less content made available ahead of time through trailers and casting announcements, but such are the times we live in. It is a good time to be a comic book fan. There is a short mid-credits scene. There is no post-credits scene\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eIt was around this time that I started doing \u0026ldquo;spoiler-free reviews\u0026rdquo;. I also posted \u003ca href=\"http://nedstarkdies.com/avengers-age-of-ultron-by-hunter/\"\u003ea more detailed AoU review over on Nedstarkdies\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAnt Man (2015)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom a \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10153946370273912\"\u003eFacebook post\u003c/a\u003e again:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eAnt Man spoiler-free review: The first half felt a bit off, with some exposition coming off as forced and the pacing a bit awkward. Things picked up later on and while the plot was not entirely unpredictable there were a number of fun and surprising tangents. Overall a fun and entertaining movie with enough stuff for comic book Marvel fans to enjoy, probably close in quality to the first Iron Man movie, if not better\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI realized just now that both Ant Man movies have been used as a palate cleanser after an Avengers film. This first one also marked the end of phase two. On to phase three!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCaptain America Civil War (2016)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10154562419893912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cp\u003eCaptain America Civil War spoiler-free review:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003egreat fight sequences, start to finish\u003c/li\u003e\n\u003cli\u003ethe newcomers were great, airport big fight sequence had a great surprise (and not the one you already saw in the trailer - although you might have already been spoiled if you pay attention to certain toy lines), although I feel like a couple of the characters were pulled in to the conflict in a way that was a bit weak, but it\u0026rsquo;s still pretty good overall\u003c/li\u003e\n\u003cli\u003ethe plot was ok. Justification for the civil war was ok. Some surprises. The villain motivation was slightly mediocre, but that wasn\u0026rsquo;t really the focus of the movie anyway\u003c/li\u003e\n\u003cli\u003eMartin Freeman\u0026rsquo;s role felt totally superfluous - it did not seem necessary to cast Martin Freeman\u003c/li\u003e\n\u003cli\u003ethe movie kind of ends with the MCU and the Avengers in a weird place, some people might not like it\u003c/li\u003e\n\u003cli\u003ebetter than: Winter Soldier. The plot kind of develops in the same way but everything is on a much bigger scale now\u003c/li\u003e\n\u003cli\u003ethere are two post-credit scenes, one in the middle and one at the very end\u003c/li\u003e\n\u003cli\u003eImax worth it? Probably. Not very ostentatious use of 3d, but most of the fight sequences have it. You might get dizzy if you\u0026rsquo;re not used to it\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama? Maybe, but I\u0026rsquo;d have to keep explaining who these characters are\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI started doing this format of \u0026ldquo;Spoiler-free reviews\u0026rdquo; around this time, with what would turn out to be the well-loved \u0026ldquo;Magugustuhan ba ni Mama?\u0026rdquo; (Translation: Will Mama like it?) section. When I tried removing this section at some point, people complained lol.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDoctor Strange (2016)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10155041890913912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eWow. Great visuals and fight-scenes, very trippy. Possibly the best fight scenes in all the MCU movies so far. You might get dizzy with all the things spinning around though\u003c/li\u003e\n\u003cli\u003ePlot is typical of a MCU origin story. Hero\u0026rsquo;s journey, some light comedy bits, etc.\u003c/li\u003e\n\u003cli\u003eI was expecting them to go a different way with Mordo (if you\u0026rsquo;ve read the comics you know what I mean), but I\u0026rsquo;m happy with how things went down\u003c/li\u003e\n\u003cli\u003eStakes are high, but failure is not final\u003c/li\u003e\n\u003cli\u003eThe actors were great; I haven\u0026rsquo;t seen a lead this good for a role since RDJ\u0026rsquo;s Tony Stark. Swinton\u0026rsquo;s Ancient One, Eijofor\u0026rsquo;s Mordo, and even Wong\u0026rsquo;s Wong were great\u003c/li\u003e\n\u003cli\u003eDoctor friends: Tell me if the medical parts were BS hohoho\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama: Probably not. She doesn\u0026rsquo;t like this kind of thing, and the dizziness thing is bad too\u003c/li\u003e\n\u003cli\u003eIMAX or not? I think the 3d parts weren\u0026rsquo;t too exaggerated or critical, but the visuals might feel a bit flat and not as impressive if you don\u0026rsquo;t go IMAX\u003c/li\u003e\n\u003cli\u003eMidcredits scene? Yes\u003c/li\u003e\n\u003cli\u003ePostcredits scene? Yes\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eGuardians of the Galaxy vol 2 (2017)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10155588909688912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eoverall a very entertaining movie to sit down and watch popcorn and to enjoy the jokes and the space battles and the different colored lights and the tiny adorable tree creature\u003c/li\u003e\n\u003cli\u003eGOTG\u0026rsquo;s humor was one of its strong points and for the 2nd movie, they push the comedy up a notch, perhaps a little too much in some places. Lots of funny gags and one-liners\u003c/li\u003e\n\u003cli\u003eI felt like some of the character/background development stuff was pushed a bit too hard as well\u003c/li\u003e\n\u003cli\u003ethe movie\u0026rsquo;s plot also felt a bit thin and straightforward. I mean, you could see some of the major plot points coming a mile away. Maybe from the trailers even\u003c/li\u003e\n\u003cli\u003eStar Lord was ok. Gamora/Nebula felt poorly written. Rocket was a bit annoying. Drax and Mantis were ok, although the space they have for Mantis\u0026rsquo; character overlaps with Drax a bit.. I\u0026rsquo;m still not super happy with how Drax and Gamora are characterized in the MCU.\u003c/li\u003e\n\u003cli\u003eI\u0026rsquo;m less happy with this movie\u0026rsquo;s soundtrack compared to the first one\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama: Certainly not. In fact, she chose to derp around the mall instead of coming with me and my cousin to watch.\u003c/li\u003e\n\u003cli\u003eIMAX or not: Some visuals used the 3d effect, but nothing too exaggerated or critical. I\u0026rsquo;d say IMAX optional, but it definitely adds something to some scenes.\u003c/li\u003e\n\u003cli\u003eThere are five extra scenes near the credits (one of them is right before the credits roll, so I can\u0026rsquo;t really say \u0026ldquo;post-credit\u0026rdquo; screens). Most of them are just setting the tone for the inevitable GOTG3\u003c/li\u003e\n\u003cli\u003eAdditionally, just pay attention to the background of the credits roll as well, it\u0026rsquo;s great\u003c/li\u003e\n\u003cli\u003eWhile I felt the movie was ok, it\u0026rsquo;s kind of just more of the same of what we got with the first movie, which felt a lot stronger overall\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eSpider-man Homecoming (2017)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10155834066513912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eThis movie is amazing. Possibly best in all MCU so far. It\u0026rsquo;s fun, it\u0026rsquo;s exciting, unexpected things happened. Maybe not watching the trailers helped lol\u003c/li\u003e\n\u003cli\u003eCovers a lot of ground the previous Spider-man movies didn\u0026rsquo;t. Helped along by not needing to rehash the origin story for the Nth time\u003c/li\u003e\n\u003cli\u003eLots of great call outs for the comic book fans\u003c/li\u003e\n\u003cli\u003eI was worried about the Vulture, but it was handled very well. Keaton is great here.\u003c/li\u003e\n\u003cli\u003eThis movie is tightly coupled to the MCU yo. IDK how they\u0026rsquo;re going to handle it if Sony breaks it off after the two-movie deal. By they I mean Sony. Obviously MCU can just ignore him forever afterwards.\u003c/li\u003e\n\u003cli\u003eTBH I was also really worried about the MCU coupling and having too much Iron Man in the movie, but it turned out okay. Maybe could have had a little bit less Tony Stark.\u003c/li\u003e\n\u003cli\u003eIMAX? Probably not worth it.\u003c/li\u003e\n\u003cli\u003ethere\u0026rsquo;s a mid-credits scene and a post-credits scene.\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama? Possibly! There\u0026rsquo;s some shaky cam footage near the start that can be a bit nauseating though\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThat first line is high praise lol. Around this time I started avoiding watching more than the first trailer for the MCU movies, as I always felt like they gave too many jokes and plot points away. I will certainly watch them anyway, so there wasn\u0026rsquo;t much point building up more hype than I needed to.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThor Ragnarok (2017)\u003c/strong\u003e:\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10156133009878912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003ea fun, action-packed romp that shakes up the Thor status quo significantly\u003c/li\u003e\n\u003cli\u003eeasily the best of the three Thor movies\u003c/li\u003e\n\u003cli\u003ea number plot points are fairly predictable, yet still fun\u003c/li\u003e\n\u003cli\u003ethe Marvel formula is generally action mixed with witty banter here and there, and it\u0026rsquo;s what we get here, although some of the jokes feel like they\u0026rsquo;re stretched a bit too much\u003c/li\u003e\n\u003cli\u003esome great-looking cinematic scenes here and there. One particular flashback scene looked really great\u003c/li\u003e\n\u003cli\u003eI kind of like how the older franchises need to be some sort of team effort nowadays. Like Civil War, this felt a bit like some kind of mini-Avengers crossover \u0026ndash; in space!\u003c/li\u003e\n\u003cli\u003espeaking of space, one of the positive things about this installment is that they didn\u0026rsquo;t feel the need to tie Thor\u0026rsquo;s adventures to Earth anymore (not that the movie is 100% Earth-free), and they get to go a bit wild with space and aliens and all that\u003c/li\u003e\n\u003cli\u003eI understand the need to highlight Hulk\u0026rsquo;s involvement as part of the film\u0026rsquo;s marketing, but man, it would have been so awesome to just find out right then and there\u003c/li\u003e\n\u003cli\u003eThis movie had that Star Wars: Last Jedi trailer I was trying to avoid D:\u003c/li\u003e\n\u003cli\u003e1 mid-credits scene and 1 post-credits scene\u003c/li\u003e\n\u003cli\u003eI think Imax was good for this movie. The 3d wasn\u0026rsquo;t too much and it definitely made some scenes pop. The film is a visual delight so I think the larger screen is important too\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama: Probably not. Maybe I should stop including this section kasi parang same na parati ang answer. Unless for some reason I decide to watch some Tagalog romcom\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eDamn Thor 3 was great. Looking forward to Love and Thunder!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBlack Panther (2018)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10156423012653912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eit\u0026rsquo;s a fun, action-filled romp and Wakanda is amazing\u003c/li\u003e\n\u003cli\u003etchalla was ok, killmonger and nakia were great, shuri was badass\u003c/li\u003e\n\u003cli\u003esome of the actions scenes didnt seem too well-shot/edited, making them hard to follow\u003c/li\u003e\n\u003cli\u003eI realize I\u0026rsquo;m saying this about a universe where there are talking raccoons and magic hammers, but some of the Wakandan tech push the boundaries of my suspension of disbelief\u003c/li\u003e\n\u003cli\u003emy expectations were probably set a bit too high what with some people saying it\u0026rsquo;s the best MCU movie since Iron Man or calling it revolutionary or eye-opening\u003c/li\u003e\n\u003cli\u003eoff the top of my head I\u0026rsquo;d say I consider Civil War, Spider-Man Homecoming and Thor Ragnarok better than this one\u003c/li\u003e\n\u003cli\u003eI understand that it\u0026rsquo;s revolutionary in the sense that it\u0026rsquo;s a major hollowood motion picture filled with a cast of mostly african descent and that some of the characters are motivated by real world racial issues. But the plot itself was typical for an MCU first movie (maybe I\u0026rsquo;ve seen too many MCU movies? lol). I dont think it presents the issues it covers under any new or revolutionary context. I guess I kind of went in hoping to be impressed on the level of The Dark Knight or such, but I was disappointed in that regard. It\u0026rsquo;s a very straightforward movie\u003c/li\u003e\n\u003cli\u003eI didn\u0026rsquo;t watch in Imax, which I kind of regret, as I can imagine some of the scenes being pretty good\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama: Possibly, pero baka mahirapan sya intindihin accent ni Chadwick Boseman\u003c/li\u003e\n\u003cli\u003eThere\u0026rsquo;s a mid-credits scene and a post-credits scene\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eAvengers Infinity War (2018)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10156599221698912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eI\u0026rsquo;m amazed that so little of this movie has been widely spoiled\u003c/li\u003e\n\u003cli\u003emovie was fantastic. the movie somehow managed to do everything it needed to do while not doing disservice to any of the bazillion characters involved.\u003c/li\u003e\n\u003cli\u003ethe plot moves quickly. there is no good time to pee.\u003c/li\u003e\n\u003cli\u003ethere is one post-credits scene.\u003c/li\u003e\n\u003cli\u003every happy to have watched in imax\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eAnt Man and the Wasp (2018)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFrom \u003ca href=\"https://www.facebook.com/10155666240078912/posts/10156749941023912\"\u003eFacebook\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003ethis movie is great; it\u0026rsquo;s fun and and action-packed and there\u0026rsquo;s even more Luis than you thought you wanted; go watch it\u003c/li\u003e\n\u003cli\u003eit\u0026rsquo;s like the first movie, except better and more fun\u003c/li\u003e\n\u003cli\u003ebest new character: FBI Agent Jimmy Woo played by Randall Park (sorry Michelle Pfeifer)\u003c/li\u003e\n\u003cli\u003ethere are two mid/post-credit scenes. One of them is better than the other\u003c/li\u003e\n\u003cli\u003eI watched in Imax. Some scenes were nice, but it\u0026rsquo;s probably more of a nice-to-have\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni Mama: Pwede, but kelangan ng kasama to explain things. Baka ok lang pag tagalized na sa tv\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eCaptain Marvel (2019)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAround this time, I started \u003ca href=\"https://tumblr.roytang.net/post/183266384975/captain-marvel-spoiler-free-review\"\u003eposting the reviews to Tumblr\u003c/a\u003e as well:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003emovie was pretty good, no major issues\u003c/li\u003e\n\u003cli\u003edoesnt follow the typical MCU origin story ‘formula’\u003c/li\u003e\n\u003cli\u003esome weird pacing issues in a few places, but that just might be because of the chosen story direction\u003c/li\u003e\n\u003cli\u003elots of little call-outs and tie-ins to the other MCU movies (although I feel like they could have done a bit more in some spots)\u003c/li\u003e\n\u003cli\u003eI am not a cat person. But if you are a cat person, you might like this: there is a cat.\u003c/li\u003e\n\u003cli\u003eThere’s some parts that made it obvious they were aiming for that Wonder Woman audience, so the movie may be better for you if you’re in that demo (but I think WW was a better movie overall)\u003c/li\u003e\n\u003cli\u003eImax was pretty good, nothing too excessive\u003c/li\u003e\n\u003cli\u003eMidcredits scene, and postcredits scene\u003c/li\u003e\n\u003cli\u003eMagugustuhan ba ni mama? Possibly! Also, its a good idea to bring little girls to watch this movie\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e\u003cstrong\u003eAvengers Endgame (2019)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou can read my review \u003ca href=\"/2019/04/more-thoughts-on-avengers-endgame-and-the-mcu/\"\u003eright here on this blog\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSpider-man Far From Home (2019)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou can read my review \u003ca href=\"/2019/07/spider-man-far-from-home/\"\u003eright here on this blog\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003eThat was a fun walk through a decade of films, and it gave me an opportunity to fold some of my off-blog content back into this blog. I\u0026rsquo;m hoping to be doing more movie reviews directly here on this blog instead of just on Facebook or Tumblr. Looking forward to more MCU in the years (decades?) to come!\u003c/p\u003e\n",
            "summary": "I know I already made a whole post about the MCU after Endgame came out, but after the MCU Phase 4 announcements this past weekend at SDCC I was a bit hyped. I thought it would be fun to look back at the past 10 years of MCU Phase 1-3 and see what I wrote about the movies.\nIron Man (2008)\nSurprisingly, I had written nothing about watching this film at all, and I don\u0026rsquo;t remember going to the cinema to watch it.",
            "date_published": "2019-07-22T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/mcu-phase-1-to-3/index.md"
            , "tags": ["movies","comics"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1153476681954418688/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1153175429433266176/",
            "url": "https://mirror.roytang.net/2019/07/1153175429433266176/",
            "path": "/2019/07/1153175429433266176/",
            "title": "",
            "content_html": "\u003cp\u003eI\u0026rsquo;ve seen film critics say the MCU is like \u0026ldquo;series television, but at the movies.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s simpler than that.\u003c/p\u003e\n\u003cp\u003eMultiple franchises in a shared universe. Interweaving subplots and soap opera. That\u0026rsquo;s COMICS.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s comics, but at the movies.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAnd that\u0026rsquo;s not a bug, it\u0026rsquo;s a feature.\u003c/p\u003e\n",
            "summary": "I\u0026rsquo;ve seen film critics say the MCU is like \u0026ldquo;series television, but at the movies.\u0026rdquo;\nIt\u0026rsquo;s simpler than that.\nMultiple franchises in a shared universe. Interweaving subplots and soap opera. That\u0026rsquo;s COMICS.\n\u0026ldquo;It\u0026rsquo;s comics, but at the movies.\u0026rdquo;\nAnd that\u0026rsquo;s not a bug, it\u0026rsquo;s a feature.",
            "date_published": "2019-07-22T05:30:21+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1153175429433266176/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1153175429433266176/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/euew7go/",
            "url": "https://mirror.roytang.net/2019/07/euew7go/",
            "path": "/2019/07/euew7go/",
            "title": "",
            "content_html": "\u003cp\u003ewas this shot taken from the flyover\u003c/p\u003e\n",
            "summary": "was this shot taken from the flyover",
            "date_published": "2019-07-22T00:34:20+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/euew7go/index.md"
            , "tags": ["Philippines"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/Philippines/comments/cfyx97/edsa_shrine/euew7go/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1152766638963322880/",
            "url": "https://mirror.roytang.net/2019/07/1152766638963322880/",
            "path": "/2019/07/1152766638963322880/",
            "title": "",
            "content_html": "\u003cp\u003eThere’s just one more thing\u0026hellip; #SDCC\u003c/p\u003e\n",
            "summary": "There’s just one more thing\u0026hellip; #SDCC",
            "date_published": "2019-07-21T02:25:58+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1152766638963322880/index.md"
            , "tags": ["SDCC"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1152766638963322880/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1152752074339180544/",
            "url": "https://mirror.roytang.net/2019/07/1152752074339180544/",
            "path": "/2019/07/1152752074339180544/",
            "title": "",
            "content_html": "\u003cp\u003eWow. \nQuoted \u003ca href=\"https://twitter.com/TheMarvelReport/status/1152751551489835008\"\u003eTheMarvelReport\u0026rsquo;s tweet\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eTaika says he took inspiration from \u003ca href=\"https://twitter.com/jasonaaron/\"\u003e@jasonaaron\u003c/a\u003e’s The Mighty Thor. AND WE’RE GETTING NATALIE PORTMAN AS THOR #MarvelPhase4 #MarvelSDCC #MarvelStudios\u003c/p\u003e\n\u003c/blockquote\u003e\n",
            "summary": "Wow. Quoted TheMarvelReport\u0026rsquo;s tweet:\n Taika says he took inspiration from @jasonaaron’s The Mighty Thor. AND WE’RE GETTING NATALIE PORTMAN AS THOR #MarvelPhase4 #MarvelSDCC #MarvelStudios\n ",
            "date_published": "2019-07-21T01:28:06+00:00",
            "date_modified": "2019-09-12T12:24:47+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1152752074339180544/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1152752074339180544/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/ulnnhp8erbu/",
            "url": "https://mirror.roytang.net/2019/07/ulnnhp8erbu/",
            "path": "/2019/07/ulnnhp8erbu/",
            "title": "",
            "content_html": "\u003cp\u003eTaboo 2012 03 08\n(Audio only) Recording of me, Liz, Chry and Josiah playing Taboo in a taxi\u003c/p\u003e\n\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/ulNnhp8erbU\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\n",
            "summary": "Taboo 2012 03 08 (Audio only) Recording of me, Liz, Chry and Josiah playing Taboo in a taxi\n  ",
            "date_published": "2019-07-20T13:38:58+00:00",
            "date_modified": "2019-09-22T01:13:30+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/ulNnhp8erbU/index.md"
            
            , "syndicated": [{"type":"youtube","url":"https://www.youtube.com/watch?v=ulNnhp8erbU"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/ddy3clfzkui/",
            "url": "https://mirror.roytang.net/2019/07/ddy3clfzkui/",
            "path": "/2019/07/ddy3clfzkui/",
            "title": "",
            "content_html": "\u003cp\u003eTaboo 2012 03 07\n(Audio only) Recording of me, Liz, Chry and Josiah playing Taboo in a taxi\u003c/p\u003e\n\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/DdY3cLfzkuI\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\n",
            "summary": "Taboo 2012 03 07 (Audio only) Recording of me, Liz, Chry and Josiah playing Taboo in a taxi\n  ",
            "date_published": "2019-07-20T13:31:03+00:00",
            "date_modified": "2019-09-22T01:13:30+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/DdY3cLfzkuI/index.md"
            
            , "syndicated": [{"type":"youtube","url":"https://www.youtube.com/watch?v=DdY3cLfzkuI"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/euak2hq/",
            "url": "https://mirror.roytang.net/2019/07/euak2hq/",
            "path": "/2019/07/euak2hq/",
            "title": "",
            "content_html": "\u003cp\u003eFinal Fantasy Tactics\u003c/p\u003e\n",
            "summary": "Final Fantasy Tactics",
            "date_published": "2019-07-20T11:32:38+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/euak2hq/index.md"
            , "tags": ["AskReddit"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/AskReddit/comments/cfiqjq/gamers_of_reddit_whats_your_favourite_game_of_all/euak2hq/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/upgrading-a-react-native-project/",
            "url": "https://mirror.roytang.net/2019/07/upgrading-a-react-native-project/",
            "path": "/2019/07/upgrading-a-react-native-project/",
            "title": "Upgrading a React Native Project",
            "content_html": "\u003cp\u003eI have a small mobile app that I wrote using React Native (henceforth RN) back in 2017, currently deployed on the Google Play Store and Apple App Store. Shortly before my US trip, I got an email from Google telling me about a required action:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eBy August 1, 2019, all apps that use native code must provide a 64-bit version in addition to the 32-bit version in order to publish an update. This past January, we reiterated that this is required in order to make way for innovation and in anticipation of future Android devices that only support 64-bit code.\u003c/p\u003e\n\u003cp\u003eAs the deadline approaches, we wanted to remind you that at least one of your apps* uses native code but does not currently offer a 64-bit variant\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis illustrates for me one of the big problems with mobile development: that app was perfectly fine when I last deployed it in 2018 and now even though I haven\u0026rsquo;t changed anything, there\u0026rsquo;s additional work that needs to be done. I guess I\u0026rsquo;m too used to web development where we just deploy the app on a server and the server architecture doesn\u0026rsquo;t suddenly change for no reason. With mobile apps, the platforms and APIs and frameworks change quickly, leading to situations where even if your app doesn\u0026rsquo;t have any pending changes, you need to do some work on it anyway. (Granted, this can also happen with webservers due to security patches and such, but with managed hosting, that\u0026rsquo;s not something you worry about as often, and the resolution is often straightforward!)\u003c/p\u003e\n\u003cp\u003eAs I was about to be out of the country on vacation for more than a month, I put this off and only started looking at it when I got back. Luckily, I did actually also have some minor revisions to do on the app, so I would do all the work in one go.\u003c/p\u003e\n\u003cp\u003eAs it turns out, the version of RN I was using was too old and did not support providing the 64-bit version. I had to upgrade to a later version of RN, and after reviewing the process, it seemed like a nontrivial amount of work. There was an upgrade tool, but because I was so many versions behind, it couldn\u0026rsquo;t work directly. The problem seems to be in the initial boilerplate created by \u003ccode\u003ereact-native init\u003c/code\u003e for the ios and android subprojects; the older boilerplate was out of date and needed to be updated, which was not straightforward given that you may have modified that boilerplate afterwards. I had to use some kind of diff tool to manually find the differences in the boilerplate and merge the changes manually.\u003c/p\u003e\n\u003cp\u003eThat seemed like a lot of work, and the app wasn\u0026rsquo;t that large and didn\u0026rsquo;t have that much code, so I figured it was more straightforward to just create a new RN project from scratch, which would be using the latest version of RN (0.60.3, from 0.50.4). Afterwards, I port over the project code into the new project, them swap the new project back into the old project\u0026rsquo;s repo. That way I only had to update the few dependencies I was using in the project itself.\u003c/p\u003e\n\u003cp\u003eIt was still a nontrivial amount of work, but I eventually got everything working through many iterations of trial-and-error.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI went ahead and upgraded the dependencies to the latest versions as well, to make sure there was no conflict with the new RN version\u003c/li\u003e\n\u003cli\u003eReactNavigation had some backward incompatible changes:\n\u003cul\u003e\n\u003cli\u003eneeded to \u003ca href=\"https://reactnavigation.org/docs/en/getting-started.html#installation\"\u003einitialize the gesture handler\u003c/a\u003e in the java class\u003c/li\u003e\n\u003cli\u003enew function \u003ccode\u003ecreateStackNavigator\u003c/code\u003e instead of just \u003ccode\u003eStackNavigator\u003c/code\u003e constructor\u003c/li\u003e\n\u003cli\u003eneeded to use \u003ccode\u003ecreateAppContainer\u003c/code\u003e to initialize the navigator\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003esome components such as WebView and AsyncStorage were no longer part of RN core and had to be imported accordingly\u003c/li\u003e\n\u003cli\u003eAndroid now requires that I explicitly prompt for the \u003ccode\u003eREAD_EXTERNAL_STORAGE\u003c/code\u003e permission when trying to access the camera roll\u003c/li\u003e\n\u003cli\u003eGoogle now recommends that I provide an upload key for encryption, but since I reset the project, I also accidentally deleted the signing key I was using before. Oops! Momentary panic until I have the sense to do a search and realize that past me was wise enough to backup the file elsewhere.\u003c/li\u003e\n\u003cli\u003eTest that I can create the app bundle successfully.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBy this point I more or less had a working Android build, then shifted over to iOS. Since I only \u003ca href=\"/2018/12/macbook-air-2017-model/\"\u003erecently got a Macbook Air\u003c/a\u003e, I actually hadn\u0026rsquo;t tried creating and publishing the iOS build, someone was helping me with that part before. Because of reasons, I wanted/had to do it myself this time around, so a bit of a learning curve and trial-and-error again.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eclone the project from repo, \u003ccode\u003enpm install\u003c/code\u003e, try \u003ccode\u003ereact-native run-ios\u003c/code\u003e, oops missing dependencies\u003c/li\u003e\n\u003cli\u003efind out about CocoaPods. Clone a fresh copy of the project, \u003ccode\u003enpm install\u003c/code\u003e then \u003ccode\u003epod install\u003c/code\u003e (took a while), then try \u003ccode\u003ereact-native run-ios\u003c/code\u003e again\u003c/li\u003e\n\u003cli\u003eneeded to fix some dependencies I was using by manual linking and updating\u003c/li\u003e\n\u003cli\u003ecamera roll also needed to be added to the podfile (a config I possibly lost when I reset the project)\u003c/li\u003e\n\u003cli\u003efix a bunch of configs before I can actually run and test the app in the simulator\u003c/li\u003e\n\u003cli\u003eSuccess!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt this point, I make my other app changes and test on both my Android phone and the iOS simulator. The changes are easy, so now to try publishing.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTry to publish and upload to iTunesConnect. Takes me a few tries to figure out that I need to be updating stuff like bundle identifier, version number, etc.\u003c/li\u003e\n\u003cli\u003eiTunesConnect has some new requirements too (like the iPad version needs to support all orientations) which causes a couple more iterations\u003c/li\u003e\n\u003cli\u003emore screenshots are now required when submitting the app!\u003c/li\u003e\n\u003cli\u003eI set up TestFlight and verify everything is ok with the published app. (I only tested using the simulator before)\u003c/li\u003e\n\u003cli\u003eiOS app now submitted and \u0026ldquo;Waiting for Review\u0026rdquo;. I anticipate they will have some ridiculous request and it might take me a couple more submission rounds before I can publish\u003c/li\u003e\n\u003cli\u003eGoogle Play is more straightforward. \u003ccode\u003egradlew releaseBundle\u003c/code\u003e is already working after my previous effort, so I just upload the bundle and distribute.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI see no indication that I have satisfied Google\u0026rsquo;s action item, but it let me publish the update without complaints, so I\u0026rsquo;m done!\u003c/p\u003e\n\u003cp\u003eMy initial estimate that the work was nontrivial ends up correct, I spent way more manhours than I expected on the upgrade. Part of it was learning how to do the iOS deployment, so hopefully that ends up easier in the future.\u003c/p\u003e\n",
            "summary": "I have a small mobile app that I wrote using React Native (henceforth RN) back in 2017, currently deployed on the Google Play Store and Apple App Store. Shortly before my US trip, I got an email from Google telling me about a required action:\n By August 1, 2019, all apps that use native code must provide a 64-bit version in addition to the 32-bit version in order to publish an update.",
            "date_published": "2019-07-20T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/react-native-mobile-devt/index.md"
            , "tags": ["software development","react native","mobile"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1152458840299974657/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151907300065415169/",
            "url": "https://mirror.roytang.net/2019/07/1151907300065415169/",
            "path": "/2019/07/1151907300065415169/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/jaymelynilao/\"\u003e@jaymelynilao\u003c/a\u003e \u003ca href=\"https://twitter.com/SeresaTagAraw/\"\u003e@SeresaTagAraw\u003c/a\u003e pano nagwiwithdraw sa CR!\u003c/p\u003e\n",
            "summary": "@jaymelynilao @SeresaTagAraw pano nagwiwithdraw sa CR!",
            "date_published": "2019-07-18T17:31:16+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151907300065415169/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151907300065415169/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151718693379985408/",
            "url": "https://mirror.roytang.net/2019/07/1151718693379985408/",
            "path": "/2019/07/1151718693379985408/",
            "title": "",
            "content_html": "\u003cp\u003eOvercoming the Need to Be Exceptional \u003ca href=\"https://www.theschooloflife.com/thebookoflife/overcoming-the-need-to-be-exceptional/\"\u003ehttps://www.theschooloflife.com/thebookoflife/overcoming-the-need-to-be-exceptional/\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Overcoming the Need to Be Exceptional https://www.theschooloflife.com/thebookoflife/overcoming-the-need-to-be-exceptional/",
            "date_published": "2019-07-18T05:01:49+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151718693379985408/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151718693379985408/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/overcoming-the-need-to-be-exceptional/",
            "url": "https://mirror.roytang.net/2019/07/overcoming-the-need-to-be-exceptional/",
            "path": "/2019/07/overcoming-the-need-to-be-exceptional/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-07-17T23:49:56-05:00",
            "date_modified": "2020-02-10T07:11:30+08:00",
            "section": "links",
            "source_path": "links/2019/07/overcoming-the-need-to-be-exceptional/index.md"
            
            , "syndicated": [{"type":"pocket","url":"https://www.theschooloflife.com/thebookoflife/overcoming-the-need-to-be-exceptional/"}]
            ,"link": "https://www.theschooloflife.com/thebookoflife/overcoming-the-need-to-be-exceptional/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151509392098861057/",
            "url": "https://mirror.roytang.net/2019/07/1151509392098861057/",
            "path": "/2019/07/1151509392098861057/",
            "title": "",
            "content_html": "\u003cp\u003eI found an old archive of documents/code from when I was in university  and boy, was I a big fan of Comic Sans back then lol. Maybe I\u0026rsquo;ll put the  entire lot up on the blog one of these days\u003c/p\u003e\n",
            "summary": "I found an old archive of documents/code from when I was in university and boy, was I a big fan of Comic Sans back then lol. Maybe I\u0026rsquo;ll put the entire lot up on the blog one of these days",
            "date_published": "2019-07-17T15:10:07+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "photos",
            "source_path": "photos/2019/07/1151509392098861057/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151509392098861057/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151399242549927936/",
            "url": "https://mirror.roytang.net/2019/07/1151399242549927936/",
            "path": "/2019/07/1151399242549927936/",
            "title": "",
            "content_html": "\u003cp\u003eThought I had permanently lost the signing key for an app through careless deleting. Luckily past me anticipated future me being an idiot and made backups\u003c/p\u003e\n",
            "summary": "Thought I had permanently lost the signing key for an app through careless deleting. Luckily past me anticipated future me being an idiot and made backups",
            "date_published": "2019-07-17T07:52:26+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151399242549927936/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151399242549927936/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/why-travel/",
            "url": "https://mirror.roytang.net/2019/07/why-travel/",
            "path": "/2019/07/why-travel/",
            "title": "Why Travel?",
            "content_html": "\u003cp\u003ePeople travel for different reasons.\u003c/p\u003e\n\u003cp\u003eMy parents travel mostly for shopping purposes. Which meant when I flew back home with them during the recent trip, we came back with an additional 3 fully-packed pieces of luggage full of shoes and clothes and such. As someone who doesn\u0026rsquo;t really indulge in shopping, I can\u0026rsquo;t relate to this, and in fact it runs anathema to my philosophy of always packing as little as necessary when travelling.\u003c/p\u003e\n\u003cp\u003eThen there are people I know (mostly younger people) who seem to be travelling every weekend or every other weekend and they\u0026rsquo;re always at the beach or some tourist spot or exotic location. I find this difficult to relate to as well, not only because that seems like an unnecessarily expensive lifestyle, but if you\u0026rsquo;re \u0026ldquo;getting away\u0026rdquo; every weekend, won\u0026rsquo;t that sort of thing become routine?\u003c/p\u003e\n\u003cp\u003eIn general, I don\u0026rsquo;t view travelling as a vacation or as a rest period. Travelling is expensive and stressful and \u003ca href=\"/2019/07/travel-anxiety-part-2/\"\u003ecan be anxiety-inducing\u003c/a\u003e. Not my idea of vacation or rest. For me travel is either purposeful (usually for me that means either work trips or playing \u003ca href=\"/tags/grand-prix/\"\u003eMagic Grand Prix\u003c/a\u003e), or as a tourist (something I\u0026rsquo;ve only started doing as recently as the last 5 years).\u003c/p\u003e\n\u003cp\u003eI think the real value of travel is in getting a chance to step away from your daily routines. Stepping out from your usual environments and the familiar culture around you and immersing in something different. Experiencing something different lets you challenge your own culture and world view.\u003c/p\u003e\n\u003cp\u003eAnd when we come back from our travel, when we reacquaint ourselves with what we had before, we get to see our old rhythms and comfort zones with fresh eyes. What used to be routine may look different in light of recent experiences. When resuming old habits we get to ask a fresh set of \u0026ldquo;Why?\u0026rdquo;, \u0026ldquo;Do I really need this?\u0026rdquo;, or \u0026ldquo;Could this be done better?\u0026rdquo;. We gain a newfound appreciation of things we missed. And hopefully, we are changed for the better.\u003c/p\u003e\n\u003cp\u003eI think that\u0026rsquo;s where the value is. We travel so we can be forever changed.\u003c/p\u003e\n",
            "summary": "People travel for different reasons.\nMy parents travel mostly for shopping purposes. Which meant when I flew back home with them during the recent trip, we came back with an additional 3 fully-packed pieces of luggage full of shoes and clothes and such. As someone who doesn\u0026rsquo;t really indulge in shopping, I can\u0026rsquo;t relate to this, and in fact it runs anathema to my philosophy of always packing as little as necessary when travelling.",
            "date_published": "2019-07-17T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/why-travel/index.md"
            , "tags": ["travels"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151372037207842816/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151331237342208001/",
            "url": "https://mirror.roytang.net/2019/07/1151331237342208001/",
            "path": "/2019/07/1151331237342208001/",
            "title": "",
            "content_html": "\u003cp\u003eUpgrading a react native app does not give me joy\u003c/p\u003e\n",
            "summary": "Upgrading a react native app does not give me joy",
            "date_published": "2019-07-17T03:22:12+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151331237342208001/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151331237342208001/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151310954262487041/",
            "url": "https://mirror.roytang.net/2019/07/1151310954262487041/",
            "path": "/2019/07/1151310954262487041/",
            "title": "",
            "content_html": "\u003cp\u003ewag kayo basta basta magtitiwala sa “walking distance” kapag ang nagsabi ay isang UP Student\u003c/p\u003e\n",
            "summary": "wag kayo basta basta magtitiwala sa “walking distance” kapag ang nagsabi ay isang UP Student",
            "date_published": "2019-07-17T02:01:36+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151310954262487041/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151310954262487041/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151055634529308672/",
            "url": "https://mirror.roytang.net/2019/07/1151055634529308672/",
            "path": "/2019/07/1151055634529308672/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/aleksfelipe/\"\u003e@aleksfelipe\u003c/a\u003e basta Azeus, early years yun hahaha\u003c/p\u003e\n",
            "summary": "@aleksfelipe basta Azeus, early years yun hahaha",
            "date_published": "2019-07-16T09:07:03+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151055634529308672/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151055634529308672/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151041423325765632/",
            "url": "https://mirror.roytang.net/2019/07/1151041423325765632/",
            "path": "/2019/07/1151041423325765632/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/aleksfelipe/\"\u003e@aleksfelipe\u003c/a\u003e This is the best way to learn lol\u003c/p\u003e\n",
            "summary": "@aleksfelipe This is the best way to learn lol",
            "date_published": "2019-07-16T08:10:35+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151041423325765632/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151041423325765632/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151028795245154304/",
            "url": "https://mirror.roytang.net/2019/07/1151028795245154304/",
            "path": "/2019/07/1151028795245154304/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/joyarmadamba/\"\u003e@joyarmadamba\u003c/a\u003e Sorry! 😁\u003c/p\u003e\n",
            "summary": "@joyarmadamba Sorry! 😁",
            "date_published": "2019-07-16T07:20:24+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151028795245154304/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151028795245154304/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1151026672235188224/",
            "url": "https://mirror.roytang.net/2019/07/1151026672235188224/",
            "path": "/2019/07/1151026672235188224/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/joyarmadamba/\"\u003e@joyarmadamba\u003c/a\u003e lol it\u0026rsquo;s not that\u003c/p\u003e\n",
            "summary": "@joyarmadamba lol it\u0026rsquo;s not that",
            "date_published": "2019-07-16T07:11:58+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1151026672235188224/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151026672235188224/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/10x-programmers/",
            "url": "https://mirror.roytang.net/2019/07/10x-programmers/",
            "path": "/2019/07/10x-programmers/",
            "title": "10X Programmers",
            "content_html": "\u003cp\u003eThe topic of the mythical \u003ca href=\"https://softwareengineering.stackexchange.com/questions/179616/a-good-programmer-can-be-as-10x-times-more-productive-than-a-mediocre-one\"\u003e\u0026ldquo;10x programmer\u0026rdquo;\u003c/a\u003e has been the topic of discussion recently on tech twitter, due to \u003ca href=\"https://twitter.com/skirani/status/1149302828420067328?s=19\"\u003ea thread\u003c/a\u003e listing out the supposed signs of being such a mythical beast.\u003c/p\u003e\n\u003cblockquote class=\"twitter-tweet\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003e10x engineers\u003cbr\u003e\u003cbr\u003eFounders if you ever come across this rare breed of engineers, grab them. If you have a 10x engineer as part of your first few engineers, you increase the odds of your startup success significantly.\u003cbr\u003e\u003cbr\u003eOK, here is a tough question.\u003cbr\u003e\u003cbr\u003eHow do you spot a 10x engineer?\u003c/p\u003e\u0026mdash; Shekhar Kirani (@skirani) \u003ca href=\"https://twitter.com/skirani/status/1149302828420067328?ref_src=twsrc%5Etfw\"\u003eJuly 11, 2019\u003c/a\u003e\u003c/blockquote\u003e \u003cscript async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e \n\u003cp\u003eThe thread received a lot of negative responses, mainly because several of these items can be considered red flags indicating someone who doesn\u0026rsquo;t play well with others - hates meetings, prefer irregular hours, poor mentoring ability, disdain for documentation, find process miserable, works alone to produce great code, etc. These attributes remind me of Steve McConnel\u0026rsquo;s description of programming heroics in \u003cem\u003eProfessional Software Development\u003c/em\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eCombine a shortage of skilled workers with the common tendency to set overly optimistic schedules, and the stage is set for the programming hero. Programming heroes take on challenging assignments and write mountains of code. They work vast amounts of overtime. They become indispensable to their projects. Success, it seems, rests squarely on their shoulders.\u003c/p\u003e\n\u003cp\u003eProject managers both love and fear hero programmers because they are smart, temperamental, and sometimes a little self-righteous, and because the managers don\u0026rsquo;t see any way to complete the project without them. In a tight labor market, replacing them isn\u0026rsquo;t an option.\u003c/p\u003e\n\u003cp\u003eUnfortunately, the reality is that for every programming hero who is capable of monumental coding achievements, there are other pathological programming disasters who just don\u0026rsquo;t know how to work well with others. They hoard design information and source code. They refuse to participate in technical reviews. They refuse to follow standards established by the team. The sum total of their actions is to prevent other team members from making potentially valuable contributions. A significant number of programming heroes don\u0026rsquo;t turn out to be heroes at all; they turn out to be prima donna programming ball hogs.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eDespite the negative feedback, I found myself relating to the list in the thread above because most if not all of these items could have been used to describe myself at some point or another in my career. Especially in my earlier years, I had a profound dislike for meetings and documentation and process. I think this sort of attitude stems from the transition from being a solo developer (which you largely are in school) who enjoys the act of coding to being part of a team tasked to deliver the software. The first-time team member may find it difficult to appreciate having to do all these non-coding things (meetings, mentoring, documentation) because he doesn\u0026rsquo;t yet have an appreciation of how they can make things smoother for the entire team.\u003c/p\u003e\n\u003cp\u003eNot all of the items in the list are bad habits. Luckily, I think I grew out of most of the bad ones as my career went on and I became part of different teams and filled different roles. Not all of these are bad habits though. Going through the list:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers hate meetings. They think it is a waste of time and obvious things are being discussed. They attend meetings because the manager has called for a \u0026ldquo;Staff meeting\u0026rdquo; to discuss the features and status.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI\u0026rsquo;m still wary of too many unnecessary meetings, but I also understand how getting people away from their IDEs and together for a discussion can be necessary to bring a project back on track.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eTimings in the office for 10x engineers is highly irregular. They tend to work when very few folks are around. If there is a crowd or all-hands meeting, they are not visible. Most of them are late-night coders and come late to the office.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI think locally, people tend to come in later during the day instead of earlier, due to Metro Manila traffic. I knew that if I wanted some focused time, I could come in early and not much people would bother me. I think this is generally an ok practice, as long as you\u0026rsquo;re still available during core hours when your team needs you.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers laptop screen background color is typically black (they always change defaults). Their keyboard keys such as i, f, x are usually worn out than of a, s, and e (email senders).\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis one is just straight-up cargo-cult nonsense. Different people have different preferences. (Okay, I do prefer dark background IDEs).\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers know every line of the code that has gone into production. If a QA or support folks alert an issue, they know precisely where the fault (or bug) is and can fix the same in hours vs days\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI have been in this kind of situation, although I guess it\u0026rsquo;s a bit of an exaggeration. Typically if you\u0026rsquo;re working in a team with a nontrivial codebase and you \u0026ldquo;know everything\u0026rdquo;, some of your knowledge may be shallow, and some other devs who spent more time with each module may have more in-depth knowledge of how a particular module works. Having one guy with good oversight into the codebase can be handy for the team - for the reason cited above, they may easily be identify the cause of an issue, but the team should make sure he\u0026rsquo;s not the only guy familiar with everything. Some redundancy is needed so that you aren\u0026rsquo;t always dependent on the same person everytime. It\u0026rsquo;s also bad for you as the developer who knows everything about the codebase, as it can be very hard to go on vacation, you\u0026rsquo;ll have a tendency to get calls such as \u0026ldquo;Hey, just a really quick question, do you know where is the code that does XYZ?\u0026rdquo;\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003eMost of the 10x engineers are full-stack engineers. For them code is code, they don\u0026rsquo;t care whether it is front-end, back-end, API, database, serverless, etc. I have rarely seen them doing UI work.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis is still true for me. And just the other day during a call I had to give a disclaimer that my UI work isn\u0026rsquo;t the best lol. I don\u0026rsquo;t think this is indicative of disdain for specialists, there should be room in a team for both \u003ca href=\"/2016/12/generalists-and-specialists-in-dev-teams/\"\u003egeneralists and specialists\u003c/a\u003e.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers can convert \u0026ldquo;thought\u0026rdquo; into \u0026ldquo;code\u0026rdquo; in their mind and write it in an iterative fashion. Given a product feature, they can write that entire feature in one or two sittings of 4 to 6 hours with a caffeinated drink without distraction.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI mean, this is just describing a developer who\u0026rsquo;s in the zone. It\u0026rsquo;s true that developers who can get into the zone on a regular basis are likely to be much more productive, that\u0026rsquo;s a tautology.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers rarely look at help documentation of classes or methods. They know it in memory and can recall from memory. They write code at the same ease as writing English. No breaks, no pauce, just type.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis one is a bit of BS, especially in modern software development where we have the meme of developers coding by stackoverflow. It might have been true in the older days when there weren\u0026rsquo;t a billion and one APIs and frameworks to know and learn.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers are always learning new frameworks, languages ahead of everyone in the company. They are not afraid of anything new. If there is something new (e.g. blockchain) they gobble up, setup, experiment before anyone is getting started.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis one is still true for me as of now. I still enjoy exploring new frameworks, languages and technologies, though I don\u0026rsquo;t always have the time for it. I think this is a good trait for a developer to have, but at the same time it may be dangerous to expect or require this of developers when putting together a team. Not everyone enjoys coding, and developers shouldn\u0026rsquo;t be penalized for not wanting to do software stuff outside of work hours.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers are poor mentors as they can\u0026rsquo;t teach others on what to do OR parcel the work. They always think \u0026ldquo;It takes too long to teach or discuss with others, I would rather do it myself.\u0026rdquo; They are also poor interviewers.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI\u0026rsquo;m sure I have uttered some variation of that quote more than once in my career. The tendency to try to carry all the load yourself is not only a disservice to yourself, it\u0026rsquo;s a disservice to your team as you\u0026rsquo;re not helping them grow. I will admit my mentoring skills in the early years wasn\u0026rsquo;t very good - I\u0026rsquo;m the type of mentor who tends to throw you into the deep end so you can quickly learn to swim. This is because that\u0026rsquo;s my personal learning style as well, I learn more from trying stuff than from a lecture or a book. I understand that not everyone learns the same way, so I do actively try to spot opportunities for me to learn to explain things better (I like to think writing in a blog helps!) and for \u003ca href=\"/2018/10/mentoring-in-software-development/\"\u003ebetter mentoring\u003c/a\u003e. And I think my interviewing skills have improved a bit through the years as well.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers don\u0026rsquo;t hack things. They write quality code and know exactly how the code has to evolve, and have a mental model of overall code structure. They write at most one design document, and the rest is in the code.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThe idea of the most productive engineers not hacking things can only come from an idealist who hasn\u0026rsquo;t experienced schedule pressure. While of course quality code is an ideal, the best engineers know when it is necessary to make tradeoffs and workarounds to meet requirements and schedules. And they will write as many documents as needed to make sure things can be understood.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cul\u003e\n\u003cli\u003e10x engineers rarely job hunt or move out of the company. They move out because you make their life miserable with the process, meetings, training, and other non-value-added activities. If you come across them, hold on to them. Celebrate them.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThis was true for me for the longest time, I stayed with my first company for 15 years before deciding to move on. I would suspect this tends to be true for the type of engineer I described who enjoys the coding part and not so much the dealing with people part of the job. Moving companies means a lot more noncoding work: meeting new people, learning new processes and procedures, more meetings and trainings and interviews and what not. Laziness is probably also a factor.\u003c/p\u003e\n\u003cp\u003eThe items listed here remind me of the type of programmer stereotype where one programmer goes into his office, tells nobody not to bother him, then comes out after three days having written all the code and solved all the company\u0026rsquo;s problems. It\u0026rsquo;s a ridiculous, dangerous stereotype that doesn\u0026rsquo;t mesh well with how modern software development teams work.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not claiming that 10x engineers don\u0026rsquo;t exist, I\u0026rsquo;m sure they do, and I know from experience many of the above stereotypes can be true. But stereotypes are just that - stereotypes. Every programmer has had a different path and there can be superproductive programmers who also know how to well work with teams and can be great mentors and write great documentation.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m also not necessarily claiming to be a 10x programmer even though I claim to relate to the items here (false humility?). I would appreciate being paid a 10x salary though. :D\u003c/p\u003e\n\u003cp\u003eA second thread on 10x programmers I like, from Alan Cooper:\u003c/p\u003e\n\u003cblockquote class=\"twitter-tweet\"\u003e\u003cp lang=\"en\" dir=\"ltr\"\u003eI’ve worked with more than one “10x” programmer. Their brilliance is astonishing, but their output is rarely practically realized. 1\u003c/p\u003e\u0026mdash; Alan Cooper (@MrAlanCooper) \u003ca href=\"https://twitter.com/MrAlanCooper/status/1150215587978596353?ref_src=twsrc%5Etfw\"\u003eJuly 14, 2019\u003c/a\u003e\u003c/blockquote\u003e \u003cscript async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"\u003e\u003c/script\u003e ",
            "summary": "The topic of the mythical \u0026ldquo;10x programmer\u0026rdquo; has been the topic of discussion recently on tech twitter, due to a thread listing out the supposed signs of being such a mythical beast.\n10x engineers\nFounders if you ever come across this rare breed of engineers, grab them. If you have a 10x engineer as part of your first few engineers, you increase the odds of your startup success significantly.\nOK, here is a tough question.",
            "date_published": "2019-07-16T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/10x-programmers/index.md"
            , "tags": ["software development"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1151010066574843905/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150952588814311424/",
            "url": "https://mirror.roytang.net/2019/07/1150952588814311424/",
            "path": "/2019/07/1150952588814311424/",
            "title": "",
            "content_html": "\u003cp\u003eUgh why do I even ever agree to do stuff for other people?\u003c/p\u003e\n",
            "summary": "Ugh why do I even ever agree to do stuff for other people?",
            "date_published": "2019-07-16T02:17:35+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150952588814311424/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150952588814311424/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150788990410379264/",
            "url": "https://mirror.roytang.net/2019/07/1150788990410379264/",
            "path": "/2019/07/1150788990410379264/",
            "title": "",
            "content_html": "\u003cp\u003eWeaponizing Your Website \u003ca href=\"https://www.youtube.com/watch?v=eG_0n9Z_Acs\u0026amp;feature=youtu.be\"\u003ehttps://www.youtube.com/watch?v=eG_0n9Z_Acs\u0026amp;feature=youtu.be\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Weaponizing Your Website https://www.youtube.com/watch?v=eG_0n9Z_Acs\u0026amp;feature=youtu.be",
            "date_published": "2019-07-15T15:27:30+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150788990410379264/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150788990410379264/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150703336523489281/",
            "url": "https://mirror.roytang.net/2019/07/1150703336523489281/",
            "path": "/2019/07/1150703336523489281/",
            "title": "",
            "content_html": "\u003cp\u003eEastward is an upcoming adventure game that has some delightfully charming pixel art \u003ca href=\"https://www.youtube.com/watch?v=XtBwr5PSZCc\"\u003ehttps://www.youtube.com/watch?v=XtBwr5PSZCc\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Eastward is an upcoming adventure game that has some delightfully charming pixel art https://www.youtube.com/watch?v=XtBwr5PSZCc",
            "date_published": "2019-07-15T09:47:09+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150703336523489281/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150703336523489281/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150699552728670208/",
            "url": "https://mirror.roytang.net/2019/07/1150699552728670208/",
            "path": "/2019/07/1150699552728670208/",
            "title": "",
            "content_html": "\u003cp\u003eThis is the kind of innovative puzzle game I wish I had thought of and implemented \u003ca href=\"https://www.youtube.com/watch?time_continue=62\u0026amp;v=Ca5BYKRVXHM\"\u003ehttps://www.youtube.com/watch?time_continue=62\u0026amp;v=Ca5BYKRVXHM\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "This is the kind of innovative puzzle game I wish I had thought of and implemented https://www.youtube.com/watch?time_continue=62\u0026amp;v=Ca5BYKRVXHM",
            "date_published": "2019-07-15T09:32:06+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150699552728670208/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150699552728670208/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150696253556084736/",
            "url": "https://mirror.roytang.net/2019/07/1150696253556084736/",
            "path": "/2019/07/1150696253556084736/",
            "title": "",
            "content_html": "\u003cp\u003eI wonder if there\u0026rsquo;s been some studies done that show if there\u0026rsquo;s any correlation between the length of political dynasty rule in a province vs economic growth. Or even rate of corruption (is that even a measurable thing?) \nQuoted \u003ca href=\"https://twitter.com/MaoiArroyo/status/1150674351760404480\"\u003eMaoiArroyo\u0026rsquo;s tweet\u003c/a\u003e:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003ePolitical dynasties in the Philippines, not surprising that 40% of the national budget is lost to graft. 🤦🏻‍♀️🇵🇭\u003c/p\u003e\n\u003c/blockquote\u003e\n",
            "summary": "I wonder if there\u0026rsquo;s been some studies done that show if there\u0026rsquo;s any correlation between the length of political dynasty rule in a province vs economic growth. Or even rate of corruption (is that even a measurable thing?) Quoted MaoiArroyo\u0026rsquo;s tweet:\n Political dynasties in the Philippines, not surprising that 40% of the national budget is lost to graft. 🤦🏻‍♀️🇵🇭\n ",
            "date_published": "2019-07-15T09:19:00+00:00",
            "date_modified": "2019-09-12T12:24:47+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150696253556084736/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150696253556084736/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/testing-the-galaxy-a50-camera/",
            "url": "https://mirror.roytang.net/2019/07/testing-the-galaxy-a50-camera/",
            "path": "/2019/07/testing-the-galaxy-a50-camera/",
            "title": "Testing the Galaxy A50 Camera",
            "content_html": "\u003cp\u003eI mentioned in \u003ca href=\"/2019/07/samsung-galaxy-a50/\"\u003eyesterday\u0026rsquo;s post\u003c/a\u003e that I might take some comparison shots using the A50\u0026rsquo;s camera, so I thought I\u0026rsquo;d post those now. Note that I am terribly bad at photography, I am well-known for often posting out-of-focus shots and such. Well, I tried at least.\u003c/p\u003e\n\u003cp\u003eThis one is a photo of some Deceptions taken using the Samsung Galaxy A50 camera, default settings:\u003c/p\u003e\n\u003ca href=\"#8db1493f51683d27e9831083c7918a68-lightbox\"\u003e\n    \u003cfigure\u003e\n      \u003cimg src=\"/2019/07/testing-the-galaxy-a50-camera/photo_samsung_hub057ebebabd62c09a30272b868f7366e_1096489_300x0_resize_q75_box.jpg\" alt=\"\" title=\"\" class=\"tn\" /\u003e\n      \u003cfigcaption\u003e (Click to view full-size)\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003c/a\u003e\n\u003cdiv class=\"lightbox\" id=\"8db1493f51683d27e9831083c7918a68-lightbox\" style=\"display: none;\"\u003e\n  \u003ca href=\"#_\"\u003e\n    \u003cimg src=\"/2019/07/testing-the-galaxy-a50-camera/photo_samsung.jpg\" /\u003e\n  \u003c/a\u003e\n  \u003cdiv class=\"lightbox_overlay\"\u003e\n    \u003cp\u003e\u003c/p\u003e\n    \u003ctime class=\"dt-published\" datetime=\"15 Jul 2019 5:56am\"\u003e15 Jul 2019 5:56am\u003c/time\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eHere\u0026rsquo;s a similar photo taken using the Asus Zenfone Max 4 camera, default settings:\u003c/p\u003e\n\u003ca href=\"#ca6fb5867c05fd6da2d54c7bf5b5e44f-lightbox\"\u003e\n    \u003cfigure\u003e\n      \u003cimg src=\"/2019/07/testing-the-galaxy-a50-camera/photo_zenfone_hu0ed1b3326b9941a1b3dbadbb1aee37b3_1974002_300x0_resize_q75_box.jpg\" alt=\"\" title=\"\" class=\"tn\" /\u003e\n      \u003cfigcaption\u003e (Click to view full-size)\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003c/a\u003e\n\u003cdiv class=\"lightbox\" id=\"ca6fb5867c05fd6da2d54c7bf5b5e44f-lightbox\" style=\"display: none;\"\u003e\n  \u003ca href=\"#_\"\u003e\n    \u003cimg src=\"/2019/07/testing-the-galaxy-a50-camera/photo_zenfone.jpg\" /\u003e\n  \u003c/a\u003e\n  \u003cdiv class=\"lightbox_overlay\"\u003e\n    \u003cp\u003e\u003c/p\u003e\n    \u003ctime class=\"dt-published\" datetime=\"15 Jul 2019 5:56am\"\u003e15 Jul 2019 5:56am\u003c/time\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eThings look quite a bit more washed out, is that the proper term? I did like five different takes of this and they all came out around the same way. Maybe there\u0026rsquo;s some setting I need to adjust? Or I\u0026rsquo;m focusing wrong? Like I said, I don\u0026rsquo;t know much about photography, though it\u0026rsquo;s something I wouldn\u0026rsquo;t mind improving on, even with just a phone camera. I guess I need to learn things like focusing, lighting, etc. And I don\u0026rsquo;t really understand many of the phone camera features either! I suspect it will take a lot of trial and error on my part, so that may take a while haha.\u003c/p\u003e\n\u003cp\u003eFor reference, I also tried this with the new 2018 iPad, which had a pretty good camera as well, the shot turned out ok, \u003ca href=\"https://photos.app.goo.gl/u41sXTe9vtzhotTy9\"\u003ecloser to the A50 one\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eI also took an extra shot of Rippersnapper with the Galaxy A50 and the detail in the shot was pretty sweet, I \u003ca href=\"https://www.instagram.com/p/Bz4_55-BbTI/\"\u003eposted it on instagram\u003c/a\u003e.\u003c/p\u003e\n",
            "summary": "I mentioned in yesterday\u0026rsquo;s post that I might take some comparison shots using the A50\u0026rsquo;s camera, so I thought I\u0026rsquo;d post those now. Note that I am terribly bad at photography, I am well-known for often posting out-of-focus shots and such. Well, I tried at least.\nThis one is a photo of some Deceptions taken using the Samsung Galaxy A50 camera, default settings:\n  (Click to view full-size)",
            "date_published": "2019-07-15T05:56:56+00:00",
            "date_modified": "2020-10-20T13:05:18+08:00",
            "section": "post",
            "source_path": "post/2019/07/test-galaxy-a50-camera/index.md"
            , "tags": ["tech life","photography"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150715600425164800/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150638078437933057/",
            "url": "https://mirror.roytang.net/2019/07/1150638078437933057/",
            "path": "/2019/07/1150638078437933057/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Woerlan/\"\u003e@Woerlan\u003c/a\u003e it\u0026rsquo;s the 3rd quarter already, if they\u0026rsquo;re not announcing anything at EVO they might as well give up on 2019 lol\u003c/p\u003e\n",
            "summary": "@Woerlan it\u0026rsquo;s the 3rd quarter already, if they\u0026rsquo;re not announcing anything at EVO they might as well give up on 2019 lol",
            "date_published": "2019-07-15T05:27:50+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150638078437933057/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150638078437933057/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150562542886035458/",
            "url": "https://mirror.roytang.net/2019/07/1150562542886035458/",
            "path": "/2019/07/1150562542886035458/",
            "title": "",
            "content_html": "\u003cp\u003eWell, the next few weekends are lit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJul 18-21 SDCC (MCU Phase 4 reveal, MTG \u0026ldquo;Archery\u0026rdquo; reveal)\u003c/li\u003e\n\u003cli\u003eJul 26-28 MC Barcelona (MTG Modern)\u003c/li\u003e\n\u003cli\u003eAug 2-4 EVO (hopefully SFV S4 news??)\u003c/li\u003e\n\u003c/ul\u003e\n",
            "summary": "Well, the next few weekends are lit:\n Jul 18-21 SDCC (MCU Phase 4 reveal, MTG \u0026ldquo;Archery\u0026rdquo; reveal) Jul 26-28 MC Barcelona (MTG Modern) Aug 2-4 EVO (hopefully SFV S4 news??)  ",
            "date_published": "2019-07-15T00:27:41+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150562542886035458/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150562542886035458/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150556581458632704/",
            "url": "https://mirror.roytang.net/2019/07/1150556581458632704/",
            "path": "/2019/07/1150556581458632704/",
            "title": "",
            "content_html": "\u003cp\u003eI’ve worked with more than one “10x” programmer. Their brilliance is astonishing, but their output is rarely practically realized. 1\u003c/p\u003e\n",
            "summary": "I’ve worked with more than one “10x” programmer. Their brilliance is astonishing, but their output is rarely practically realized. 1",
            "date_published": "2019-07-15T00:03:59+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150556581458632704/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150556581458632704/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/samsung-galaxy-a50/",
            "url": "https://mirror.roytang.net/2019/07/samsung-galaxy-a50/",
            "path": "/2019/07/samsung-galaxy-a50/",
            "title": "Samsung Galaxy A50",
            "content_html": "\u003cp\u003eSince I was going to be staying in the US for more than a month, on my first day there, I went over to Best Buy and got myself a T-Mobile sim card and plan, and the staff there helpfully offered to install the sim into my phone, then the Asus Zenfone Max 4. Upon handling my phone, she commented \u0026ldquo;you know you\u0026rsquo;re battery\u0026rsquo;s expanding, right? That\u0026rsquo;s dangerous, it could explode or such\u0026rdquo;, but I shrugged it off. I\u0026rsquo;m no stranger to batteries expanding, it happened before to my old Samsung Galaxy phones and I had to buy replacement batteries then. Unfortunately, the Zenfone Max 4 did not have a replacement battery, so that was out of the question. I ignored it for a while, and just hoped the phone would last until the end of the trip.\u003c/p\u003e\n\u003cp\u003eDuring the rest of the trip, I would notice it was starting to pop out of its case, and I had to push down on it to hold it together, and I accepted that I had to get a new phone as soon as I got home. Even performance-wise I had noticed in recent weeks that it was already quite sluggish. Literally during the flight back home while the phone was powered off in my pocket, I would bring it out and need to push it back together again, I was worried I wouldn\u0026rsquo;t have a phone when I landed. I guess it\u0026rsquo;s fortunate that the phone made it all the way home.\u003c/p\u003e\n\u003cp\u003eLuckily, I had a contract renewal available with Globe, which meant I could get a new handset. Even before the flight home I started looking at their website to see what handsets I could get; the choices were either an IPhone (way too expensive), a midrange Samsung Galaxy A-series phone, and a Chinese-manufactured phone (Huawei or Oppo). I\u0026rsquo;m not fond of the idea of Chinese telecom companies, so I decided to go with a Samsung again. I had used two Samsung phones before, both Galaxy S\u0026rsquo;s, so I was kind of coming home, I guess?\u003c/p\u003e\n\u003cp\u003eI settled on the Samsung Galaxy A50, as it was the best midrange phone there. My P999 plan meant I had to do a bit of a cashout, but that was fine. Specs-wise, it compared favorably to the Zenfone Max 4, except for the battery which was 20% less than the Zenfone. The high battery life was why I chose the Zenfone in the first place, so I figured the slight drop would be tolerable. Another minor concern was that the new phone would be USB-C, my first such device. It meant I wouldn\u0026rsquo;t be able to reuse all my old MicroUSB cables, but I guess that\u0026rsquo;s not much of a loss.\u003c/p\u003e\n\u003cp\u003eI thought about doing the contract renewal over the phone, but that meant having to wait a few days for delivery or pickup. I was worried the old phone might die soon (experience shows it\u0026rsquo;ll probably chug along for a while though), and I wanted an excuse to go to the mall, so I did the renewal at the Globe store instead. It was a pretty quick and painless process (fill up a few forms, wait in a queue, yada yada all done), and I had a new handset two days after I came back from the trip.\u003c/p\u003e\n\u003cp\u003eThe handset itself looks pretty good and as expected it\u0026rsquo;s performing a lot better than the older phone, since this unit just came out early this year. It\u0026rsquo;s a lot thinner and slightly taller and has a cool reflective back frame. There\u0026rsquo;s a triple camera that reviews tell me are really good but I wouldn\u0026rsquo;t know because I\u0026rsquo;m terrible at photography. Maybe I\u0026rsquo;ll take some comparison shots with the old phone if I feel like it. The battery life is reasonable, looks like it could last a full day if I do a full charge.\u003c/p\u003e\n\u003cp\u003eOne thing I want to do differently this time to try to maximize the battery life is to avoid leaving the phone charging overnight, since that\u0026rsquo;s supposedly bad for battery life. Like many other things, I\u0026rsquo;m a bit obsessive-compulsive about my phone\u0026rsquo;s battery always being charged, so I like having the phone fully charged when I wake up in the mornings. (My friends will happily tell you that if they send me a phone screenshot where their battery is at like 13% my first comment would be that they need to charge.) This time I will try to wean myself off that habit, let\u0026rsquo;s see how that works out.\u003c/p\u003e\n",
            "summary": "Since I was going to be staying in the US for more than a month, on my first day there, I went over to Best Buy and got myself a T-Mobile sim card and plan, and the staff there helpfully offered to install the sim into my phone, then the Asus Zenfone Max 4. Upon handling my phone, she commented \u0026ldquo;you know you\u0026rsquo;re battery\u0026rsquo;s expanding, right? That\u0026rsquo;s dangerous, it could explode or such\u0026rdquo;, but I shrugged it off.",
            "date_published": "2019-07-14T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/samsung-galaxy-a50/index.md"
            , "tags": ["tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150316625717059584/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150262889950765056/",
            "url": "https://mirror.roytang.net/2019/07/1150262889950765056/",
            "path": "/2019/07/1150262889950765056/",
            "title": "",
            "content_html": "\u003cp\u003eAng hirap maningil ng pera =/\u003c/p\u003e\n",
            "summary": "Ang hirap maningil ng pera =/",
            "date_published": "2019-07-14T04:36:58+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150262889950765056/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150262889950765056/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1150242070562582528/",
            "url": "https://mirror.roytang.net/2019/07/1150242070562582528/",
            "path": "/2019/07/1150242070562582528/",
            "title": "",
            "content_html": "\u003cp\u003eWhen we sleep, our dreams bare the truths behind the lies we tell ourselves\u003c/p\u003e\n",
            "summary": "When we sleep, our dreams bare the truths behind the lies we tell ourselves",
            "date_published": "2019-07-14T03:14:14+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1150242070562582528/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150242070562582528/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/bz4_55-bbti/",
            "url": "https://mirror.roytang.net/2019/07/bz4_55-bbti/",
            "path": "/2019/07/bz4_55-bbti/",
            "title": "",
            "content_html": "\u003cp\u003eRippersnapper! #transformers #decepticons\u003c/p\u003e\n",
            "summary": "Rippersnapper! #transformers #decepticons",
            "date_published": "2019-07-14T01:33:13+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/07/Bz4_55-BbTI/index.md"
            , "tags": ["transformers","decepticons"]
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/Bz4_55-BbTI/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1150322868603052033/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149935305333661697/",
            "url": "https://mirror.roytang.net/2019/07/1149935305333661697/",
            "path": "/2019/07/1149935305333661697/",
            "title": "",
            "content_html": "\u003cp\u003eNew supervillain idea: Mad scientist invents a device that can steal time from other people so that he has more time watch Netflix and play games and read books and stuff\u003c/p\u003e\n",
            "summary": "New supervillain idea: Mad scientist invents a device that can steal time from other people so that he has more time watch Netflix and play games and read books and stuff",
            "date_published": "2019-07-13T06:55:16+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149935305333661697/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149935305333661697/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/travel-anxiety-part-2/",
            "url": "https://mirror.roytang.net/2019/07/travel-anxiety-part-2/",
            "path": "/2019/07/travel-anxiety-part-2/",
            "title": "Travel Anxiety, Part 2",
            "content_html": "\u003cp\u003eI had written about \u003ca href=\"/2015/11/travel-anxiety/\"\u003etravel anxiety\u003c/a\u003e before, but I\u0026rsquo;m revisiting the topic because the recent US trip reminded me how much of a problem it is for me.\u003c/p\u003e\n\u003cp\u003eThe US trip was a new experience because I would be abroad for 40 days with multiple travel legs, it involved 4 international flights (back and forth) plus three domestic flights within the US, and on one leg and several flights I would be travelling alone. I had travelled abroad before for a longer period (3 months for London in 2015), but for those 3 months I was based in the same place and didn\u0026rsquo;t need anybody\u0026rsquo;s help to move around the city, etc.\u003c/p\u003e\n\u003cp\u003eI can get a bit crazy in planning for possible problems. Loss of passport is probably the worst-case scenario, followed by getting sick/injured while abroad (especially since I\u0026rsquo;m wary of the expensiveness of US health care), and of course there\u0026rsquo;s the possibility all your other stuff getting lost or stolen. In case of catastophe, I set up an online URL (known only to me) where I can access emergency info such as my passport details, contact number for relatives, and so on. Of course I also have paper printouts of needed info.\u003c/p\u003e\n\u003cp\u003eBy my own count, I had ridden on an airplane 23 times now in my lifetime (19 international, 1 domestic PH, 3 domestic US), but I still worry a lot about any given flight. There are multiple possible points of failure for any one flight, some of them unique to the US, specifically:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eneed to arrive at the airport on time, without forgetting your travel documents\u003c/li\u003e\n\u003cli\u003eneed to pass security/immigration/customs. Added feature this time was the stricter TSA screening. And the customs form I needed to fill up as I entered the US gave me some worry as well, because I was carrying some foodstuffs meant to be given to relatives and I wasn\u0026rsquo;t sure if I had to declare them or not (apparently the default answer is just don\u0026rsquo;t declare them? IDK). I had a similar issue on the way back into the PH, but even though I was given a customs form to fill up, no one actually asked for it?!? ¯\\_(ツ)_/¯\u003c/li\u003e\n\u003cli\u003eneed to pray that your checked luggage doesn\u0026rsquo;t get lost or stolen from. Additionally, in the US, the TSA may open your checked luggage outside of your presence, and if you\u0026rsquo;re using a non-TSA approved luggage lock, they will break your lock to do so. I had the misfortune of getting \u003ca href=\"https://photos.app.goo.gl/BMYFgcLnrtpwiEd66\"\u003ethis souvenir from the TSA\u003c/a\u003e because of this (I have since purchased TSA-approved locks)\u003c/li\u003e\n\u003cli\u003eneed to make sure no one else claims your checked baggage at the carousel\u003c/li\u003e\n\u003cli\u003ewill I even be able to sleep during the long haul flight? Undoubtably yes, but only in very short bursts that I presume are not healthy. Airplane economy seats are often very uncomfortable for me and and have very little leg room, and the seat backs are not conducive to me sleeping. I am so uncomfortable on airplanes that I\u0026rsquo;ve come to realize that me preparing movies/books/comics/games to entertain me during the flight is a waste of time, as I typically won\u0026rsquo;t indulge in those activities when I\u0026rsquo;m not very comfortable. Typically, a long haul flight goes like this for me:\n\u003cul\u003e\n\u003cli\u003eTry to sleep\u003c/li\u003e\n\u003cli\u003eWake up after 2-8 minutes due to some noise or due to my neck hurting\u003c/li\u003e\n\u003cli\u003eCheck the flight status/time to see how much longer I have to tolerate this nonsense\u003c/li\u003e\n\u003cli\u003eStare for a while into the void, doing nothing, hoping I can somehow make this flight go by faster\u003c/li\u003e\n\u003cli\u003e(Optional) Get up and go to the 0.5 square meter lavatory so I can stretch my legs\u003c/li\u003e\n\u003cli\u003eMake tiny adjustment in neck or butt or leg position(s) and hope that helps me sleep better\u003c/li\u003e\n\u003cli\u003eRepeat\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe start of my trip gave me some anxiety as well, when I went to the check-in counter at NAIA, the Asiana lady could not scan my machine-readable passport, presumably due to a fold on the relevant page. She said she would process me manually but warned me that there was a possibility that they would reject my passport at my US entry point since a machine-readable passport was a requirement. I even had to sign a waiver absolving Asiana of any liability in case I was not allowed to enter the US! Basically they gave me reason to be worried during the entire length of the 18-hour trip to SFO. Spoilers: there was no issue at the US border, and there was never any further issue scanning my passport at any point including at the e-Gate as I was re-entering the PH. (Props to NAIA for having e-Gates now.)\u003c/p\u003e\n\u003cp\u003eAnother issue I encountered was because this was my first time actually visiting relatives during a trip, so I was not prepared for the Filipino culture thing of having your relatives give you stuff to bring back home. I always pack as lightly as possible and have a small luggage unit specifically because I don\u0026rsquo;t want to have to worry about lugging around a lot of weight. Because of this, on my way back to Seattle from Houston, and from Seattle to Sacramento, I had to handcarry a large paper back with stuff for my folks and siblings. I did not have a spare bag to carry the items, and on the trip to Sacramento, the bag was even slightly ripped, I did not have a contingency plan for if it fell apart. Luckily, things worked out lol.\u003c/p\u003e\n\u003cp\u003eI mentioned in the previous post that I don\u0026rsquo;t really do much shopping, but my parents did, and we ended up having 3 additional checked luggage pieces ((all of them near the 50lbs limit), which meant I had to carry one myself during my flight. (We were flying back on the same day, but had separate flights). This added to bit about my anxiety, as what if some customs official asked me what I had in the large luggage and I had no idea? Luckily again, things worked out.\u003c/p\u003e\n\u003cp\u003eAside from the flights, I also had to arrange for lodging, as not all the places we were going to had friends or relatives we could crash at. I ended up using 3 different AirBNBs, one each in Anaheim, Los Angeles and Seattle. AirBNBs come with their own set of anxieties:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ewill I be able to find the place?\u003c/li\u003e\n\u003cli\u003ewill there be an issue with the check in process?\u003c/li\u003e\n\u003cli\u003ecan I trust the host not to steal my stuff or spy on my with a hidden camera or something? The thing about AirBNBs is you basically have to trust strangers; one of my issues this time is I was travelling with a laptop, so I was worried that it might not be secure to leave the laptop at the AirBNB when I went out.\u003c/li\u003e\n\u003cli\u003eis the AirBNB area secure? Can I walk around the area at night?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHappily, I encountered no issues with the AirBNBs I rented and had pleasant stays all around.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Luckily, things worked out\u0026rdquo; is generally the outcome to be expected for most of these overthinking-type anxieties I guess. I know it\u0026rsquo;s not rational to worry about all of these things a lot, and I understand the odds are low for any particular risk, but sometimes I can\u0026rsquo;t help myself. Often I can manage the happy-go-lucky \u0026ldquo;eh, I\u0026rsquo;m sure it\u0026rsquo;ll be fine\u0026rdquo; attitude for any single problem, but in this instance the fact that I had to worry about so many different flights (not to mention iteneraries like theme parks, meetups, etc) made it extra challenging. I guess I just need to remind myself not to worry too much. While there are certainly a lot of possible \u0026ldquo;things that can go wrong\u0026rdquo;, most of them are easily recoverable from, and the odds are very low anyway. I\u0026rsquo;ve survived this long in a harsh environment like Metro Manila, so I can probably survive something going wrong in more \u0026ldquo;civilized\u0026rdquo; (?) countries like the US anyway!\u003c/p\u003e\n",
            "summary": "I had written about travel anxiety before, but I\u0026rsquo;m revisiting the topic because the recent US trip reminded me how much of a problem it is for me.\nThe US trip was a new experience because I would be abroad for 40 days with multiple travel legs, it involved 4 international flights (back and forth) plus three domestic flights within the US, and on one leg and several flights I would be travelling alone.",
            "date_published": "2019-07-13T05:56:56+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/07/travel-anxiety-2/index.md"
            , "tags": ["travels","ustrip2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149923712529063936/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149788659408760833/",
            "url": "https://mirror.roytang.net/2019/07/1149788659408760833/",
            "path": "/2019/07/1149788659408760833/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e if we combine our special powers, the rain won\u0026rsquo;t know what to do! :p I hope you didn\u0026rsquo;t get wet this time!\u003c/p\u003e\n",
            "summary": "@Westraid if we combine our special powers, the rain won\u0026rsquo;t know what to do! :p I hope you didn\u0026rsquo;t get wet this time!",
            "date_published": "2019-07-12T21:12:33+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149788659408760833/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149788659408760833/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149588065683292161/",
            "url": "https://mirror.roytang.net/2019/07/1149588065683292161/",
            "path": "/2019/07/1149588065683292161/",
            "title": "",
            "content_html": "\u003cp\u003eMy special power is getting home like ten seconds before the rain falls\u003c/p\u003e\n",
            "summary": "My special power is getting home like ten seconds before the rain falls",
            "date_published": "2019-07-12T07:55:27+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149588065683292161/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149588065683292161/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/us-2019-san-francisco-area-and-trip-summary/",
            "url": "https://mirror.roytang.net/2019/07/us-2019-san-francisco-area-and-trip-summary/",
            "path": "/2019/07/us-2019-san-francisco-area-and-trip-summary/",
            "title": "US 2019 - San Francisco area and Trip Summary",
            "content_html": "\u003cp\u003eAfter the \u003ca href=\"/2019/07/us-2019-seattle/\"\u003eSeattle part of the trip\u003c/a\u003e, I reunited with family for the final leg of the trip where we all be hanging around the San Francisco bay area. We were based in my uncle\u0026rsquo;s place in Vacaville, which one of my friends kindly described as \u0026ldquo;in the sticks\u0026rdquo;, i.e. basically far away from everything. Like Houston, we had to rely on the kindness of relatives who were willing and available to drive us around.\u003c/p\u003e\n\u003cp\u003eThis was the laziest part of the trip by far: not much walking, most of it either just driving to places and taking pictures; or going to outlets for shopping.\u003c/p\u003e\n\u003cp\u003eWe spent a few days near Monterey, staying at a cousin\u0026rsquo;s house. This let us visit some nearby stuff like cannery row, the 17-mile drive and pebble beach. Climbed some rocks, saw some squirrels, walked by the wharf, that kind of stuff. After that, we also visited San Jose for a day to meet some other relatives, then the next day we drove over to San Francisco and visited the Golden Gate Bridge area, the Palace of Fine Arts (sadly closed on that day, but the exteriors were nice), and drove around the SF roads for a bit too. I was a bit underwhelmed by the Golden Gate bridge, it wasn\u0026rsquo;t as long nor as wide as I imagined it would be, but from the exhibits there I can imagine what a big deal of an engineering feat it was at that time. The streets of SF were even steeper than Seattle\u0026rsquo;s were! I\u0026rsquo;m glad I didn\u0026rsquo;t have to walk them.\u003c/p\u003e\n\u003cp\u003eThe rest of the day was just hanging out the Vacaville area and visiting (and revisiting) the outlets for shopping. Apparently Vacaville is known for the outlets. I\u0026rsquo;m not much of a shopper myself - I don\u0026rsquo;t have the patience to sift through rows of clothes or shoes looking for bargains - it\u0026rsquo;s mostly my parents who bought a bunch of stuff. I just walked around mostly looking at things.\u003c/p\u003e\n\u003cp\u003eI did make a couple of electronics purchases, one was a cheap gaming mouse (not as cheap as the ones in the PH, but not like a $60 razer either), and the bigger purchase was a 2018 iPad from Best Buy. I wanted to get a new tablet because my current iPad Pro was falling apart (I literally had some tape at the seams to hold it together), and the battery was in horrible shape. I was hesitating because the iPad Pro was actually still perfectly usable - as long as it was plugged in and the tape held. At first I wanted to get a new iPad Pro, since I wanted the pencil support, but those were wildly expensive, and even the refurbished 9.7-inch ones would have cost as much as a new 2018 iPad. Luckily, I found out that the 2018 iPad did in fact support the Apple Pencil, so I ended up getting a new one of those instead.\u003c/p\u003e\n\u003cp\u003eWe had a fourth of July barbecue at my uncle\u0026rsquo;s house, and I stayed the night at a friend\u0026rsquo;s house in Hercules, then more lazy days of shopping to wind down our US trip. Some overall impressions of the US and random stories follow:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeverything is so far apart. During our Houston and Vacaville legs we basically had to be driven everywhere. Probably basically impossible to live without a car (as I prefer) unless you\u0026rsquo;re willing to pay the higher rents in the downtown areas. There\u0026rsquo;s also so much idle land everywhere. Basically the opposite of congested Metro Manila. I have a better understanding now of why Americans are so obsessed with cars (and pickup trucks apparently) (Slight tangent: interesting article I read on \u003ca href=\"https://www.theatlantic.com/ideas/archive/2019/07/car-crashes-arent-always-unavoidable/592447/\"\u003ewhy Americans are basically forced into car dependency by laws, infrastructure and big oil\u003c/a\u003e)\u003c/li\u003e\n\u003cli\u003eno bidets! This is why Japan is superior\u003c/li\u003e\n\u003cli\u003eI suppose it\u0026rsquo;s only logical given how far apart things are, but this is the first country I\u0026rsquo;ve visited with wildly different climates in different zones. SF and LA were manageable hot - cool in the shade, but close to PH temps if you\u0026rsquo;re in the sun in the afternoons. Vegas and Houston were very, very hot. Seattle was cold in the mornings and never got too hot during the day.\u003c/li\u003e\n\u003cli\u003eAmericans are very chatty, even with strangers. I didn\u0026rsquo;t expect them to be as chatty as Filipinos since we allegedly have a reputation for being \u0026ldquo;warm and hospitable\u0026rdquo;, but Filipinos don\u0026rsquo;t randomly ask how my day is going the way random people on the street do in the US. In Las Vegas, a large black woman was trying to chat up me and my brother while we were on a food run and we were ignoring her and she asked us why we were being so antisocial\u003c/li\u003e\n\u003cli\u003eApparently Filipino expats in the US watch a lot of TFC and Telenovelas and Pinoy movies. Reminds them of home I guess. I actually sat through a couple of Pinoy movies myself, I\u0026rsquo;ll write about them in the next \u003ca href=\"/tags/watching-lately/\"\u003ewatching lately\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eThere are so many, um, shall we say, \u0026ldquo;large\u0026rdquo; Americans. Not in terms of height, but in terms of width! Not that I\u0026rsquo;m fat shaming or anything like that - I mean, I\u0026rsquo;m a huge guy myself, but seeing so many larger folk around made me feel a bit more comfortable with myself. Some of the stores we went to had shirt sizes that went as high as 6x! I think the larger Americans I saw were mostly in the theme parks and the city areas, not so much in the suburbs, not sure if that\u0026rsquo;s indicative of anything.\u003c/li\u003e\n\u003cli\u003eI used Southwest for all the domestic flights. SW is interesting because they don\u0026rsquo;t have reserved seatings for their flights - you\u0026rsquo;re assigned a boarding priority and when you board you just pick from whatever seat is available. Also apparently they let me bring free checked baggage whereas other airlines don\u0026rsquo;t so I guess I randomly made a good decision.\u003c/li\u003e\n\u003cli\u003eUS airports don\u0026rsquo;t seem very interesting, or maybe I\u0026rsquo;m just spoiled by airports like Singapore\u0026rsquo;s Changi or HKIA where I don\u0026rsquo;t mind spending a lot of time there\u003c/li\u003e\n\u003cli\u003eI didn\u0026rsquo;t spend as much as I thought I would (mostly due to the hospitality of our hosts), but still the fact that food is so expensive here really tells me a lot about how Americans view things financially. A decent meal is typically $10-$15, maybe more. Compare that to the cost of things that would be considered luxuries in the Philippines: a new video game is $60, basically 4 or 5 meals worth; a month\u0026rsquo;s Netflix sub or a comic book are less than the cost of a meal; and so on. It basically makes it so easy to impulse buy say, a $1 chocolate bar or a $4 bag of chips since these are so inexpensive compared to normal meals, but over here I\u0026rsquo;d balk at P35 chocolate bars or P150 bag of chips. I guess I\u0026rsquo;m worried that having spent time in the US, I\u0026rsquo;d be more spendy when I get back lol.\u003c/li\u003e\n\u003cli\u003ein summary, I was able to visit 4 states: California, Nevada, Texas, and Washington. (Arizona for a layover). Not bad! I didn\u0026rsquo;t get to visit the East Coast during this trip, so maybe that\u0026rsquo;s something to look forward to in the future. I am not yet sure if I even want to go back; maybe one trip is already plently, just enough to experience what life is like over there.\u003c/li\u003e\n\u003c/ul\u003e\n",
            "summary": "After the Seattle part of the trip, I reunited with family for the final leg of the trip where we all be hanging around the San Francisco bay area. We were based in my uncle\u0026rsquo;s place in Vacaville, which one of my friends kindly described as \u0026ldquo;in the sticks\u0026rdquo;, i.e. basically far away from everything. Like Houston, we had to rely on the kindness of relatives who were willing and available to drive us around.",
            "date_published": "2019-07-12T05:56:56+00:00",
            "date_modified": "2019-09-08T08:33:49+08:00",
            "section": "post",
            "source_path": "post/2019/07/us-2019-bayarea/index.md"
            , "tags": ["travels","ustrip2019","tech life"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149560093026836481/"}]
            
            , "comments": [
                { 
                    "url": "",
                    "source_file": "comment-disqus-4545431389.json"
                }, { 
                    "url": "",
                    "source_file": "comment-disqus-4549795764.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149422310408912896/",
            "url": "https://mirror.roytang.net/2019/07/1149422310408912896/",
            "path": "/2019/07/1149422310408912896/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/Westraid/\"\u003e@Westraid\u003c/a\u003e Lol I didn\u0026rsquo;t even notice it went down\u003c/p\u003e\n",
            "summary": "@Westraid Lol I didn\u0026rsquo;t even notice it went down",
            "date_published": "2019-07-11T20:56:48+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149422310408912896/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149422310408912896/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/bzyvizqbspj/",
            "url": "https://mirror.roytang.net/2019/07/bzyvizqbspj/",
            "path": "/2019/07/bzyvizqbspj/",
            "title": "",
            "content_html": "\u003cp\u003eLeftover coins from the trip, around $20 maybe\u003c/p\u003e\n",
            "summary": "Leftover coins from the trip, around $20 maybe",
            "date_published": "2019-07-11T15:11:16+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/07/BzyvIzqBspj/index.md"
            
            , "syndicated": [{"type":"instagram","url":"https://instagram.com/p/BzyvIzqBspj/"},{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149477331716599809/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149218876611334145/",
            "url": "https://mirror.roytang.net/2019/07/1149218876611334145/",
            "path": "/2019/07/1149218876611334145/",
            "title": "",
            "content_html": "\u003cp\u003eWhen you turn on your desktop pc after a month away, everything wants to update\u003c/p\u003e\n",
            "summary": "When you turn on your desktop pc after a month away, everything wants to update",
            "date_published": "2019-07-11T07:28:26+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149218876611334145/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149218876611334145/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1149038022488252417/",
            "url": "https://mirror.roytang.net/2019/07/1149038022488252417/",
            "path": "/2019/07/1149038022488252417/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/JWonggg/\"\u003e@JWonggg\u003c/a\u003e \u003ca href=\"https://twitter.com/samuraishodown/\"\u003e@samuraishodown\u003c/a\u003e #embracedeath\u003c/p\u003e\n",
            "summary": "@JWonggg @samuraishodown #embracedeath",
            "date_published": "2019-07-10T19:29:47+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/07/1149038022488252417/index.md"
            , "tags": ["embracedeath"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1149038022488252417/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1148825389482950656/",
            "url": "https://mirror.roytang.net/2019/07/1148825389482950656/",
            "path": "/2019/07/1148825389482950656/",
            "title": "",
            "content_html": "\u003cp\u003eBoarding time\u003c/p\u003e\n\u003cp\u003eOpen up the gates and let us onto the plane\u003c/p\u003e\n\u003cp\u003eBoarding time\u003c/p\u003e\n\u003cp\u003eTurn off the seatbelt light over every seat and every bag\u003c/p\u003e\n\u003cp\u003eBoarding time\u003c/p\u003e\n\u003cp\u003eOne last call for passengers so pick up your bags and get here\u003c/p\u003e\n\u003cp\u003eBoarding time\u003c/p\u003e\n\u003cp\u003eYou dont have to go home but you cant stay here\u003c/p\u003e\n",
            "summary": "Boarding time\nOpen up the gates and let us onto the plane\nBoarding time\nTurn off the seatbelt light over every seat and every bag\nBoarding time\nOne last call for passengers so pick up your bags and get here\nBoarding time\nYou dont have to go home but you cant stay here",
            "date_published": "2019-07-10T05:24:51+00:00",
            "date_modified": "2020-07-06T00:45:51+08:00",
            "section": "photos",
            "source_path": "photos/2019/07/1148825389482950656/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1148825389482950656/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1148636342865334272/",
            "url": "https://mirror.roytang.net/2019/07/1148636342865334272/",
            "path": "/2019/07/1148636342865334272/",
            "title": "",
            "content_html": "\u003cp\u003eGoing out is overrated\u003c/p\u003e\n",
            "summary": "Going out is overrated",
            "date_published": "2019-07-09T16:53:39+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1148636342865334272/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1148636342865334272/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/07/1148636340373852162/",
            "url": "https://mirror.roytang.net/2019/07/1148636340373852162/",
            "path": "/2019/07/1148636340373852162/",
            "title": "",
            "content_html": "\u003cp\u003eDay before flight: load up movies, tv eps, ebooks, etc on tablet for entertainment while travelling\u003c/p\u003e\n\u003cp\u003eDuring flight: Just stare at phone or sleep\u003c/p\u003e\n",
            "summary": "Day before flight: load up movies, tv eps, ebooks, etc on tablet for entertainment while travelling\nDuring flight: Just stare at phone or sleep",
            "date_published": "2019-07-09T16:53:38+00:00",
            "date_modified": "2019-09-07T07:00:25+00:00",
            "section": "notes",
            "source_path": "notes/2019/07/1148636340373852162/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1148636340373852162/"}]
            
            
            }
        
    ]
     , "prev": "/p/28/feed.json" 
     , "next": "/p/30/feed.json" 
}