{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2002/06/",
            "url": "https://mirror.roytang.net/2002/06/",
            "path": "/2002/06/",
            "title": "Monthly Archives for 06 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-06-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-06.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/05/hoshigami-ruining-blue-earth/",
            "url": "https://mirror.roytang.net/2002/05/hoshigami-ruining-blue-earth/",
            "path": "/2002/05/hoshigami-ruining-blue-earth/",
            "title": "Hoshigami: Ruining Blue Earth",
            "content_html": "\u003cp\u003eFirst off, I haven\u0026rsquo;t finished the game yet, I\u0026rsquo;m somewhere in Chapter 5. I stopped playing the game a month or so ago out of sheer irritation.\u003c/p\u003e\n\u003cp\u003eFor the uninitiated, H:RBE is a tactical RPG for the PSX, released during the last year the PSX. The game is similar in some respects to games like Final Fantasy Tactics and Tactics Ogre, with an emphasis on turn-based squad-level combats. Unlike FFT and TO\u0026rsquo;s similar Active Time system, H:RBE uses a system called RAP, where each character can perform as many actions as he wants provided he still has the RAP gauge to pay for it. The more RAP you use, the sooner your next turn comes, and vice versa. I bought this game hoping it would be at least comparable to either FFT or TO. Was I disappointed? Read on.\u003c/p\u003e\n\u003cp\u003eThe Good:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eRAP. RAP is good. The fact that you get to decide how to allocate your time, and the fact that you can control when your characters get to act. This is good.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eShoot. Shoot is good, a nice ability that adds a different tactical angle to the game, emphasizing the importance of position.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSession. Since Shoot is good, it follows that Session must be good.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDifficulty. Yes, difficulty is good, to a certain extent. Hoshigami brings a new level of difficulty to the table that we didn\u0026rsquo;t get to have in the ridiculously easy FFT. Veteran gamers were looking for a level of difficulty closer to that of the old favorite, Tactics Ogre. The game\u0026rsquo;s difficulty is actually still good (albeit good on the masochistic side) but the actual difficulty is overshadowed by the fact that it\u0026rsquo;s _tedious_. Read on.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe Bad:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eLack of variation. You basically have only five things to do: attack, shoot, move, cast spells or use items. And spells do only one of three things: deal/heal damage, or create/heal status or break equipment. Where\u0026rsquo;s the Haste spell? Protection spells?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLong battles. The lack of variation wouldn\u0026rsquo;t be so bad if you didn\u0026rsquo;t have to endure it for hours at a time.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNo saving between successive battles. That was a bad, bad, design boo-boo. You\u0026rsquo;ve been fighting for hours on end, and you\u0026rsquo;re almost finished, when a lucky archer drops the bomb on Elena.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBad AI. You know what I\u0026rsquo;m talking about. Archers who don\u0026rsquo;t understand the trajectory of their weapons. Enemies who kill each other. Soldiers who attack even if the hit chance is 0%.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnforgiving design. Permanent death. Underlevelled party has no chance against higher level party. Masses of enemies thrown at you. It\u0026rsquo;s like the designers decided that instead of simply working on tactically challenging battles, they would throw lots of enemies at you, at higher levels than you would expect and hope that you have the tactical ability to overcome this. It was a good idea except for the fact that LOW-LEVEL CHARACTERS STAND NO CHANCE AGAINST HIGH-LEVEL CHARACTERS. Even if you\u0026rsquo;re only two levels behind, your damage and hit rate become so pitiful that you simply won\u0026rsquo;t survive one-on-one, what more two-on-one. The game would\u0026rsquo;ve been 300 times better if either a) story battles had the same level as you; or b) The number of units on each side are comparable. As it is, the only real reliable way to win in battles is through either Coinfeigms or leveling-up. Which wouldn\u0026rsquo;t be so bad except that\u0026hellip;\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLevelling-up is tedious. Since you will almost never meet enemies in the Towers who are at the same level as yours, you\u0026rsquo;re stuck fighting lower level goons while occasionally hitting yourselves for EXP. And not only that\u0026hellip;\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLevelling up Coinfeigms is tedious. Yes it is. The interface is so bad; every time you engrave your coin, you must go back to the top of the list of seals and look for the seal again. Given that you often want to engrave your coins multiple times with the same seals, the game becomes unnecessarily tedious. Adding to this is the \u0026ldquo;random\u0026rdquo; factor involved in engraving. I\u0026rsquo;m sure during development it seemed like a neat concept and all, but in practice all it means is that you have to occasionally save in-between engravings.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDeity/DEV system. Good idea, poor execution. Some of the abilities are simply worthless, and some are strictly better. You will seldom need to change your abilities around. Status-enhancing abilities are generally useless at 10%, slightly better at 25%. Champion sounded cool, except in practice you never want to have anyone with low HP. Furthermore, the system is unbalanced. Sonova people simply suck, despite their HP Bonuses.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNo randomness. All battles are fixed. No hoping to meet an Uribo here, folks, each battle gives you the exact same opponents every time.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe Ugly\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethat sad, sad battle theme. I end up unplugging the audio cord on the TV whenever I play Hoshigami.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAll in all, what went wrong in this game? The thing is that the designers thought people wanted a difficult game, so they made a difficult game. The problem is that they achieve that difficulty through repetitiveness, redundancy and tediousness. On the GameFAQs message boards I read an analogy comparing Hoshigami to Chess. The difference between Hoshigami and Chess is that in Chess, both sides start with the same pieces, and you win or lose based on your own tactical decisions. In Hoshigami, not only does your opponent get more pieces than you, they\u0026rsquo;re all bishops and knights while you\u0026rsquo;re stuck with a platoon of pawns. And you have to play that game of chess some 50 times, without losing, ever.\u003c/p\u003e\n",
            "summary": "First off, I haven\u0026rsquo;t finished the game yet, I\u0026rsquo;m somewhere in Chapter 5. I stopped playing the game a month or so ago out of sheer irritation.\nFor the uninitiated, H:RBE is a tactical RPG for the PSX, released during the last year the PSX. The game is similar in some respects to games like Final Fantasy Tactics and Tactics Ogre, with an emphasis on turn-based squad-level combats. Unlike FFT and TO\u0026rsquo;s similar Active Time system, H:RBE uses a system called RAP, where each character can perform as many actions as he wants provided he still has the RAP gauge to pay for it.",
            "date_published": "2002-05-24T16:00:57+00:00",
            "date_modified": "2021-04-14T04:26:38+08:00",
            "section": "post",
            "source_path": "post/2002/05/hoshigami-ruining-blue-earth/index.md"
            , "tags": ["Gaming","games"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/05/review-hoshigami-ruining-blue-earth.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/05/",
            "url": "https://mirror.roytang.net/2002/05/",
            "path": "/2002/05/",
            "title": "Monthly Archives for 05 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-05-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-05.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/jobless-is-there-even-any-hope/",
            "url": "https://mirror.roytang.net/2002/04/jobless-is-there-even-any-hope/",
            "path": "/2002/04/jobless-is-there-even-any-hope/",
            "title": "Jobless: Is there even any hope?",
            "content_html": "\u003cp\u003eI stood there wordlessly, inching my way through the unending mass of people. There must have been several hundred people crammed into less than two hundred square meters of mall area, interspersed with some twenty cubicles filled with various displays and banners. What madness is this you ask? What product could be so enticing that hundreds of otherwise sane people to participate in such a gathering, jostling for space and risking being elbowed, stepped on or maybe even pick pocketed? The answer was employment. That most important symptom of security that people crave especially in tough times such as these.\u003c/p\u003e\n\u003cp\u003eYes, my friends, it is a job fair. Hopeful job-seekers from all over the capital converge upon this establishment in the commercial district and hope to find gainful opportunities in these otherwise difficult times. I am one of such hopefuls. Weaving amongst the crowd and perusing various company paraphernalia, I search for the perfect job for one of my skills.\u003c/p\u003e\n\u003cp\u003eHere\u0026rsquo;s one, an engineering job, sounds promising. Oh, it\u0026rsquo;s in Bulacan, a good three hours away from home. No thanks. Hmm, there\u0026rsquo;s an opening in this Japanese company. Wait, I already applied for that a couple of months ago. How about a teaching job at some technical college? No thanks, there are better schools out there for me to teach at.\u003c/p\u003e\n\u003cp\u003eI chuckle at my own audacity. For someone who had been unemployed for a good six months now I was being extremely picky. How many job applications had I botched over the past six months? At least three that sounded promising. And for no apparent reason aside from the vague \u0026ldquo;I wouldn\u0026rsquo;t like it there\u0026rdquo; or \u0026ldquo;It\u0026rsquo;s not the right job for me.\u0026rdquo; Sometimes I wonder what it is I really want.\u003c/p\u003e\n\u003cp\u003eOr maybe that\u0026rsquo;s the problem. For someone who spent the last few years of his engineering studies whining about how he should have shifted to another course, I had no real idea about what it was I wanted to do. Well, no practical idea at least. I know I eventually want to work in interactive entertainment software (read: computer games), but that\u0026rsquo;s not really a plausible option right now. Aside from that, nothing. I have no idea where to go or how to get there.\u003c/p\u003e\n\u003cp\u003eI know I need a job. Heaven knows I\u0026rsquo;ve sponged off my folks long enough. But what job? I look at the hordes of people applying for boring, everyday office jobs and I shake my head. I don\u0026rsquo;t want to end up some office drone who can\u0026rsquo;t break out of his routine. I don\u0026rsquo;t want a job that is tedious and boring. I don\u0026rsquo;t want to be some staff engineer doing the same things day in and day out. I want to learn, I want to be challenged, I want to expand my horizons. I want a job that\u0026rsquo;s exciting, constantly unpredictable, a job where being unable to adapt can only cause disaster. I don\u0026rsquo;t want a job that asks me to be tied down for two to three years. I hardly have enough attention span for a semester of classes, how could I stand being in the same job for several years? I don\u0026rsquo;t want a job that\u0026rsquo;s mundane, mediocre or ordinary. I want something different, something exciting, something that amazes people when they ask.\u003c/p\u003e\n\u003cp\u003eMaybe I\u0026rsquo;m being unrealistic or a bit too idealistic, as is common for me at times. But I remember one time when I asked one of the guys I went to college with what he was planning to do after his studies. He said something about joining a big company and rising up the corporate ladder. What kind of dream is that, to be someone else\u0026rsquo;s employee? And this was someone who would later on graduate with honors! I would rather be self-employed, risking my own money on a venture that may or may not succeed. If you fail, then you try again. At least you rise and fall through your own decisions, your fate belongs to you, and not to some anonymous board of directors.\u003c/p\u003e\n\u003cp\u003eAlas, that\u0026rsquo;s not possible for me right now, not when I don\u0026rsquo;t have a shred of cash. And until I do, I am left with little choice but to undergo some mind-numbing mundanity of a job. Gainful employment is a necessary evil for now, so onward I march, ever searching for an ideal job that will tide me through until such time that I find the means to take my destiny into my own hands. My time will come, someday.\u003c/p\u003e\n",
            "summary": "I stood there wordlessly, inching my way through the unending mass of people. There must have been several hundred people crammed into less than two hundred square meters of mall area, interspersed with some twenty cubicles filled with various displays and banners. What madness is this you ask? What product could be so enticing that hundreds of otherwise sane people to participate in such a gathering, jostling for space and risking being elbowed, stepped on or maybe even pick pocketed?",
            "date_published": "2002-04-28T04:00:10+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/04/jobless-is-there-even-any-hope/index.md"
            , "tags": ["Job Hunting"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/04/jobless-is-there-even-any-hope.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/snorks-are-underwater-smurfs/",
            "url": "https://mirror.roytang.net/2002/04/snorks-are-underwater-smurfs/",
            "path": "/2002/04/snorks-are-underwater-smurfs/",
            "title": "Snorks are underwater smurfs.",
            "content_html": "\u003cp\u003eHey, we have cable again! Okay, so we never actually _lost_ cable, but it felt like we had, back when the Star network withdrew its channels from Home Cable around six months ago. Now they\u0026rsquo;re back, which means I once again get to watch Simpsons, Futurama and Whose Line Is It Anyway? =)\u003c/p\u003e\n\u003cp\u003eIn other news, I\u0026rsquo;m still unemployed and cashless. =(\u003c/p\u003e\n",
            "summary": "Hey, we have cable again! Okay, so we never actually _lost_ cable, but it felt like we had, back when the Star network withdrew its channels from Home Cable around six months ago. Now they\u0026rsquo;re back, which means I once again get to watch Simpsons, Futurama and Whose Line Is It Anyway? =)\nIn other news, I\u0026rsquo;m still unemployed and cashless. =(",
            "date_published": "2002-04-20T04:00:33+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/04/snorks-are-underwater-smurfs/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/04/snorks-are-underwater-smurfs.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/someday-well-all-look-back-and-laugh/",
            "url": "https://mirror.roytang.net/2002/04/someday-well-all-look-back-and-laugh/",
            "path": "/2002/04/someday-well-all-look-back-and-laugh/",
            "title": "Someday we'll all look back and laugh.",
            "content_html": "\u003cp\u003eSo the ECE board exams are now over. Six months (okay three) of hard work and preparation (well alright, occasionally glancing at my books) and what do we get? A bunch of questions chosen seemingly at random. The Math and Electronics parts were good enough actually, and I felt pretty confident there. The second day was bad. The Communications exam might as well have been a random set of questions about cookie dough and displacer beasts. Me, Marc and Dennis went through at least a hundred questions in various topics an hour and a half before the exam but not one of the stuff we reviewed came out. Instead we\u0026rsquo;re bombarded with questions about obscure standards and various laws. *Sigh*\u003c/p\u003e\n\u003cp\u003eOr maybe I\u0026rsquo;m just sour-graping because I didn\u0026rsquo;t make the \u003ca href=\"#\"\u003etop ten [link broken]\u003c/a\u003e. Then again I was expecting at least Dennis to make it in, but no such luck. Are there any other UP studes in the top ten? I don\u0026rsquo;t know, and I\u0026rsquo;m not sure I care anymore. Oh well, that\u0026rsquo;s the breaks.\u003c/p\u003e\n\u003cp\u003eI finished \u003ca href=\"http://alexandria.rpgclassics.com/game.php?game=166\"\u003eTales of Phantasia\u003c/a\u003e yesterday, finally. I must\u0026rsquo;ve been playing it for about half a year before I managed to finish it. Emulators are really bad for your attention span — I\u0026rsquo;ve got a Seiken Densetsu game near the end but I haven\u0026rsquo;t touched it for maybe a year now. Anyway, I went and kicked Dhaos butt, even though I wasn\u0026rsquo;t able to complete the better subquests, complete Arche\u0026rsquo;s spells or even get Gremlin and Shadow. Maybe another time. Or if Namco decides to be nice and release it for the PSX. Oh yeah, I put up the ending save state \u003ca href=\"#\"\u003ehere [link broken]\u003c/a\u003e. Hopefully one of these days I can finish the Ranma RPG, SD3 and DQ5, not necessarily in that order.\u003c/p\u003e\n\u003cp\u003eSo I\u0026rsquo;ve been playing Hoshigami lately. When I first bought it and tried it out I thought it was a horrible game. It\u0026rsquo;s quite hard, and you will easily die if you don\u0026rsquo;t know what you\u0026rsquo;re doing. Now I realize the reason I was having such a hard time was because I was trying to play it like FF Tactics or Tactics Ogre. Instead, the RAP gauge encourages an entirely different way of thinking. You have to learn how to conserve your RAP, to know how to use the turn sequence properly, when to shoot and when not to shoot, and when to attempt a session. Granted, knowing all this stuff doesn\u0026rsquo;t make the game that much easier — but I find myself enjoying it once I familiarized myself with the different tactics. Sadly, very few people will be able to appreciate this game. I\u0026rsquo;m in Chapter 2 and I\u0026rsquo;ve already burned 20 hours of game time and probably a lot more in real-time — I tend to lose battles often. =P\u003c/p\u003e\n\u003cp\u003eThe following web sites are graciously hosting some of my fiction, so be nice and visit them: \u003ca href=\"http://www.icybrian.com\"\u003eIcy Brian\u0026rsquo;s RPG Page\u003c/a\u003e and \u003ca href=\"#\"\u003eLaura\u0026rsquo;s Sailor Moon Shrine [link broken]\u003c/a\u003e (although why a SM shrine would have FF fanfiction is beyond me. =)\u003c/p\u003e\n\u003cp\u003eLast week we saw The Count of Monte Cristo. Two more weeks before Spiderman, and a full month before the next Star Wars movie.\u003c/p\u003e\n\u003cp\u003eLastly, and have you ever wondered where you could get \u003ca href=\"#\"\u003eRPG Books online [link broken]\u003c/a\u003e?\u003c/p\u003e\n",
            "summary": "So the ECE board exams are now over. Six months (okay three) of hard work and preparation (well alright, occasionally glancing at my books) and what do we get? A bunch of questions chosen seemingly at random. The Math and Electronics parts were good enough actually, and I felt pretty confident there. The second day was bad. The Communications exam might as well have been a random set of questions about cookie dough and displacer beasts.",
            "date_published": "2002-04-14T05:00:19+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/04/someday-well-all-look-back-and-laugh/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/04/someday-well-all-look-back-and-laugh.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/do-it-to-julia/",
            "url": "https://mirror.roytang.net/2002/04/do-it-to-julia/",
            "path": "/2002/04/do-it-to-julia/",
            "title": "Do it to Julia!",
            "content_html": "\u003cp\u003eFour days before board exam. Will borrow calculator from Switch. Holiday on Monday.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.edsamail.com.ph\"\u003eEdsamail \u003c/a\u003eis no longer free. That sucks, and now I have a new e-mail account: roytang (at) softhome (dot) net.\u003c/p\u003e\n\u003cp\u003eLooks like \u003ca href=\"http://www.thegia.com\"\u003eThe Gaming Intelligence Agency \u003c/a\u003eis really dead.\u003c/p\u003e\n",
            "summary": "Four days before board exam. Will borrow calculator from Switch. Holiday on Monday.\nEdsamail is no longer free. That sucks, and now I have a new e-mail account: roytang (at) softhome (dot) net.\nLooks like The Gaming Intelligence Agency is really dead.",
            "date_published": "2002-04-05T04:00:49+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/04/do-it-to-julia/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/04/do-it-to-julia.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/beavers-and-ducks/",
            "url": "https://mirror.roytang.net/2002/04/beavers-and-ducks/",
            "path": "/2002/04/beavers-and-ducks/",
            "title": "Beavers and Ducks",
            "content_html": "\u003cp\u003eApril Fools day today. The \u003ca href=\"http://www.thegia.com/\"\u003eGaming Intelligence Agency\u003c/a\u003e says they\u0026rsquo;re shutting down, but it\u0026rsquo;s likely one of their famous AFD pranks.\u003c/p\u003e\n\u003cp\u003eBoard exams coming up next week, Tuesday and Wednesday. I need to borrow a calculator — the one I have isn\u0026rsquo;t on their list. I really should study more but for some reason I\u0026rsquo;m really confident. promises to study more\u003c/p\u003e\n\u003cp\u003eSo I applied for a job at \u003ca href=\"http://www.asti.dost.gov.ph/\"\u003eASTI\u003c/a\u003e. Sure it\u0026rsquo;s a government place, but I know a lot of guys there and it looks like fun. Interviewed last week, hope they call back.\u003c/p\u003e\n\u003cp\u003eAnd so another Holy Week went by uneventfully. Another 8-hour 7th heaven marathon. Another trip to St. Vincent\u0026rsquo;s for confession and way of the cross. So the wheel turns.\u003c/p\u003e\n\u003cp\u003eLocal matinee idol Rico Yan dead at 25 last Good Friday. I\u0026rsquo;d tell you more about it, but the TV stations have already covered the story to death.\u003c/p\u003e\n\u003cp\u003eI saw the Star Wars trailer! Lots of fighting, and the Jedis look like they\u0026rsquo;re gonna get their butts whupped. Lousy title though.\u003c/p\u003e\n\u003cp\u003eMovies seen lately: Bandits and Ice Age. Oh, and for the umpteenth time, Austin Powers: TSWSM.\u003c/p\u003e\n\u003cp\u003eRandom Links of the day:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.phoenixgenesis.com/\"\u003ePhoenix Genesis\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "April Fools day today. The Gaming Intelligence Agency says they\u0026rsquo;re shutting down, but it\u0026rsquo;s likely one of their famous AFD pranks.\nBoard exams coming up next week, Tuesday and Wednesday. I need to borrow a calculator — the one I have isn\u0026rsquo;t on their list. I really should study more but for some reason I\u0026rsquo;m really confident. promises to study more\nSo I applied for a job at ASTI. Sure it\u0026rsquo;s a government place, but I know a lot of guys there and it looks like fun.",
            "date_published": "2002-04-01T04:00:11+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/04/beavers-and-ducks/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/04/beavers-and-ducks.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/04/",
            "url": "https://mirror.roytang.net/2002/04/",
            "path": "/2002/04/",
            "title": "Monthly Archives for 04 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-04-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-04.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/03/rant-where-have-all-the-flatmen-gone/",
            "url": "https://mirror.roytang.net/2002/03/rant-where-have-all-the-flatmen-gone/",
            "path": "/2002/03/rant-where-have-all-the-flatmen-gone/",
            "title": "Rant -- Where Have All the Flatmen Gone?",
            "content_html": "\u003cp\u003e(Originally available on the now-defunct NFT Zu website)\u003c/p\u003e\n\u003cp\u003e(2018 Edit: I found this in my WordPress drafts folder, not sure why it wasn\u0026rsquo;t published when I first imported it. It\u0026rsquo;s true it was on my old site, but I can not find a reliable indicator of what date it was published. So I will publish it with an arbitrarily chosen date of March 1, 2002.)\u003c/p\u003e\n\u003cp\u003eOfficially, this rant should be available upon the re-opening of the NFT Zu webpage, version 4.something. As much as I\u0026rsquo;d like to babble on about anime or fanfiction, several of my associates here at the Zu know a lot more about those than I do. So I\u0026rsquo;ll stick to something where I can claim some sort of specialized knowledge: video games.\u003c/p\u003e\n\u003cp\u003eLately, I\u0026rsquo;ve been playing Legend of Mana. It\u0026rsquo;s a little-known Square game for the PSX, the fourth installment in the Seiken Densetsu series of games. It\u0026rsquo;s a quirky little game, but what will strike you most about the game is the amazing graphics. No, I\u0026rsquo;m not talking about FFVIII-style FMVs or such. I\u0026rsquo;m talking about the detailed hand-drawn animations. The characters are portrayed by detailed sprites, the backgrounds are colorful,\u003c/p\u003e\n\u003cp\u003ehand-drawn landscapes, nothing like the mundane realism of FMV-based games. Don\u0026rsquo;t get me wrong, I\u0026rsquo;m not knocking FMV. I certainly appreciate a great CG movie in a game.\u003c/p\u003e\n\u003cp\u003eBut these days practically every game and its mother has FMV, and frankly, I tend to grow tired of it. What\u0026rsquo;s wrong with good ol\u0026rsquo; 2d animation? We see a lot of games pushing the envelope as far as 3d CG FMVs are concerned, but where are the games pushing the envelope of 2d animation? As Legend of Mana and games like Parappa the Rapper show, there are certainly games and stories which are much better told in 2d animation than the mundane 3d videos of today. And for all their technical sophistication, 3d engines are still far more limited than what hand-drawn animation could show us, visions far closer to the artist\u0026rsquo;s\u003c/p\u003e\n\u003cp\u003eimagination.\u003c/p\u003e\n\u003cp\u003eSo where are all the 2d RPGs? Sadly, outside of Square and Capcom, no one seems to be capable of thinking for themselves and differentiating themselves from the pack. In this case the console RPG scene suffers from a common problem: lack of innovation. Aside from a couple of industry leaders, few companies can afford to \u0026ldquo;try something different\u0026rdquo; when they have sales to make. It\u0026rsquo;s far easier to do what everybody else is doing than to try out something which may or may not sell. The 2d RPG seems to be going the way of the handheld, as practically all 2d RPGS these days are being announced for GBA only, with the PS2, XBOX and GC all geared towards powerful 3d apps.\u003c/p\u003e\n\u003cp\u003eGranted, all of this might be chalked up to the fact that I\u0026rsquo;m an old-school gamer of sorts, and you could argue that \u0026ldquo;3d is the wave of the future!\u0026rdquo; But if you look at Legend of Mana, and its younger SNES brother Secret of Mana, you can\u0026rsquo;t help but see how 2d animation has improved by leaps and bounds over the years, albeit unnoticed compared to the attention 3d animation has been getting. Five years ago, all these 3d games were getting noticed because they were bringing us something new, a greater sense of realism than what 2d animation could bring. Back then 3d WAS the wave of the future. Today, it IS the future, and 3d games are the\u003c/p\u003e\n\u003cp\u003enorm, and 2d animation offers us something different, something fresh.\u003c/p\u003e\n\u003cp\u003eWhat am I saying? I want to see more 2d games, RPGs specifically. I want to see more Saga games, more Mana games, more Breath of Fire. I want to see new sprite-based RPGs. I want to see more fantasy worlds that look fantastic, more anime cut-scenes. Is it all too much to ask?\u003c/p\u003e\n\u003cp\u003e-Thinking about getting a GBA before a PS2\u003c/p\u003e\n",
            "summary": "(Originally available on the now-defunct NFT Zu website)\n(2018 Edit: I found this in my WordPress drafts folder, not sure why it wasn\u0026rsquo;t published when I first imported it. It\u0026rsquo;s true it was on my old site, but I can not find a reliable indicator of what date it was published. So I will publish it with an arbitrarily chosen date of March 1, 2002.)\nOfficially, this rant should be available upon the re-opening of the NFT Zu webpage, version 4.",
            "date_published": "2002-03-01T15:06:43+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/03/rant-where-have-all-the-flatmen-gone/index.md"
            , "tags": ["Legacy Blog Posts","Gaming"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/03/",
            "url": "https://mirror.roytang.net/2002/03/",
            "path": "/2002/03/",
            "title": "Monthly Archives for 03 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-03-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-03.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/02/12-feb-2002/",
            "url": "https://mirror.roytang.net/2002/02/12-feb-2002/",
            "path": "/2002/02/12-feb-2002/",
            "title": "12 Feb 2002",
            "content_html": "\u003cp\u003eWebsite updates: New text files in features section!\u003c/p\u003e\n\u003cp\u003eAck\u0026hellip; haven\u0026rsquo;t been doing much lately. My time has been consumed by the evil monster that is Sierra\u0026rsquo;s Betrayal at Krondor. It\u0026rsquo;s an RPG based on Raymond Feist\u0026rsquo;s Riftwar series of books. Haven\u0026rsquo;t read the books myself, but the game is well done, and is still enjoyable despite its age (I think it was released in \u0026lsquo;92 or such). The game was released by Sierra as freeware to promote the sequel, and it can be downloaded at \u003ca href=\"http://www.happypuppy.com\"\u003ehappypuppy.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThe other thing I\u0026rsquo;ve been doing, is trying to catch up on my board exam review, and I\u0026rsquo;m fairly behind schedule. There\u0026rsquo;s around a month and a half left before the exam, but so far I\u0026rsquo;ve only reviewed most of the electronics topics. (The reviews are in 3 parts: electronics, communications and mathematics.)\u003c/p\u003e\n\u003cp\u003eAnother thing I\u0026rsquo;ve been doing was working on my own RPG. The Palefire thing was great, but it seems no one in the group has time to do it anymore. While I still want to do Palefire, it\u0026rsquo;ll have to go to the back burner while everyone gets their acts together. Since I don\u0026rsquo;t have a new comp yet, no RPG programming of any sorts going to take place soon. Right now it\u0026rsquo;s mostly design, world-building, and setting the rules into place. I don\u0026rsquo;t even have a very solid plot yet, but I want to thresh out the world before focusing on the plot. Good luck to me.\u003c/p\u003e\n\u003cp\u003eThings I\u0026rsquo;m not doing: Learning more Japanese (which I promised myself I would do); Studying more programming (same); Writing fiction. I\u0026rsquo;d update the \u003ca href=\"http://www.fanfiction.net/s/566295/1/\"\u003eMecis story\u003c/a\u003e but I found the first part of it severely lacking. When I have time, I\u0026rsquo;ll probably rewrite it altogether.\u003c/p\u003e\n",
            "summary": "Website updates: New text files in features section!\nAck\u0026hellip; haven\u0026rsquo;t been doing much lately. My time has been consumed by the evil monster that is Sierra\u0026rsquo;s Betrayal at Krondor. It\u0026rsquo;s an RPG based on Raymond Feist\u0026rsquo;s Riftwar series of books. Haven\u0026rsquo;t read the books myself, but the game is well done, and is still enjoyable despite its age (I think it was released in \u0026lsquo;92 or such). The game was released by Sierra as freeware to promote the sequel, and it can be downloaded at happypuppy.",
            "date_published": "2002-02-12T04:00:27+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/02/12-feb-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/02/12-feb-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/02/",
            "url": "https://mirror.roytang.net/2002/02/",
            "path": "/2002/02/",
            "title": "Monthly Archives for 02 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-02-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-02.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/final-fantasy-viii-days-of-future-past-part-1/",
            "url": "https://mirror.roytang.net/2002/01/final-fantasy-viii-days-of-future-past-part-1/",
            "path": "/2002/01/final-fantasy-viii-days-of-future-past-part-1/",
            "title": "Final Fantasy VIII: Days of Future Past (Part 1)",
            "content_html": "\u003cp\u003e\u003ca href=\"https://www.fanfiction.net/s/566295/1/Days-of-Future-Past\"\u003eFanfiction.net mirror\u003c/a\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003epart 1\nby Roy Tang (\u003ca href=\"mailto:zroytang@yahoo.com\"\u003ezroytang@yahoo.com\u003c/a\u003e, \u003ca href=\"http://roytang.cjb.net\"\u003ehttp://roytang.cjb.net\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003eDisclaimer: Final Fantasy VIII and all related characters copyright of\nSquaresoft.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u0026ldquo;Woah!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis looked on in awe as she saw her fellow SeeD catapult out of the Lunar Base\nat incredible speed. She looked up to her companions. \u0026ldquo;That\u0026rsquo;s amazing.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eKai simply nodded at her. He had seen all this before, and every time a new SeeD\ncame to watch the launch process the reaction was always the same. He looked at\nthe other SeeD beside him, Mecis\u0026rsquo; \u0026ldquo;special friend\u0026rdquo;, as she put it. Laguna\nHilmark looked on at the launch process in a bored sort of way, as if it was\nnothing out of the ordinary, even though this was his first time at Lunar Gate\nas well. \u0026ldquo;What\u0026rsquo;s up, Laguna?\u0026rdquo; Kai said, \u0026ldquo;It\u0026rsquo;s something, isn\u0026rsquo;t it?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, well,\u0026rdquo; the 21-year old SeeD drawled, \u0026ldquo;I\u0026rsquo;ve seen it before in the training\nsimulations.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eKai smiled. \u0026ldquo;Training isn\u0026rsquo;t much compared to the real thing, kid.\u0026rdquo; Laguna and\nMecis had been SeeDs for little more than three years now, but they had spent\nmost of their time in administrative functions rather than actual combat duty.\nThis was only Mecis\u0026rsquo; second assignment outside of Garden, but Laguna had far\nmore actual combat experience, and he tended to act like nothing surprised him\nanymore.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Next please.\u0026rdquo; The technician handling the launch pods gestured towards them.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Mecis, you\u0026rsquo;re up.\u0026rdquo; Kai gave her a friendly pat on the back. \u0026ldquo;It\u0026rsquo;ll be fine.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Er, yeah\u0026hellip;\u0026rdquo; Mecis said not a bit nervously, \u0026ldquo;It\u0026rsquo;s safe right?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna put an arm around her to reassure her. \u0026ldquo;Don\u0026rsquo;t worry. You\u0026rsquo;ve seen the sims\nright? It\u0026rsquo;ll be over before you know it.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis nodded, and Kai couldn\u0026rsquo;t help but chuckle to himself. He had known these\ntwo since they were cadets at Trabia, being one of their instructors, and he\nknew that Mecis always had a tendency for travel sickness. \u0026lsquo;She should be fine\nif Laguna\u0026rsquo;s with her\u0026rsquo;, he figured.\u003c/p\u003e\n\u003cp\u003eLaguna helped Mecis into the launch capsule. \u0026ldquo;It would help if we could all go\nat once you know,\u0026rdquo; he muttered a bit loudly.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yes, it would, wouldn\u0026rsquo;t it?\u0026rdquo; Kai replied before the technicians could respond.\n\u0026ldquo;It\u0026rsquo;s just your luck that the other launch units are being serviced today. Don\u0026rsquo;t\nworry, you\u0026rsquo;ll be launched right after her.\u0026rdquo; Laguna, Mecis and another SeeD were\nbeing assigned to guard duty at the orbiting Lunar Base, and Kai was there to\nsee them off.\u003c/p\u003e\n\u003cp\u003eLaguna ignored him and turned to Mecis. \u0026ldquo;You\u0026rsquo;ll be fine, okay, I\u0026rsquo;ll be there\nright after you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis smiled back at him, \u0026ldquo;Don\u0026rsquo;t worry about me.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna smiled as well. Stepping down, he closed the hatch and moved away.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Launch error correction, plus 2. Orbital correction, minus 1. Corrections\ncomplete. Commencing launch\u0026hellip;\u0026rdquo; the technicians powered up the launch unit,\n\u0026ldquo;3\u0026hellip;2\u0026hellip;1\u0026hellip;go!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eFor the second time in his life, Laguna witnessed the powerful force of the\nlunar launch unit. Acting as a magic-enhanced catapult, the device propelled\nMecis\u0026rsquo; Launch capsule upwards at a precalclated angle, going at more than twice\nthe escape velocity. The launch generated a powerful wake, and it was several\nseconds before Laguna noticed Kai had said something to him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What?\u0026rdquo; Laguna said to the senior SeeD even as his hearing recovered from the\nmomentary shock.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I said,\u0026rdquo; Kai repeated, \u0026ldquo;This is gonna be the last mission for the two of you,\nisn\u0026rsquo;t it?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna said nothing and looked up at Mecis\u0026rsquo; capsule.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eEverything flashed by.\u003c/p\u003e\n\u003cp\u003eShe felt a bump. Then another. And another. She started to regain her senses,\nand Mecis felt slightly queasy. \u0026ldquo;Why did I agree to this?\u0026rdquo; she thought ruefully\nto herself. The hibernation process initiated at the Lunar Gate prevented her\nfrom moving around, but she was still flly conscious. Finally gathering enough\nstrength to look around, she glanced out the transparent glass hull of her Lunar\nCapsule. Everything was still moving too fast.\u003c/p\u003e\n\u003cp\u003eAnother bump rocked the capsule, and she realized that the bumps were being\ncaused by large energy nets that served to slow the capsule\u0026rsquo;s momentum as it\nhurtled towards the Lunar Base. Another bump, then another. After one more bump,\nshe realzed the capsule\u0026rsquo;s speed was relatively slower now, and that it was in\nfact about to come to a halt.\u003c/p\u003e\n\u003cp\u003eLooking outside, she saw the Lunar Base, a massive space station set into orbit\nby the Esthar government more than a hundred years ago. \u0026ldquo;Amazing,\u0026rdquo; she said to\nherself, \u0026ldquo;It\u0026rsquo;s larger than I thought.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eFour figures dressed in white appeared around her capsule. \u0026ldquo;Astronauts,\u0026rdquo; Mecis\nrealized, as the four figures started to bring her capsule towards the space\nstation. They loaded her capsule into a large machine, some sort of relay device\napparently. The device carted her capsule into the Lunar Base\u0026rsquo;s Dock Area.\u003c/p\u003e\n\u003cp\u003eShe felt a few more bumps, and the next thing she knew, she was inside a large\nhangar-like structure. She heard a faint voice over the transceiver on the\ncapsule.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Initiating quick thaw.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eWith relief, Mecis felt the temperature around her start to increase. Slowly,\nthe numbess vanished from her body, and she was able to move. The capsule hatch\nopened, and she started to step out. As she looked around, she was surprised to\nsee her capsule was suspended off a wall roughly ten meters off the ground.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t worry,\u0026rdquo; she heard a voice, \u0026ldquo;Gravity\u0026rsquo;s off.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis recognized the voice as belonging to Rez, the other SeeD she had met at\nthe mission briefing. Turnin towards him, she saw him floating around,\nsurrounded by several more astronauts.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You okay?\u0026rdquo; Rez asked her. He was a tall, blond-haired guy, probably no more\nthan 20 years old. Mecis didn\u0026rsquo;t know much about him, except that he was from\nGalbadia and that they would be working together at the Lunar Base for the next\nthree months.\u003c/p\u003e\n\u003cp\u003eMecis nodded. \u0026ldquo;Just a bit woozy.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t go seasick now.\u0026rdquo; Rez said cautiously. Mecis smarted at the comment. Kai\nknew she was conscious about her travel sickness, but went ahead and mentioned\nit on the way to Lunar Gate anyway. \u0026ldquo;I\u0026rsquo;m so gonna smack him when we get back,\u0026rdquo;\nshe thought to herself.\u003c/p\u003e\n\u003cp\u003eShe stepped out of the capsule, and felt herself floating in mid-air. \u0026ldquo;It\u0026rsquo;s like\na Float spell,\u0026rdquo; she thought to herself. She recovered her duffel bag from the\ncapsule and floated towards Rez and the astronauts.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What\u0026rsquo;s with the luggage?\u0026rdquo; Mecis asked Rez. Rez was carrying not only the\nstandard SeeD duffel bag, but also an additional backpack he wore over his\nshoulder. It was unusual for SeeDs to carry more than the duffel bag during\nmissions.\u003c/p\u003e\n\u003cp\u003eRez shrugged. \u0026ldquo;I\u0026rsquo;m a heavy packer.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis was about to reply when one of the astronauts spoke. \u0026ldquo;Third capsule\nincoming.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Looks like your boyfriend\u0026rsquo;s coming in.\u0026rdquo; Rez commented. Mecis didn\u0026rsquo;t answer and\njust looked out the transparent glass walls of the hangar. She saw another Lunar\nCapsule come in from the distance, and row upon row of vibrant energy nets\nappeared in front of it. As the Capsule hit each net, it lost a bit of speed,\nuntil if finally slowed to a crawl. The four astronauts loaded the capsule into\nthe waiting relay machine, and she saw how the machine manuevered the capsule\ninto a nearby tube. The capsule shot out and reappeared near where her own\ncapsule was.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Initiating quick thaw.\u0026rdquo; Mecis realized the voice was coming over a loudspeaker.\nShe saw Laguna\u0026rsquo;s capsule glow momentarily before the hatch opened. Laguna\nstepped out, dragging his bag behind him. Unlike Mecis, he quickly adapted to\nthe zero-gravity condition and immediately went over to her.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You okay?\u0026rdquo; Laguna said to her. Mecis detected a bit of fatigue in his voice and\nreplied. \u0026ldquo;I\u0026rsquo;m fine. You look like that trip shook you a bit.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No, I just need a bit of sleep that\u0026rsquo;s all.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis smiled at his reply. Laguna would never admit to being shaken by anything.\u003c/p\u003e\n\u003cp\u003eThey heard Rez call out to them. \u0026ldquo;If you lovebirds are ready, we gotta go see\nthe director.\u0026rdquo; He was already being escorted by a couple of astronauts towards a\nnearby doorway. A couple more astronauts moved towards the pair, motioning them\nto follow.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Let\u0026rsquo;s go,\u0026rdquo; Laguna said to Mecis. The astronauts guided them to the doorway and\ninto another room. The door shut behind them, and the astronauts slowly moved\nthem towards the ground.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Locking gravity.\u0026rdquo; The same voice spoke over the loudspeaker. Mecis felt a\nfeeling of weightedness start to appear around her, similar to how a Float spell\nwore off. She and the others gently landed on the floor.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Gravity lock complete. Welcome to Esthar Lunar Base.\u0026rdquo; The door on the other\nside of the hallway opened and the astronauts motioned them towards it. The\nvoice spoke again, \u0026ldquo;Please follow the right-hand corridor to report to the\nDirector. Thank you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe three SeeDs stepped out into the corridor. It opened into three paths, one\nheading left, one heading right, and a stairway goind up. \u0026ldquo;Well, time waits for\nno one,\u0026rdquo; Rez said as he went down the right-hand hallway. Laguna and Mecis\nfollowed.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u0026ldquo;Check it out!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis was looking out the large glass window in the hallway. The window provided\na clear view of the surrounding space. At a slight distance from the space\nstation, there was a huge circular structure that seemed to be filled with some\nsort of translucent crystal. A humanoid figrue dressed in blue could be seen\ninside the structure.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Man, you get amazed easily, don\u0026rsquo;t you?\u0026rdquo; Rez needled her, \u0026ldquo;That\u0026rsquo;s Rinoa\u0026rsquo;s Tomb.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I know what it is!\u0026rdquo; Mecis shot back, slightly annoyed. Rinoa\u0026rsquo;s Tomb was the\nreason the Esthar Lunar Base was built. Rinoa Heartily, the last sorceress in\nhistorical record, was being kept in suspended animation within the crystal\nprison. Shortly after participating alongside SeeD in the last Sorceress War,\nshe was struck with a fatal disease that was impossible to recover from. Fearing\nthat her death would cause her powers to be passed on to a new, more powerful\nsorceress, she had willfully succumbed to the suspension process. And she had\nremained in this same place for the last hundred years, a grim reminder of the\ndanger posed to the world by the sorceress powers. And a grim reminder of why\nSeeD\u0026rsquo;s vigilance was needed at all times. She had seen pictures of it before of\ncourse, but the view from this close was completely different. One could see\ncompletely into the crystal prison, and Mecis could almost see the expression on\nher face.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;She seems so\u0026hellip;sad.\u0026rdquo;, Mecis said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Sad? What are you talking about? She\u0026rsquo;s a sorceress!\u0026rdquo; Rez retorted.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That\u0026rsquo;s not what I\u0026rsquo;m talking about!\u0026rdquo; Mecis replied. \u0026ldquo;Rumor has it that her lover\nwas a SeeD!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh, please, that\u0026rsquo;s just an urban legend.\u0026rdquo; Rez said. \u0026ldquo;Why would a SeeD become\ninvolved with a sorceress?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna, having had enough of their witty reparte, nudged Mecis. \u0026ldquo;Come on, the\ndirector\u0026rsquo;s waiting.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u0026ldquo;Just three of you this time? Garden\u0026rsquo;s getting overconfident aren\u0026rsquo;t they?\u0026rdquo; Dr.\nKasim was the head of the Lunar Base staff and director of the Sorceress\nResearch project. \u0026ldquo;Or are they too busy fighting other people\u0026rsquo;s wars?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis seethed at the insult. Ever since the last Sorceress had been defeated,\nSeeD had made a name for itself as a powerful mercenary force. The current head\nof Garden, Cid IV had justified it by saying Garden needed the money to maintain\nit\u0026rsquo;s vigilance against the Sorceresses. This, along with SeeD\u0026rsquo;s tendency to\nunfairly prosecute suspected potential Sorceresses had considerably dimmed\nSeeD\u0026rsquo;s reputation worldwide.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That was an unnecessary comme-\u0026rdquo; Mecis was cut off as Laguna nudged her.\u003c/p\u003e\n\u003cp\u003eLaguna saluted the director and spoke. \u0026ldquo;Sir, with all due respect, three SeeDs\nare more than enough to handle any threat that may appear, and Garden\u0026rsquo;s\npeacekeeping operations are all geared towards protecting the peace of the\nworld.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, whatever.\u0026rdquo; The director looked over the assignment sheet Laguna had\nhanded him. \u0026ldquo;Laguna Hilmark. Named after the former president eh?\u0026rdquo; Laguna simply\nnodded. The director picked up a metallic card from his desk and tossed it to\nLaguna.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That\u0026rsquo;s the pass for your quarters, take the elevator further down the hall to\nsub-level III. Dismissed.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna saluted again, and all three SeeDs filed out of the director\u0026rsquo;s room.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Nice guy,\u0026rdquo; Rez muttered, \u0026ldquo;I\u0026rsquo;m so gonna enjoy working for him\u0026hellip;NOT!\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eThe door to the SeeD quarters slid open, and the three of them stepped inside.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Two rooms huh,\u0026rdquo; Rez said, looking around, \u0026ldquo;Will it be guys and girl, or will\nyou two be sharing a room?\u0026rdquo; He grinned at the two mischievously. Laguna shot him\na hard look.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Heh, you said the wrong thing.\u0026rdquo; Mecis said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Garden Code Article 45 Paragraph 12.\u0026rdquo; Laguna recited in a monotone. \u0026ldquo;SeeD\nmembers are forbidden from having relations while on duty.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Sheesh, you\u0026rsquo;re really anal about the rules, aren\u0026rsquo;t you?\u0026rdquo; Rez said, \u0026ldquo;Lighten\nup.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Whatever.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I call this room!\u0026rdquo; Mecis said, entering the bigger bedroom. She put down her\nduffel bag and started to unpack.\u003c/p\u003e\n\u003cp\u003eLaguna shrugged. He went into the other room. It had two bunker-style beds,\nsimilar to those in Garde dormitories. Rez followed, tossed his bags unto the\ntop bed and walked out.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Where are you going?\u0026rdquo; Laguna asked him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m gonna go take a look around.\u0026rdquo; Rez said casually as he walked out of the\nquarters.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t get into any trouble,\u0026rdquo; Laguna called after him as he went on unpacking.\u003c/p\u003e\n\u003cp\u003eMecis stepped into their room after Rez walked out. \u0026ldquo;Isn\u0026rsquo;t he tired? He\u0026rsquo;s okay\nthough, isn\u0026rsquo;t he?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna looked up at her. \u0026ldquo;Yeah, I guess. He\u0026rsquo;s a bit weird though.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you mean?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;ve worked with him before, during the Timber mission. \u0026quot;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Against the Forest Owls?\u0026rdquo; Mecis had heard the story from Laguna before. The\nForest Owls were a revolutionary group led by pro-Sorceress fanatics. Laguna had\nbeen assigned there a year ago to defend Timber after a potential Sorceress was\nrumored to have been found in that area.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah,\u0026rdquo; Laguna nodded, \u0026ldquo;He was kind of a loner and was really quiet, like he\ndidn\u0026rsquo;t like what was going on.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis shrugged. \u0026ldquo;He seems fine to me.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, you should get used to him, we\u0026rsquo;ll all be working together for the next\nthree months.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Laguna\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna hesitated before asking. \u0026ldquo;What?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;After this mission, are we\u0026ndash;?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna sighed. Mecis had wanted to retire from SeeD after this mission. While\nshe was a tough girl, she was physically weak compared to other SeeDs, which was\nwhy she had preferred to take administrative functions during her tour of duty.\nShe was tired of her and Laguna constantly being in danger because they were\nSeeDs, and had wanted to start a peaceful life in her hometown of Winhill.\n\u0026ldquo;Didn\u0026rsquo;t the Headmaster at Trabia invite you to be an instructor?\u0026rdquo; Laguna said to\nher.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, but\u0026hellip;I dunno. I\u0026rsquo;d still be a SeeD.\u0026rdquo; Even as an instructor, SeeDs could\nbe called to combat duty at any time if needed. Mecis sighed, \u0026ldquo;Do you still want\nto\u0026ndash;?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s just that if we quit,\u0026rdquo; Laguna replied, \u0026ldquo;then what would I do?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis smiled. \u0026ldquo;You could be something ordinary. Like a barber!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLaguna shook his head. \u0026ldquo;You\u0026rsquo;re being silly. Tell you what. Let\u0026rsquo;s wait \u0026lsquo;til this\nmission is over. After this one, we\u0026rsquo;ll go on vacation, and we\u0026rsquo;ll decide then,\nokay?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eMecis smiled at him again. A vacation was better than nothing. \u0026ldquo;Okay.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eKai was walking down a hallway in the Tears Point research facility, several\nkilometers from the Lunar Gate. He stopped at a door marked \u0026ldquo;Lunar Observation\nControl\u0026rdquo; and made his way in.\u003c/p\u003e\n\u003cp\u003eThe room was a large array of computers and monitors. Several heads craned to\nlook at him when he entered, and all but one went back to their work after they\ndid not recognize him. Sienna Balmont, commander of SeeD\u0026rsquo;s Dincht division\nresponsible for Esthar, nodded to him. \u0026ldquo;Did the launch go well?\u0026rdquo; she asked.\u003c/p\u003e\n\u003cp\u003eKai nodded back. \u0026ldquo;They\u0026rsquo;re fine. They should be resting up at the Lunar Base by\nnow.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, they\u0026rsquo;re going to need that rest,\u0026rdquo; Sienna muttered.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you mean?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Readings here indicate unusual activity on the surface of the moon over the\npast few weeks. The \u0026lsquo;residents\u0026rsquo; of the moon seem to be converging on a\nparticular spot.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You mean\u0026ndash;?\u0026rdquo; Kai was surprised at what she was implying.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yes. Apparently, the time has come for another Lunar Cry.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eTBC\u003c/p\u003e\n\u003cp\u003eAuthor\u0026rsquo;s Rants:\nWell, this is the first time I\u0026rsquo;ll be doing a multi-part \u0026lsquo;fic, so wish me luck!\nAnyway, I know nothing much happened in this part, but I just wanted to lay the\ngroundwork for some future events. I wanted to include the first major plot\nevent in this one, but after writing the above, I felt it would be a bit too\nlong, so I\u0026rsquo;ll just cut it here. Between the cheesy title and the happenings\nhere, can you guess what this \u0026lsquo;fic will be about? Stay tuned.\nOn a side note, if FF8 is my least favorite FF game, why am I writing about it?\nIt\u0026rsquo;s because the story was so weak I have to supplement it myself, lol. No\noffense to FF8-lovers. =)\nAs always, any comments, corrections, suggestions, e-mail me. Flames, send \u0026lsquo;em\nto \u003ca href=\"mailto:bill@microsoft.com\"\u003ebill@microsoft.com\u003c/a\u003e.\u003c/p\u003e\n",
            "summary": "Fanfiction.net mirror\n part 1 by Roy Tang (zroytang@yahoo.com, http://roytang.cjb.net)\nDisclaimer: Final Fantasy VIII and all related characters copyright of Squaresoft.\n \u0026ldquo;Woah!\u0026rdquo;\nMecis looked on in awe as she saw her fellow SeeD catapult out of the Lunar Base at incredible speed. She looked up to her companions. \u0026ldquo;That\u0026rsquo;s amazing.\u0026rdquo;\nKai simply nodded at her. He had seen all this before, and every time a new SeeD came to watch the launch process the reaction was always the same.",
            "date_published": "2002-01-24T00:00:00+00:00",
            "date_modified": "2019-10-19T04:36:23+08:00",
            "section": "fiction",
            "source_path": "fiction/fanfic/ff8_future_past_01.md"
            , "tags": ["fanfiction"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/12-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/12-jan-2002/",
            "path": "/2002/01/12-jan-2002/",
            "title": "12 Jan 2002",
            "content_html": "\u003cp\u003eUpdates: Added Square NES ROMs, Programming section, updated links. Went back to text-based navigation. While image navigation is nice, it\u0026rsquo;s hard to update and slow-loading. Added links to funtrivia trivia quizzes.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s been a slow couple of days really. Some board reviewing, sporadic Japanese learning. Finished DW7 a couple of nights ago — finally! Currently playing on PS: Ehrgeiz Quest Mode! Kinda tough, tho. For the NES, a discussion on FFFade me download a whole bunch of Square NES ROMs! Also been playing a lot of Megaman! (finished 1 and 2 already, on my way with 3) Job fair next week atUP Eng\u0026rsquo;g. Also came down with a bad cold.\u003c/p\u003e\n",
            "summary": "Updates: Added Square NES ROMs, Programming section, updated links. Went back to text-based navigation. While image navigation is nice, it\u0026rsquo;s hard to update and slow-loading. Added links to funtrivia trivia quizzes.\nIt\u0026rsquo;s been a slow couple of days really. Some board reviewing, sporadic Japanese learning. Finished DW7 a couple of nights ago — finally! Currently playing on PS: Ehrgeiz Quest Mode! Kinda tough, tho. For the NES, a discussion on FFFade me download a whole bunch of Square NES ROMs!",
            "date_published": "2002-01-12T04:00:19+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/01/12-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/12-jan-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/07-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/07-jan-2002/",
            "path": "/2002/01/07-jan-2002/",
            "title": "07 Jan 2002",
            "content_html": "\u003cp\u003eFor some reason, I keep wanting to update this site. I\u0026rsquo;m actually doing this more often than studying for the board, studying game development, studying Japanese or writing anything else. I wonder why? Anyway, I added a humor page and a special \u0026ldquo;Who Am I?\u0026rdquo; page. Check \u0026lsquo;em out. Also the Anime ROMs site should be fully operational by now.\u003c/p\u003e\n\u003cp\u003eSo I went and saw Lord of the Rings last Friday. As everyone expected, it was an excellent movie, and the theater was jam packed. We had to use all our mighty skills to get seats. Even my first brother, who doesn\u0026rsquo;t normally watch movies, enjoyed it and said it was great. My only complaint is that the movie is too long! I mean, I know Tolkien created a huge world and all, but did they really have to show the party traveling through numerous forests, mountains and snow without advancing the plot? That\u0026rsquo;s one of the reasons I didn\u0026rsquo;t get to finish the book, I felt the plot dragged along in favor of the lengthy descriptions. The movie does this too, but to a lesser extent.\u003c/p\u003e\n",
            "summary": "For some reason, I keep wanting to update this site. I\u0026rsquo;m actually doing this more often than studying for the board, studying game development, studying Japanese or writing anything else. I wonder why? Anyway, I added a humor page and a special \u0026ldquo;Who Am I?\u0026rdquo; page. Check \u0026lsquo;em out. Also the Anime ROMs site should be fully operational by now.\nSo I went and saw Lord of the Rings last Friday.",
            "date_published": "2002-01-07T04:00:30+00:00",
            "date_modified": "2021-04-02T11:01:07+08:00",
            "section": "post",
            "source_path": "post/2002/01/07-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts","Movies","Pop Culture"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/07-jan-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/06-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/06-jan-2002/",
            "path": "/2002/01/06-jan-2002/",
            "title": "06 Jan 2002",
            "content_html": "\u003cp\u003eHopefully, the site is now Netscape-safe\u0026hellip;\u003c/p\u003e\n\u003cp\u003eUploaded more stuff today: I put up an ECE Board Exam Reviewer — it\u0026rsquo;s a software that helps me review for the upcoming ECE boards. It\u0026rsquo;s in the files section. I really should add that to the list of resolutions: WILL STUDY FOR BOARD EXAM!\u003c/p\u003e\n\u003cp\u003eI also decided to renovate and re-use the \u003ca href=\"http://www.geocities.com/zroytang\"\u003egeocities site\u003c/a\u003e so I put up an Anime ROMs site there. I wanted to put up the Anime ROMs before, but I was worried about what Topcities might do, since Ihaven\u0026rsquo;t heard anything about what they do to copyright violations on member sites. They might delete all my files or something. At Geocities, the worst case scenario is that I lose the ROM files!\u003c/p\u003e\n\u003cp\u003eSore wa watashi no homupeiju desu\u0026hellip; See? I\u0026rsquo;m working on it!\u003c/p\u003e\n",
            "summary": "Hopefully, the site is now Netscape-safe\u0026hellip;\nUploaded more stuff today: I put up an ECE Board Exam Reviewer — it\u0026rsquo;s a software that helps me review for the upcoming ECE boards. It\u0026rsquo;s in the files section. I really should add that to the list of resolutions: WILL STUDY FOR BOARD EXAM!\nI also decided to renovate and re-use the geocities site so I put up an Anime ROMs site there. I wanted to put up the Anime ROMs before, but I was worried about what Topcities might do, since Ihaven\u0026rsquo;t heard anything about what they do to copyright violations on member sites.",
            "date_published": "2002-01-06T04:00:28+00:00",
            "date_modified": "2019-09-21T19:59:59+08:00",
            "section": "post",
            "source_path": "post/2002/01/06-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/06-jan-2002.html"}]
            
            , "comments": [
                { 
                    "url": "",
                    "source_file": "comment-20051110075500-wp-Anonymous.json"
                }, { 
                    "url": "",
                    "source_file": "comment-20060805142505-wp-lenard.json"
                }, { 
                    "url": "https://roytang.net/",
                    "source_file": "comment-20060805223716-wp-Roy.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/04-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/04-jan-2002/",
            "path": "/2002/01/04-jan-2002/",
            "title": "04 Jan 2002",
            "content_html": "\u003cp\u003eWell\u0026hellip; you learn something new everyday! And today I learned that Netscape is very strict about HTML coding. Unclosed tags will screw up even the simplest of web pages! Spent quite some time rewriting the HTML to be Netscape friendly\u0026hellip;\u003c/p\u003e\n",
            "summary": "Well\u0026hellip; you learn something new everyday! And today I learned that Netscape is very strict about HTML coding. Unclosed tags will screw up even the simplest of web pages! Spent quite some time rewriting the HTML to be Netscape friendly\u0026hellip;",
            "date_published": "2002-01-04T04:00:37+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/01/04-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/04-jan-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/03-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/03-jan-2002/",
            "path": "/2002/01/03-jan-2002/",
            "title": "03 Jan 2002",
            "content_html": "\u003cp\u003eChanged the layout even more! Added a start page containing the menu only, so that visitors wouldn\u0026rsquo;t have to listen to me ranting all the time. Uploaded some stuff, since my COMPUTER IS PROBABLY GOING TO DIE SOON! It\u0026rsquo;s on its last legs\u0026hellip; I can feel it. Over the next couple of days I\u0026rsquo;ll probably be uploading stuff that I don\u0026rsquo;t have backed up elsewhere. For now the only new upload is a bunch of high school pics. See the Files section for more.\u003c/p\u003e\n\u003cp\u003eTowards my resolutions:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eI went on over to FF.net to see if the last fic (\u003ca href=\"http://www.fanfiction.net/s/447644/1/\"\u003eNobody Wants to Live Forever\u003c/a\u003e) got any reviews. Whee! Got some positive ones. I\u0026rsquo;ll try to write more soon.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eI downloaded a free Win32 C++ compiler+GUI. It\u0026rsquo;s Dev-C++, available at \u003ca href=\"http://www.bloodshed.com\"\u003eBloodshed Software\u003c/a\u003e. Also, I downloaded some of the old Win32 programming lessons from ReliSoft. I\u0026rsquo;ll probably redo all the work since my previous trials had been lost in an HD formatting a while back. The sad thing is that the DirectX SDKs are unbelievably huge, 100+ Megs, even the older DX5.0, so I probably won\u0026rsquo;t be doing any DX programming \u0026lsquo;til I get a new computer.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearning Japanese? Well\u0026hellip; I\u0026rsquo;m working on it I guess. I checked out some lessons at \u003ca href=\"http://www.japanese-online.com\"\u003eJapanese-Online.com\u003c/a\u003e. I\u0026rsquo;ve gone through them before, but I didn\u0026rsquo;t really follow through so I forgot. =)\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnything else? Okay:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eTurns out another Square SNES game has been gifted with a translation patch! The game is Live-a-Live, a strange sort of RPG. I tried it out a bit, but now I\u0026rsquo;m stuck. =( It\u0026rsquo;s really weird. Hulk Hogan appears in it! Except that he\u0026rsquo;s named MaxBomber or something.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMore new links:\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"http://www.htmlgoodies.com\"\u003eHTML Goodies\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ehas a lot of info for would-be webmasters.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.happyhacker.org\"\u003eHappy Hacker\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eteaches you some neat hacking tricks, all of \u0026lsquo;em legal!\u003c/p\u003e\n",
            "summary": "Changed the layout even more! Added a start page containing the menu only, so that visitors wouldn\u0026rsquo;t have to listen to me ranting all the time. Uploaded some stuff, since my COMPUTER IS PROBABLY GOING TO DIE SOON! It\u0026rsquo;s on its last legs\u0026hellip; I can feel it. Over the next couple of days I\u0026rsquo;ll probably be uploading stuff that I don\u0026rsquo;t have backed up elsewhere. For now the only new upload is a bunch of high school pics.",
            "date_published": "2002-01-03T04:00:52+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/01/03-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/03-jan-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/01-jan-2002/",
            "url": "https://mirror.roytang.net/2002/01/01-jan-2002/",
            "path": "/2002/01/01-jan-2002/",
            "title": "01 Jan 2002",
            "content_html": "\u003cp\u003eNew Year\u0026rsquo;s Resolutions:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWrite more. Fanfiction, original works, whatnot. I need to shape up my writing skills.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDevote more time to game development. My interest sort of waned after a certain group project I was on fizzled out, but I\u0026rsquo;m gonna get back on track.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n",
            "summary": "New Year\u0026rsquo;s Resolutions:\n  Write more. Fanfiction, original works, whatnot. I need to shape up my writing skills.\n  Devote more time to game development. My interest sort of waned after a certain group project I was on fizzled out, but I\u0026rsquo;m gonna get back on track.\n  ",
            "date_published": "2002-01-01T04:00:05+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2002/01/01-jan-2002/index.md"
            , "tags": ["Legacy Blog Posts"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2002/01/01-jan-2002.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/01/",
            "url": "https://mirror.roytang.net/2002/01/",
            "path": "/2002/01/",
            "title": "Monthly Archives for 01 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-01-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2002-01.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2002/",
            "url": "https://mirror.roytang.net/2002/",
            "path": "/2002/",
            "title": "Yearly Archives for 2002",
            "content_html": "",
            "summary": "",
            "date_published": "2002-01-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archy",
            "source_path": "archy/2002.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2001/11/final-fantasy-ix-nobody-wants-to-live-forever/",
            "url": "https://mirror.roytang.net/2001/11/final-fantasy-ix-nobody-wants-to-live-forever/",
            "path": "/2001/11/final-fantasy-ix-nobody-wants-to-live-forever/",
            "title": "Final Fantasy IX: Nobody Wants To Live Forever",
            "content_html": "\u003cp\u003e\u003ca href=\"https://www.fanfiction.net/s/447644/1/Nobody-Wants-to-Live-Forever\"\u003eFanfiction.net mirror\u003c/a\u003e | \u003ca href=\"https://www.fanfiction.net/r/447644/\"\u003eFanfiction.net reviews\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNobody Wants to Live Forever\u003c/p\u003e\n\u003cp\u003eby Roy Tang (\u003ca href=\"mailto:zroytang@yahoo.com\"\u003ezroytang@yahoo.com\u003c/a\u003e / royness.vze.com)\u003c/p\u003e\n\u003cp\u003eFinal Fantasy IX is a copyright of Squaresoft, Inc. Standard disclaimers apply.\nFinal Fantasy IX spoilers, all the way baby!\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eMy name is Vivi Ornitier.\u003c/p\u003e\n\u003cp\u003eI am a black mage.\u003c/p\u003e\n\u003cp\u003eThat is to say, I can call upon elemental forces to weave powerful magical\nspells of destruction. Which is often quite handy, especially when facing a\nlarge group of plant-like creatures that can tear me apart with their limbs or\npetrify me with a single drop of their saliva.\u003c/p\u003e\n\u003cp\u003eA simple flick of my wrist and a small burst of concentration is all it takes,\nand three of the plant-creatures explode into ice shards. Six more appear to\nreplace the fallen ones. I had hoped I would never have to use these powers\nagain. Fate seemed to have a different opinion.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eDenial.\u003c/p\u003e\n\u003cp\u003eFreya walked silently along the street of Treno. She wouldn\u0026rsquo;t be able to come\nback here for a while, with all the events over in Burmecia. So she wanted to\ntake one last stroll before she took the ride to Lindblum. The moon cast a pale\nglow over Treno at this time of day. Strange that for a city that never\nsleeps, it looks its brightest when the moon is full.\u003c/p\u003e\n\u003cp\u003eFreya stopped at the stairway leading to the street near Dr. Tot\u0026rsquo;s house. A lone\nfigure was sitting at the landing on top of walkway. Recognizing the hat, Freya\nwalked up and sat down beside him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey, what\u0026rsquo;s wrong?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe figure gave a start, apparently noticing Freya for the first time.\n\u0026ldquo;Oh\u0026hellip; I\u0026hellip; well\u0026hellip; it\u0026rsquo;s nothing, I guess\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Did you visit Dr. Tot?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Y-yeah. He wanted to see me that\u0026rsquo;s all.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You sure there\u0026rsquo;s nothing wrong?\u0026rdquo; Freya made a worried face at her friend. \u0026ldquo;I\u0026rsquo;ve\nbeen hearing some rumors from the village.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No, I\u0026hellip; it\u0026rsquo;s nothing.\u0026rdquo; He got up. \u0026ldquo;Sorry, I promised Eiko I\u0026rsquo;d teach her how to\nbid at the auction today.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eFreya nodded, and the little guy ran off with his unusual stride. A faint\nscreeching sound echoed in the distance and Freya recognized it as the familiar\nhum of the railway cars.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Guess that\u0026rsquo;s my ride,\u0026rdquo; she said to no one in particular.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u0026ldquo;Vivi, behind you!\u0026rdquo; The voice belonged to Blank, one of the Tantalus Crew. He\u0026rsquo;s\na nice guy, always looking out for other people. It\u0026rsquo;s a good thing he\u0026rsquo;s looking\nout for me right now, as I spin around to see a giant green tentacle about to\nslam down on me. As he jumped up to take on the offending vegetable, I threw a\nquick bolt of lightning at his sword, and his enchanted blade took the target\ndown in one blow.\u003c/p\u003e\n\u003cp\u003eI hate fighting, but I\u0026rsquo;m glad I decided to come along with the Tantalus. Back\nhere, to where it all began. For me and my brothers at least, although we can\u0026rsquo;t\nsay we were born here, this is where our souls came from. The excuses we have\nfor souls at least.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Come on, we\u0026rsquo;re almost there!\u0026rdquo; That\u0026rsquo;s Marcus, another one of the Tantalus Crew.\nI pointed a finger, and a large ball of flame exploded against the plant walls\nbefore us, opening the way deeper into the maze of plant-life that was the Iifa\nTree. Or what remained of it anyway.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eBargaining.\u003c/p\u003e\n\u003cp\u003eHe looked up at the avian doctor. He knew it would come eventually, but to hear\nsomeone say it was an entirely different matter all together.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Doctor Tot\u0026hellip;are you sure\u0026hellip;\u0026rdquo; His high-pitched voice trailed off. \u0026ldquo;There must\nbe something you can do.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eDoctor Tot sighed. He always hated to be the bearer of bad news. He adjusted his\nspectacles and looked at the young man with sadness in his eyes.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry\u0026hellip;I\u0026rsquo;ll conduct some more tests with the samples I took but\u0026hellip; I can\u0026rsquo;t\npromise anything.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What about the other tests? Didn\u0026rsquo;t you find anything?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I haven\u0026rsquo;t had enough time to complete the other tests, I\u0026rsquo;m afraid\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Doctor\u0026hellip; please\u0026hellip;\u0026rdquo; Tot could here the desperation in his voice. \u0026ldquo;There has to\nbe something\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry. We all knew this would happen, sooner or later.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No\u0026hellip; This can\u0026rsquo;t be\u0026hellip; not now\u0026hellip; I\u0026hellip;\u0026rdquo; He couldn\u0026rsquo;t find the strength to gather\nhis thoughts. \u0026ldquo;I\u0026rsquo;m sorry Doctor.\u0026rdquo; He ran off without another word.\u003c/p\u003e\n\u003cp\u003eDoctor Tot closed his eyes, adjusted his spectacles and grimaced. He hated being\nthe bearer of bad news.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAnother wall breaks down, and we rush forward, stopping suddenly at the edge of\nwhat seemed to be a deep semicircular crevice with walls made of green foliage.\nAs if on cue, twigs, branches and leaves gave way inside the crevice, revealing\nnumerous spider-like plant-creatures, the same ones we\u0026rsquo;d encountered before.\u003c/p\u003e\n\u003cp\u003eThe Tantalus Crew almost cringed at the sight of these hordes, but their\nattention was drawn by Marcus\u0026rsquo; outstretched hand. \u0026ldquo;Over there!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eNear the center of the crevice, two human like figures lay on the ground,\nunmoving, and right at the base of the Iifa Tree. Without hesitation, we make\nour way across the valley of beasts. I provide covering fire as Blank and Cinna\nmake their way toward the two figures.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Just as I thought,\u0026rdquo; Blank says, \u0026ldquo;It\u0026rsquo;s the same thing as the petrified forest.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eCinna inspects the first body. \u0026ldquo;This one\u0026rsquo;s dead. Looks like he\u0026rsquo;s been this way\nfor weeks.\u0026rdquo; Marcus and I turn to look at the body, and heave a sigh of relief\nwhen it\u0026rsquo;s not the one we\u0026rsquo;re looking for.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Must\u0026rsquo;ve been Kuja. Poor sap,\u0026rdquo; Blank said. But our attention was already held by\nthe other figure, a somewhat short humanoid form, encased in stone.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Zidane.\u0026rdquo; I manage to say.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAnger.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ouch!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eEiko had been one her way to Doctor Tot\u0026rsquo;s residence when she collided with a\nsmall figure apparently in a hurry. Apparently, the other one was as surprised\nas she was, as both of them were knocked back a bit by the collision.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Watch where you\u0026rsquo;re\u0026ndash;\u0026rdquo; Eiko looked at the one she had bumped into. \u0026ldquo;Vivi?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eVivi dusted himself off and looked at the young summoner. \u0026ldquo;Oh, hi Eiko. Excuse\nme, I\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey!\u0026rdquo; Eiko said, grabbing Vivi\u0026rsquo;s arm before he could dash off, \u0026ldquo;Where do you\nthink you\u0026rsquo;re going? I\u0026rsquo;ve been looking all over for you! You made me wait up at\nthe auc\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eEiko was surprised to be cut off as Vivi shook off her hand. \u0026ldquo;Sorry, Eiko, but I\ndon\u0026rsquo;t have time for this right now, okay?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? Is there a problem? Some sort of emergency?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Problem? Of course not!\u0026rdquo; Eiko was astonished to hear a hint of sarcasm in\nVivi\u0026rsquo;s voice, a tone she\u0026rsquo;d never heard from the black mage before. \u0026ldquo;The world is\nsafe remember? We went out and saved the world! Why should there be a problem?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Vivi, what are you\u0026ndash;?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;We went all the way to a different world, faced the spirit of destruction, and\nthat\u0026hellip; that monkey Kuja is dead!\u0026rdquo; Vivi\u0026rsquo;s voice was completely different from his\nusual shy tone, even though his featureless face revealed nothing. \u0026ldquo;Everything\nshould be great! Everyone should be happy!\u0026rdquo; Vivi shook his hands around him in\nfrustration. Eiko noticed sparks starting to form around her erstwhile friend.\nPeople had started to stop and stare at the ranting little boy.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Vivi, I think you should calm down.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Calm down? Look at what\u0026rsquo;s happened to us! The princess hasn\u0026rsquo;t spoken to anyone\nsince Zidane\u0026hellip;\u0026rdquo; Vivi\u0026rsquo;s voice trailed off, \u0026ldquo;And now I\u0026hellip;I\u0026hellip;\u0026rdquo; Tendrils of energy\nstarted to twirl around his cone-shaped hat, totally unnoticed by the now\nranting mage. \u0026ldquo;We went out and gave everything for everyone! It shouldn\u0026rsquo;t be\nlike this!\u0026rdquo; The ground around Vivi suddenly burst into an explosion of flames.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Aaah!!!\u0026rdquo; Eiko was knocked off her feet and was thrown to the nearby wall.\n\u0026ldquo;Ou\u0026ndash;ch!!!\u0026rdquo; The nearby townspeople were forced back by the sudden blaze. Despite\nall the events that had happened lately, exploding flames were never a good\nthing.\u003c/p\u003e\n\u003cp\u003eVivi stopped and noticed the flames swirling around him. \u0026ldquo;Wha\u0026ndash;? Oh no!\u0026rdquo; He\nturned to see a slightly scorched Eiko trying to stand up. He looked down at his\nown hands to see traces of the flames still lingering on his gloves. \u0026ldquo;Eiko, I\u0026ndash;\u0026rdquo;\nNot knowing what to say, Vivi ran off.\u003c/p\u003e\n\u003cp\u003eEiko heard footsteps behind her and turned to see Doctor Tot approaching from\nhis residence. The doctor adjusted his spectacles, and turned to help Eiko get\nup. \u0026ldquo;What happened here?\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eWe\u0026rsquo;re running now, as hard and as fast as we can. As soon as the Supersoft had\ntaken effect, a large bulbous head had appeared from the Iifa Tree, as if\ndefending it\u0026rsquo;s home from a robbery. Marcus had taken the unconscious Zidane over\nhis shoulders, and we made our way back to daylight. By the time we reached the\nTantalus, I was exhausted, and nearly drained of my power. The Benero brothers\nwaved us on board, and the engines roared to life.\u003c/p\u003e\n\u003cp\u003eRight behind us however, the mass of tentacles at the base of the Iifa Tree\nstarted to move. They shot out, with the bulbous head just behind them, as if\nordering them to prevent our escape. I drew upon my last remaining reserves and\ntried to hold them off.\u003c/p\u003e\n\u003cp\u003eBaku ordered the liftoff, and the Tantalus took to the air. Three tentacles shot\nout, two of them latching onto the Tantalus\u0026rsquo; bow, the other onto the tail. More\ntentacles came out as the ship was swung around.\u003c/p\u003e\n\u003cp\u003eBaku came out armed now, \u0026ldquo;The ship\u0026rsquo;ll break apart if this goes on!\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eDespair.\u003c/p\u003e\n\u003cp\u003eAmarant nodded grimly to the guard as the gate closed behind him. He hefted his\npack over his left shoulder, and looked towards the station. The night was\nyoung, and he had a long way to go.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Mr. Amarant?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAmarant turned around at the high-pitched voice. It\u0026rsquo;s the kid, he thought to\nhimself. The \u0026ldquo;kid\u0026rdquo; was seated on a small knoll just outside of the Treno city\ngate. Judging from the dew gathering around his hat, he\u0026rsquo;d been there for a\nwhile.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Are you leaving too?\u0026rdquo; He heard the kid say the words, but he couldn\u0026rsquo;t see how\nhe spoke. Not that it mattered. Amarant was never one to try to figure\neverything out.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah. I still got some \u0026lsquo;unfinished business\u0026rsquo; elsewhere.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh. I see. Everyone\u0026rsquo;s leaving then\u0026hellip;\u0026rdquo; The kid\u0026rsquo;s voice trailed off with a\nfamiliar tone.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah. You\u0026rsquo;re the last one left. Still got business with the doc?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well\u0026hellip; I\u0026hellip;\u0026rdquo; His bright eyes seemed to affix themselves to the ground.\u003c/p\u003e\n\u003cp\u003eAmarant grunted. \u0026ldquo;Guess what the brat told me was true, huh?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;B-brat?\u0026rdquo; The kid looked up, \u0026ldquo;You mean Eiko?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah. She kept pestering me about cheerin\u0026rsquo; you up.\u0026rdquo; Amarant turned to go. \u0026ldquo;Not\nthat I care, mind you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAmarant took a couple of steps, then, as if changing his mind, stopped in\nmid-stride. \u0026ldquo;You wanna live forever, kid?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;W-what?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAmarant went on without turning around. \u0026ldquo;Everybody goes sometime you know.\nYou\u0026rsquo;re luckier than most, \u0026lsquo;coz you know when to expect it. But people like me,\nthat brat, even that goof-off knight or that guard by the gate, we have no idea.\nWe could be dead tomorrow for all we know.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;M-Mr. Amarant\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;But you don\u0026rsquo;t see us sittin\u0026rsquo; on a hill wonderin\u0026rsquo; why we gotta die, do you?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;If you think sitting there feeling sorry for yourself is the best you can do,\ngo ahead. But the rest of us, we go ahead, and do whatever it is we do, even if\nwe die the next day. I don\u0026rsquo;t know what you believe in, but that\u0026rsquo;s gotta be\nbetter than moping around.\u0026rdquo; Amarant started to walk off again. \u0026ldquo;\u0026lsquo;Sides kid,\nnobody wants to live forever.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eVivi looked at Amarant\u0026rsquo;s departing figure and considered the mercenary\u0026rsquo;s words.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eBlank shouted something to his companions as he tried to keep the ship steady. I\ncouldn\u0026rsquo;t hear above the noise of the battle. Baku, Marcus and Cinna came\nforward. Cinna took the helm, and the others tried to hack off the offending\nplants. It was no use however, we couldn\u0026rsquo;t break free. It seemed like the more\nwe fought, the more tentacles appeared. And we were too tired to go on.\u003c/p\u003e\n\u003cp\u003eZidane, awakened by the violent assault, got to his feet groggily. \u0026ldquo;What\u0026rsquo;s going\non?\u0026rdquo; he asked as he held on to Cinna for balance. Cinna told him to stay down,\nbut Zidane, quickly taking stock of the situation, drew a dagger from Cinna\u0026rsquo;s\nbelt. \u0026ldquo;I\u0026rsquo;m not gonna go without a fight,\u0026rdquo; he said, \u0026ldquo;If Tantalus goes down, we\nall go down!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eDown below, the giant bulbous head looked up at us, as if taunting us. \u0026ldquo;There is\nno escape.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAcceptance.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I don\u0026rsquo;t think you should come with us, little guy.\u0026rdquo; Baku looked down at the\nsmall figure beside him as the crew loaded their gear unto his ship.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;B-but, Mr. Baku\u0026hellip;I really want to help.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I know that, kid, but\u0026hellip;it\u0026rsquo;s a Tantalus thing, you know?\u0026rdquo; Baku smiled grimly.\n\u0026ldquo;We\u0026rsquo;re the ones who gotta go after that idiot.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What\u0026rsquo;s up Boss?\u0026rdquo; Blank walked up to the pair, slightly sweaty from the day\u0026rsquo;s\nwork.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t what\u0026rsquo;s up me, how\u0026rsquo;s the loading?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s fine. Everything oughta be finished by dusk. Heya Vivi.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe diminutive black mage nodded, adjusted his hat, and decided to convince\nBlank instead. \u0026ldquo;Please let me come with you Blank!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? It\u0026rsquo;s gonna be pretty dangerous, y\u0026rsquo;know.\u0026rdquo; Blank said, as if uncertain.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That\u0026rsquo;s what I keep tellin\u0026rsquo; the kid,\u0026rdquo; Baku agreed, before going to look over the\nloading process.\u003c/p\u003e\n\u003cp\u003eBlank turned to Vivi. \u0026ldquo;You really want to find him don\u0026rsquo;t you?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Please Blank, it\u0026rsquo;s the least I can do for him,\u0026rdquo; Vivi pleaded. \u0026ldquo;He\u0026rsquo;s done so\nmuch for me, for all of us! I, I\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBlank smiled and crouched down beside the black mage. \u0026ldquo;To be honest, I don\u0026rsquo;t\nthink we can do it by ourselves.\u0026rdquo; He looked over at Baku\u0026rsquo;s hulking form. \u0026ldquo;Didn\u0026rsquo;t\nwant to mention it in front of the boss, though.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Then will you\u0026ndash;?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBlank shook his head, and Vivi\u0026rsquo;s eyes showed signs of disappointment. \u0026ldquo;The\nBoss\u0026rsquo;d never agree. Sorry Vivi, gotta keep packin\u0026rsquo;. See those crates over\nthere.\u0026rdquo; Vivi looked over to where he pointed and saw several large wooden\ncrates. \u0026ldquo;I still gotta load those, but I don\u0026rsquo;t know why we\u0026rsquo;re usin\u0026rsquo; such large\ncrates.\u0026rdquo; He smiled at Vivi again. \u0026ldquo;Probably enough space in those crates to fit\na small person, you know what I mean?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eVivi looked up, a surprised look in his eyes, and nodded gratefully.\u003c/p\u003e\n\u003cp\u003eBlank stood up. \u0026ldquo;I think I\u0026rsquo;ll talk to the boss for a bit before packing those\ncrates.\u0026rdquo; He winked at Vivi and turned to go.\u003c/p\u003e\n\u003cp\u003eBaku looked over his shoulder as Blank came to stand beside him. \u0026ldquo;Did you\nconvince him?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, I told him you\u0026rsquo;d never agree.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Poor kid. You hear about the thing from Doctor Tot?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBlank nodded at his boss. \u0026ldquo;Perfectly understandable why he wants to come\nthough.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, I guess.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Wouldn\u0026rsquo;t you do the same thing in his position?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBaku grunted and shouted to his men. \u0026ldquo;Hurry it up, we gotta schedule to keep! We\ngotta play in Alexandria in a week, Iifa Tree or no Iifa Tree!\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAll these thoughts flashed back through my head as Zidane spoke his words. We\nwere almost gonna now, the Tantalus was about to be broken in half. Only a\nmiracle could get us out. In desperation Blank went to the side of the airship\nand looked down at the ominous plant core.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Blank!\u0026rdquo; Marcus said, \u0026ldquo;What are you thinking?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s just like the Evil Forest Marcus!\u0026rdquo; Blank shouted as he fended off the\nattacking tentacles. \u0026ldquo;These plants\u0026rsquo;ll die down once the core is dead!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t be an idiot!\u0026rdquo; Baku shouted, grabbing Blank back from the ship\u0026rsquo;s railings.\n\u0026ldquo;You won\u0026rsquo;t last two seconds out there!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;All of us are gonna die at this rate!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBaku and Blank\u0026rsquo;s voices faded out of my head as they kept arguing. I knew Blank\nwas right. The ship wouldn\u0026rsquo;t hold much longer, and all of our lives were now\nthreatened. Zidane. Baku. Blank. Marcus. Cinna. Benero. Zenero. Genero. And me.\u003c/p\u003e\n\u003cp\u003eIn the end, there was no choice, really. One dying soul in exchange for eight\nothers to live. After all, nobody wants to live forever.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Zidane!\u0026rdquo; I turned to him as I started to gather the last of my energies. This\nman had taught me to appreciate who I was, to enjoy life, and to give all of\nmyself for what I believe in, and today, I was proud to give myself for him.\n\u0026ldquo;Please make the princess happy!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? Vivi!\u0026rdquo; I could hear Zidane\u0026rsquo;s shout as I ran to the edge of the ship and\ndived towards the core, that green bulbous plant that had threatened our lives.\nI felt the power coalesce around me as I hurtled downward, dark energies from\nbeyond this world gathering around my fingertips.\u003c/p\u003e\n\u003cp\u003eI came to this world spawned from this tree, and today I return to it.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Doomsday!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e-fin-\u003c/p\u003e\n\u003cp\u003eAuthor\u0026rsquo;s rants: Ye gods, the last semester of college really took a lot of wind\nout of me, I think. I\u0026rsquo;m exhausted now, maybe because I decided to do half of\nthis all in one sitting. Which would explain why some parts might look like they\nwere written hastily. =) Anyway, if you find any such parts, please email me so\nI can get around to fixing \u0026lsquo;em. Also, I know there\u0026rsquo;s bound to be a lot of\nspelling errors here seeing as how my keyboard is behaving abnormally and I\ndon\u0026rsquo;t use a spell checker. (I hate Word!) Ah, I\u0026rsquo;m rambling now. Must be a result\nof several months of not writing anything but technical papers. Gotta get some\nsleep. (Goes to sleep.)\u003c/p\u003e\n",
            "summary": "Fanfiction.net mirror | Fanfiction.net reviews\nNobody Wants to Live Forever\nby Roy Tang (zroytang@yahoo.com / royness.vze.com)\nFinal Fantasy IX is a copyright of Squaresoft, Inc. Standard disclaimers apply. Final Fantasy IX spoilers, all the way baby!\n My name is Vivi Ornitier.\nI am a black mage.\nThat is to say, I can call upon elemental forces to weave powerful magical spells of destruction. Which is often quite handy, especially when facing a large group of plant-like creatures that can tear me apart with their limbs or petrify me with a single drop of their saliva.",
            "date_published": "2001-11-09T00:00:00+00:00",
            "date_modified": "2021-01-25T13:54:47+08:00",
            "section": "fiction",
            "source_path": "fiction/fanfic/ff9_nobody_wants_to_live_forever.md"
            , "tags": ["fanfiction"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2001/11/final-fantasy-vi-something-to-live-for/",
            "url": "https://mirror.roytang.net/2001/11/final-fantasy-vi-something-to-live-for/",
            "path": "/2001/11/final-fantasy-vi-something-to-live-for/",
            "title": "Final Fantasy VI: Something to Live For",
            "content_html": "\u003cp\u003e\u003ca href=\"https://www.fanfiction.net/s/393006/1/Something-to-Live-For\"\u003eFanfiction.net mirror\u003c/a\u003e | \u003ca href=\"https://www.fanfiction.net/r/393006/\"\u003eFanfiction.net reviews\u003c/a\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eAn FF6 fan fiction work by: \u003ca href=\"mailto:zroytang@yahoo.com\"\u003ezroytang@yahoo.com\u003c/a\u003e. Final Fantasy VI and all\ncharacters involved are copyright of Squaresoft.\u003c/p\u003e\n\u003cp\u003eAuthor\u0026rsquo;s note: This story takes place before the start of FF6.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Stop, thief!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHe heard the shopkeeper shouting after him, and grimaced. A couple of\nyears or so ago if someone told him he\u0026rsquo;d be stealing food off merchants in South\nFigaro, he\u0026rsquo;d laugh in their faces. He was a different man then, with different\nworries. The man he was today couldn\u0026rsquo;t be bothered to think about such things as\nhonor or ethics. He was too busy thinking about food, and money. And his\nresearch of course. He had to do his research. What did it all mean otherwise?\nThe months of living off stolen food and money, moving from place to place,\nrobbing scholars and merchants alike, living as a thief. Damn, he said to\nhimself. These aren\u0026rsquo;t the thoughts to be having while being pursued by Imperial\nTroopers.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hurry up, Biggs, he\u0026rsquo;s getting away!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHis somewhat stout companion was lagging a step or so behind him,\nadjusting his brown helmet. But he couldn\u0026rsquo;t afford to slow down and wait for\nhim, he thought as he saw his quarry turn right into the next alley. This had\nbeen the chance they were waiting for, a chance to prove themselves to their\nsuperiors. He sped up the chase as his prey knocked down a couple of merchant\nstalls in his haste to get away. He looked around and tried to figure out where\nhis target was heading. Biggs was still right behind him, panting, but still\nrunning. They had known each other since they were kids back in their hometown,\ndreaming of becoming Imperial Generals. He looked back to his friend and shouted\nan unnecessarily rough command.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Biggs, he\u0026rsquo;s headed for the west side exit! Get the Guards to cover that\nside!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBiggs nodded at Wedge words, and turned down the next corner to alert\nthe Figaro Guards on the west side. He was a bit miffed at Wedge\u0026rsquo; tone. They\nwere, after all, of equal rank, having been Sergeants in the Imperial Army for,\nwhat, two years now? His mind flashed back to the time he and Biggs were\npromoted, how happy they were that they were one step closer to their dream. He\nremembered that dream and forgave his friend\u0026rsquo;s words. He was merely excited\nafter all, since this capture would undoubtedly lead to a promotion. He caught\nsight of the Figaro Guardsmen at their post, and stepped up his running a notch.\u003c/p\u003e\n\u003cp\u003eDamn, he\u0026rsquo;s still right behind me, the object of the soldiers\u0026rsquo; attention\nsaid to himself. He was a pretty fast runner, but this guy was hot on his tail.\nHe glanced back at his pursuer as he jumped down the steps from the rampart to\nground level. He looks young, he thought to himself, probably hasn\u0026rsquo;t even been\nin the service five years, a private or a sergeant at most. He considered\nstopping and pulling out the dirk in his belt, as the guy probably wouldn\u0026rsquo;t\nstand a chance. But he hated killing, and avoided it whenever he could. Besides\nthe guy just needed to hold him off for a few minutes before the Guard could\nsurround him. No, I\u0026rsquo;ll just stick to the plan \u0026ndash; out the west side wall and off\nto Narshe. He turned the corner, stopped and fell back as he caught sight of the\nseven or eight Guards at the gate, with an Imperial Soldier commanding them. Oh\nwell, it was a bad plan anyway. He looked back to see the other soldier about to\npounce on him. He drew his blade and parried just before the sword cut off his\nleft arm.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey, take it easy! I\u0026rsquo;m a thief, not a murderer!\u0026rdquo; Not yet, at least.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hmph. I know who you are.\u0026rdquo; Wedge made a feint, hoping to fake out a\ncounterattack. \u0026ldquo;We\u0026rsquo;ve had reports of your activities in this area for some time\nnow. And your time is up.\u0026rdquo; When his opponent failed to counter, he followed\nthrough, hoping to catch him in the right shoulder with a quick thrust.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Sorry, kid,\u0026rdquo; the thief said as he knocked the incoming blade to the\nside.\n\u0026ldquo;But there\u0026rsquo;s no way I\u0026rsquo;m letting myself get caught here.\u0026rdquo; He turned around\nquickly, letting the man\u0026rsquo;s thrust slide harmlessly behind him, and proceeded to\nknock him down with the hilt of his blade. He heard the soldiers coming before\nhe saw them, so he started running again as his opponent fell to his knees,\nhands massaging the back of his neck.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Wedge, what happened?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t worry about me, just go get that guy!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAs Biggs attended to his defeated partner, the thief looked back to see\nseven Figaro Guards in hot pursuit. Damn, I guess I\u0026rsquo;ll have to go out the other\nside. I guess I\u0026rsquo;ll be hiding in a cave again for a couple of days. He changed\nhis mind when he saw the guards gathered at the east side entrance. He sighed to\nhimself as he turned and ran up the stairs to the ramparts. Why did I always\ncome back to South Figaro anyway? South Figaro was well-manned, both by Figaro\nGuards and Imperial Soldiers, mainly because most of the trade between the\nEmpire and Figaro passed through here. That meant a lot of merchants to steal\nfrom, but it also meant you had a hell of a time escaping. Uh oh, he muttered as\nhe saw the two Imperial Soldiers who had chased him earlier right in front of\nhim. He looked around, jumping off the rampart was out of the question, there\nwere three guards on the ground level just waiting for him. And the other four\nwere right behind him. He stopped, shrugged, and turned to the two Troopers, a\ndespondent look on his face. It\u0026rsquo;s not like he was worried about getting\ncaptured. After all, he\u0026rsquo;d been captured before, and he would probably be out\nagain in a couple of days. What bothered him was that the chase was over. That\nwas all he really lived for these days, the thrill of the chase. That and\nhis\u0026hellip;research of course.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I guess you got me.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Like I said, your time\u0026rsquo;s up. By order of the Imperial Magistrate, you\nare\nunder arrest, Locke Cole.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eBiggs produced a pair of shackles and Wedge grabbed Locke, pinning his\narms\nbehind him. He was about to snap on the shackles when the Figaro Guards came up\nto them.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Release this man to our custody,\u0026rdquo; the Guard Commander said to the two\nTroopers. \u0026ldquo;He\u0026rsquo;s wanted by the King of Figaro for crimes against the nation of\nFigaro.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? This man is wanted under Imperial Law, and we came here\nspecifically\nto bring him to the Emperor\u0026rsquo;s justice.\u0026rdquo; Wedge said. Although officially, they\nwere just stationed here as part of the \u0026ldquo;diplomatic envoy\u0026rdquo; to Figaro, they had\ntaken it upon themselves to prove their abilities to their superiors by catching\na notorious thief. \u0026ldquo;It is our duty to bring him back to the Imperial Capital for\nsummary execution.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eExecution? Yeah, right. Locke wasn\u0026rsquo;t worried about that. He felt a bit\nmiffed though, being fought over by two sets of soldiers.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry, Sergeant,\u0026rdquo; the Guard Commander said, emphasizing Wedge\u0026rsquo;s\nrank.\n\u0026ldquo;But this man was captured on Figaro territory, and the King\u0026rsquo;s Guards get first\ncrack at him. We\u0026rsquo;re allies, yes. But that doesn\u0026rsquo;t give your Imperial Army\nauthority in these lands.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eHe was here again. It seems he was here every night. Wherever he was,\nhis\ndreams almost always brought him back to this place. A place he hadn\u0026rsquo;t visited\nfor little more than a year now. Kohlingen.\nIt seemed only yesterday he was living in this quiet little town, an\naspiring treasure hunter. He used to love this place. He wasn\u0026rsquo;t very well off,\nbut he had a house here, a cozy little place he had inherited a long time ago.\nHe loved the people here, the atmosphere, and the scenery. And Rachel. Of\ncourse, there was always Rachel.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t be silly Locke,\u0026rdquo; Rachel had said to him as they sat at their\nusual\ntable at the town\u0026rsquo;s only restaurant. \u0026ldquo;You\u0026rsquo;ve been in those caves a million\ntimes. What makes you think you\u0026rsquo;ll find anything new today?\u0026rdquo; She always needled\nhim about his \u0026lsquo;job\u0026rsquo;, or lack of it as the case may be. But she loved him. Of\nthis he was sure. He would never be able to provide for her in the way her\nparents wanted, but he knew he loved her as well, and that he would always take\ncare of her.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Just a feeling I got,\u0026rdquo; he had said with his usual air of confidence.\n\u0026ldquo;There was an unusual cleft I saw the last time I was in there. I\u0026rsquo;m pretty sure\nthat there are other artifacts in there like the last one.\u0026rdquo; He had found an\nancient spear in the cave before, and a scholar had verified for him that it was\nindeed an artifact, from the War of the Magi perhaps. Which was why he wanted to\nexplore the caves more. Rachel always worried about him, and he hated worrying\nher. But a few more artifacts like that, and the two of them could probably be\nset for life.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No good will come of these \u0026lsquo;artifacts\u0026rsquo; you know,\u0026rdquo; had Rachel said in\nher\nmost lecturing tone, \u0026ldquo;the War of the Magi ended a thousand years ago, and\ndigging up long-forgotten weapons won\u0026rsquo;t help the peace any. Who knows, one of\nthese weapons you excavate could catch the interest of the Empire. What would\nhappen to Kohlingen then?\u0026rdquo; Rachel\u0026rsquo;s father was a scholar, a historian who\nstudied the War of the Magi. So her father always told her of the horrible\nstruggle that ended a thousand years ago, and how they should all learn from\nhistory\u0026rsquo;s mistakes. She smiled at him, \u0026ldquo;After all, if something were to happen\nto our little town, where would we live when we got married?\u0026rdquo; Locke\u0026rsquo;s face went\nred at the memory of her smile.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eLocke woke up to the sound of a voice from the other side of his cell\nwall.\nOh well, he said to himself. I\u0026rsquo;ve dreamed the same dream a thousand times\nanyway. The voice behind the wall repeated itself.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What?\u0026rdquo; Locke said to the wall.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey, you\u0026rsquo;re awake. I heard the guards talking about you. Is it true\nyou\u0026rsquo;re\nLocke Cole?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, what of it?\u0026rdquo; he responded cautiously.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Wow! I\u0026rsquo;ve always wanted to meet you! You\u0026rsquo;re my hero! I\u0026rsquo;ve heard all\nabout\nyour \u0026lsquo;jobs\u0026rsquo; back in the Empire!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke sighed. It\u0026rsquo;s bad enough he was a thief. Now he was a famous thief.\nWith an enthusiastic fan. He curled up and tried to get back to sleep. \u0026ldquo;You\u0026rsquo;re\nthinking of someone else, just let me sleep.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eApparently his excited prison mate hadn\u0026rsquo;t heard him. \u0026ldquo;I\u0026rsquo;m Lone Wolf, the\npickpocket. I mean, I\u0026rsquo;m just a pickpocket now, but someday I\u0026rsquo;m gonna be a famous\nthief like you! So, when are you planning to escape? You are planning to escape,\nright?\u0026rdquo; Another two-bit crook, Locke figured. They were being held in the prison\nin the basement of Figaro Castle. The Guards had taken him here after a rather\nheated argument with the two Troopers. He figured he\u0026rsquo;d stay for a couple of\ndays, if only to take advantage of the free food. But his \u0026lsquo;friend\u0026rsquo; behind the\nwall didn\u0026rsquo;t need to know that.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m not gonna escape. Just go to sleep.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? You can\u0026rsquo;t be serious! I mean, they probably won\u0026rsquo;t execute us like\nthe Empire would, but\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe voice trailed off at the sound of the far doors of the prison\ncreaking\nopen, something eerily noticeable in the darkness. A couple of guards walked up\nto his cell, one of them carrying a candle. Behind them, Locke could see the\nsilhouette of a tall, robed man.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Locke Cole?\u0026rdquo; The robed man turned to the guard for confirmation. \u0026ldquo;The\nKing\nwishes to see you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke wondered what the King of Figaro would want with him as the Guards\nopened his cell and brought him to his feet.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Be strong, man!\u0026rdquo; His unseen friend spoke out to him again, albeit in a\nmore subdued voice. \u0026ldquo;You can get out of this!\u0026rdquo; He never heard from that guy\nagain.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eEdgar Roni Figaro, king of the small nation of Figaro, was in his throne\nroom. You\u0026rsquo;d think someone who was royalty would be surrounded by servants\nwilling to do his every bidding. But Edgar didn\u0026rsquo;t really like servants hovering\naround him, except for the occasional pretty servant girl perhaps, but not\ntoday. Today, there were greater concerns to be met.\u003c/p\u003e\n\u003cp\u003eThe king of Figaro was conversing with a bearded old man standing in\nfront\nof his throne. If not for the throne, one might think Edgar actually deferred to\nthe old man, instead of being the king that he was.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Are you sure about this, old friend?\u0026rdquo; Edgar asked the old man.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;He would be a great help to us, I\u0026rsquo;m sure,\u0026rdquo; came the reply, \u0026ldquo;and you\nknow\nwe need all the help we can get.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;How can you be sure he\u0026rsquo;d agree?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Just leave it to me.\u0026rdquo; The old man smiled knowingly.\u003c/p\u003e\n\u003cp\u003eThe Chancellor of Figaro, wrapped in his flowing red robe with golden\ntrimmings, strode into the throne room. \u0026ldquo;Beg your pardon, your majesty, but the\nprisoner is here.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;All right, bring him in.\u0026rdquo; Edgar nodded briefly to the old man, who then\nmoved conveniently to the shadows in the far wall.\u003c/p\u003e\n\u003cp\u003eThe two guards nudged Locke into the throne room. He complied and walked\ninto the room with no hint of awe or majesty at Figaro\u0026rsquo;s throne room. It was\nmajestic, yes, worthy of a king, but nothing he had not seen before. The guards\nbrought him before the throne.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Kneel.\u0026rdquo; The guard gruffly ordered, and Locke felt his head pushed to\nthe\nground.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Get up, you know I hate that.\u0026rdquo; Edgar said. The guards complied, lifting\nLocke back to his feet. Locke looked up at the king of Figaro. He\u0026rsquo;s younger than\nI thought, Locke said to himself, what does he want with me?\u003c/p\u003e\n\u003cp\u003eLocke looked around the room and took note of any means of escape. There\nwere six other guards, aside from the ones holding him, and two more outside the\ndoor; the fat old chancellor who had taken him out of his cell; and an old man\nstanding to the side, trying to remain unnoticed. Who is he? Some sort of\nservant?\u003c/p\u003e\n\u003cp\u003eHe heard the king speak again and focused his attention to the throne.\n\u0026ldquo;Thank you for bringing him here, Chancellor. Please leave us, I wish to speak\nto him in private.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;But your highness,\u0026rdquo; the Chancellor started, a bit ruffled, \u0026ldquo;We can\u0026rsquo;t\nleave\nyou alone with this\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s alright.\u0026rdquo; Edgar looked at the guards. \u0026ldquo;And please remove his\nshackles.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe guards looked at one another before complying. Locke felt the\nshackles\ncome off, and rubbed his wrists to warm them. He saw the king nod to the other\nguards, and they accompanied the chancellor out the throne room.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;With all due respect your highness,\u0026rdquo; Locke finally said, \u0026ldquo;You sure you\nwanna be alone with me? I\u0026rsquo;m a dangerous thief you know.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eEdgar smiled. No respect for authority in this one, he thought to\nhimself.\nHe looked to the shadows on the wall, and the old man stepped forward. Locke\nfinally got a good look at him, although he still couldn\u0026rsquo;t recognize the man.\nThe old man spoke.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yes, we know all about you Locke Cole. A very daring thief, who has\nconducted various operations throughout the imperial domains and beyond over the\npast few months.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You\u0026rsquo;ve got quite a reputation you know,\u0026rdquo; Edgar said, looking directly\nat\nhim, \u0026ldquo;You\u0026rsquo;re wanted for about twenty-seven charges of theft, breaking and\nentering and evading arrest in Figaro alone. You\u0026rsquo;re lucky we don\u0026rsquo;t execute\nthieves like the Empire does.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;The Empire\u0026hellip;\u0026rdquo; Locke thought a bit before speaking again. \u0026ldquo;Listen, I\ndon\u0026rsquo;t\nknow what dirty work you and your allies want me to do, but I don\u0026rsquo;t care. I may\nbe a thief but there\u0026rsquo;s no way I\u0026rsquo;m doing Gestahl any favors!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well said.\u0026rdquo; The old man spoke again. \u0026ldquo;Just what we would have expected\nfrom you. And just what we wanted.\u0026rdquo; He paused before going on. \u0026ldquo;We are not the\nEmpire.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What are you talking about old man? Figaro\u0026rsquo;s practically Imperial\nterritory with all those soldiers running around and your king bowing and\nscraping to that old dog of an Emperor\u0026ndash;!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey, hey,\u0026rdquo; Edgar interrupted. \u0026ldquo;The king of Figaro doesn\u0026rsquo;t bow or scrape\nto\nanyone. The Empire and Figaro are allies, yes. Equally? No. They forced this\nalliance down our throats, knowing we had no choice, but Figaro will never bow\ndown to the Empire.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;So what are you doing here, then?\u0026rdquo; Locke sneered, \u0026ldquo;Hiding in your\ndesert\ncastle while Imperial Troops harass your people and tax your merchants.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Allow me to explain,\u0026rdquo; the old man said. \u0026ldquo;Edgar here, king of Figaro,\nand\nmyself, are members of a small underground group working to destabilize the\nEmpire.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Rebels?\u0026rdquo; Locke said incredulously. \u0026ldquo;You\u0026rsquo;ve got to be kidding. There\u0026rsquo;s\nno\nway Figaro\u0026rsquo;s army could stand up to the Empire. They\u0026rsquo;ve only used a fraction\ntheir power to dominate the Southern Continent, and even the King of Doma is\nhaving a hard time against them!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That\u0026rsquo;s exactly why Figaro is still openly an ally of the Empire.\u0026rdquo; Edgar\nexplained. \u0026ldquo;We have no intention of meeting them in war, as that would only\nresult in a bloody loss. But once Doma falls, it\u0026rsquo;s pretty certain that Figaro\nwill be their next target.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;We have no means of fighting them, really,\u0026rdquo; the old man continued,\n\u0026ldquo;Except\nwith our hearts and with our minds. We have supporters scattered throughout the\nEmpire, waiting for our word. We have people disrupting Imperial supply lines,\nsabotaging their machinery. We may not be able to topple them today, or anytime\nsoon, but we will eventually. But we need help. We need more people.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;People like you,\u0026rdquo; Edgar said, looking directly at Locke.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you think I can do?\u0026rdquo; Locke said, \u0026ldquo;I\u0026rsquo;m just a thief. I can\u0026rsquo;t do\nanything against an Empire!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026lsquo;A small stone may make a ripple at first, but someday it will be a\nwave.'\u0026rdquo; Edgar said, \u0026ldquo;An ancient quote.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You are no ordinary thief, Locke Cole.\u0026rdquo; The old man said, \u0026ldquo;You were\nonce\nthe best treasure hunter in Kohlingen. We need someone like you, someone who can\nwork their way through Empire lands, disrupting their communications and supply\nlines, providing and gathering information. And most importantly, to contact our\nallies. It has become increasingly dangerous for me to meet with our allies like\nthe king here.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;If the Empire finds out we\u0026rsquo;ve been meeting with our allies in secret,\nit\u0026rsquo;s\nhard to tell what they\u0026rsquo;d do.\u0026rdquo; Edgar said, \u0026ldquo;Especially since some of our contacts\nare deep inside the Imperial hierarchy. What do you say? Not much pay, but you\ndon\u0026rsquo;t really do these things for the money do you?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke paused for a while. These guys knew him inside out, and his\nconscience begged him to help them out. But there were other things he had to\ndo, something else he was fighting for.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eHis memory flashed back to that fateful day. He had wanted to show\nRachel\nthe buried ruins he had found in one of his explorations up on Mt. Kolts. With\nall the artifacts there, he was pretty sure they would be pretty much set for\nlife. It had taken him a while to convince her to come with him, but he\neventually got her to agree.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t worry, I\u0026rsquo;ll watch over you every step of the way.\u0026rdquo; He grinned at\nher\nas they strode up the mountain path.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sure you will,\u0026rdquo; Rachel replied, \u0026ldquo;the same way you were watching\nover\nthat bar girl the other night, eh?\u0026rdquo; She smiled at him teasingly.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hey, I told you, she looked just like my cousin!\u0026rdquo; Locke smiled right\nback\nat her. \u0026ldquo;The cave\u0026rsquo;s just beyond the next bridge.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;We\u0026rsquo;d better hurry,\u0026rdquo; Rachel said, pulling close to him. \u0026ldquo;If my parents\nfind\nout I\u0026rsquo;ve been gallivanting with you\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026ndash;they\u0026rsquo;d chase me out of Kohlingen, right. Don\u0026rsquo;t worry, I\u0026rsquo;ll just show\nyou\nwhat I\u0026rsquo;ve found, and have you back in Kohlingen before your father can give you\none his trademark lectures.\u0026rdquo; Locke stopped and faced her, made a stern face and\nstarted to mimic her father. \u0026ldquo;I don\u0026rsquo;t know what you see in that Locke fellow!\nHe\u0026rsquo;s a regular rapscallion, that he is! He\u0026rsquo;ll do you no good, you hear!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRachel laughed at him and slapped him lightly on the chest. \u0026ldquo;Knock it\noff,\nokay? I can see the bridge already.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRachel had stopped at the summit just before the bridge. She looked off\ninto the southward horizon, at the small town seemingly a lifetime away.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;South Figaro looks so\u0026hellip; small from up here.\u0026rdquo; This was the first time\nshe\nhad ever climbed a mountain, and the natural beauty she could see amazed her. \u0026ldquo;I\ncould see for miles\u0026hellip; everything is so\u0026hellip; pristine\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;C\u0026rsquo;mon Rachel, you\u0026rsquo;re the one who told me to hurry!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh\u0026hellip; yes.\u0026rdquo; She said, hurrying over to him. \u0026ldquo;I would be a little more\nexcited if you maybe told me what it is we\u0026rsquo;re going to see.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You\u0026rsquo;re not gonna believe what awaits us up here!\u0026rdquo; Locke said as he\ncrossed\nthe bridge. \u0026ldquo;Come on, it\u0026rsquo;s worth a fortune!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eEverything else had seemed to happen in slow motion. It was a moment he\nhad\nrelived time and again. His footing had been wrong, and he had felt the bridge\nbegin to give way. He heard her shouted warning, but had been caught unawares\nwhen she threw herself at him. He had been so surprised that he wasn\u0026rsquo;t able to\nput up any resistance. He had felt himself pushed back to the far end of the\nbridge. He had stumbled clumsily, and his instinct took over as he jumped clear\nof the collapsing bridge. He had looked back, and she was not there. He ran to\nthe edge of the ravine, shouting her name without hearing anything. He had\nclimbed down after her, and everything else was a blur. Rushing her back to her\nfather\u0026rsquo;s house, the worried looks on her parent\u0026rsquo;s faces, the relief when the\ndoctors said she\u0026rsquo;d be fine, and finally, that blank look on her face when she\nwoke up to him. No gleaming eyes or bright smile. Simply an emotionless stare,\nas if she had never seen him before.\u003c/p\u003e\n\u003cp\u003eHer parents had been outraged, but he had just sat there, not knowing\nwhat\nto do or say. He tried to speak, but Rachel\u0026rsquo;s father wouldn\u0026rsquo;t even hear of it.\nHe was chased out of Kohlingen by nightfall, nowhere to look or turn.\u003c/p\u003e\n\u003cp\u003eHe couldn\u0026rsquo;t remember how he had wound up in South Figaro, or how long he\nhad been there. He didn\u0026rsquo;t know how he was able to survive, living off food he\nfound or stole off the streets. Somehow, he found himself under the care of an\nold scholar who had retired to South Figaro. The weeks of desperation had taken\ntheir toll on him and he was bedridden for several days. But he had found\ncomfort with the old man who listened to his story, the only one he ever told it\nto. He had poured his heart out, sometimes with tears running down his face, as\nhe recounted Rachel\u0026rsquo;s tragedy. Luckily, his newfound friend had with him a\nglimmer of hope that brought him out of his stupor.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I can\u0026rsquo;t be sure about this, you know,\u0026rdquo; The old scholar had droned in\nhis\nmonotone voice, \u0026ldquo;But I seem to recall an old chap a while back who had done\nresearch on this sort of thing\u0026hellip; memory loss and recovery, I believe.\u0026rdquo; Locke\nremembered how his face had lit up when he realized what the old man was saying.\nA cure? Rachel\u0026rsquo;s condition can be cured?\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, as I said, it\u0026rsquo;s somewhat of a long shot,\u0026rdquo; the old man said, \u0026ldquo;but\nI\nthink the old chap was one of the Empire scientists.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAnd so his hunt had began. After thanking his benefactor, he had set off\nfor Imperial territory, determined to find a cure for her recovery. He lived by\nstealing off merchants and Imperial officers, traveling throughout the Southern\ncontinent, asking scientists and researchers about this so-called cure.\u003c/p\u003e\n\u003cp\u003eAnd all for what? Locke asked himself as he considered the offer being\nmade\nto him. He had been searching for almost a year now, with not even a single\nclue. He was wanted for numerous crimes throughout the empire, but he couldn\u0026rsquo;t\neven sneak into the fortress at Vector to question their scientists. Maybe, this\njob was the right thing for him to do? No, he decided. He had already devoted\ntoo much time and effort to what he was doing, it all had to mean something, he\nhad to do it, for Rachel.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry,\u0026rdquo; He replied to Edgar and the old man, \u0026ldquo;I understand your\nneeds,\nbut there are some things I just have to do, some things that are more important\nto me.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eEdgar frowned a him. \u0026ldquo;I don\u0026rsquo;t think I have to remind you that you\u0026rsquo;re a\ncriminal under my jurisdiction.\u0026rdquo; He looked straight at him, \u0026ldquo;I hold your life\nin my hands.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Is that supposed to be a threat?\u0026rdquo; Locke said mockingly, \u0026ldquo;I\u0026rsquo;ve escaped\nworse fates than this before.\u0026rdquo; He stood there defiantly, as if daring Edgar to\nstrike him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Now, now, no need to be hostile to each other\u0026rdquo;, the old man said\nsoothingly. The two backed down a bit. He looked at the young king. \u0026ldquo;Edgar, no\nneed to be rough with him, is there? I\u0026rsquo;m sure you can arrange a \u0026lsquo;pardon\u0026rsquo; for\nthis young man, can\u0026rsquo;t you? So that he can consider our offer.\u0026rdquo; He turned back to\nLocke. \u0026ldquo;Please take the time to consider it, you don\u0026rsquo;t have to decide now.\u0026rdquo; The\nold man looked at Edgar, \u0026ldquo;Well?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;All right, tell you what,\u0026rdquo; Edgar sighed resignedly, \u0026ldquo;I\u0026rsquo;ll tell some of\nthe\nguards at the night shift to take an early break around midnight, okay? Just\ndon\u0026rsquo;t hurt any of my guards.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe old man nodded and turned back to Locke. \u0026ldquo;We can\u0026rsquo;t force you to help\nus, that isn\u0026rsquo;t our way. But please think about it. If you wish to contact me,\ntalk to Arvis of Narshe, I\u0026rsquo;m sure you know him.\u0026rdquo; He smiled at Locke. \u0026ldquo;My name is\nBanon.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Or, you could just get yourself caught again,\u0026rdquo; Edgar grinned as he went\nto\ncall the guards back.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eLocke nudged his chocobo to go just a bit faster. He was anxious, and at\nthe same time worried. He hadn\u0026rsquo;t been back to Kohlingen for the past year, but\nhe needed to go back now. He needed to reassure himself that he was doing the\nright thing, to remind himself what he was fighting for.\u003c/p\u003e\n\u003cp\u003eHis conscience had been bothering him since the guard brought him back\nto\nhis cell. He had wanted to catch a couple of hours sleep before midnight, but he\nkept thinking about what it is that he was he was doing. He was on a wild-goose\nchase, he could recognize that, for some cure that may or may not exist. But he\nhad to do it, because he owed it to her, to fight for her. To protect her. But\nnow, he had turned his back on people who needed him, people he could help, to\npursue this unknown cure. Had he met the right choice? He would know when he saw\nRachel again.\u003c/p\u003e\n\u003cp\u003eSure enough, the guards left around midnight, and Locke had been the\nonly\nprisoner awake. He had looked around warily, still not sure what to make of the\nsituation, but then started to work on the cell\u0026rsquo;s lock. Nothing too difficult,\nhe was out of the dungeon in three minutes. He had promised not to hurt any of\nthe guards, but he had to knock a couple of them unconscious and steal a\nchocobo.\u003c/p\u003e\n\u003cp\u003eAnd now here he was, just a couple of miles to Kohlingen now, and he\nwould\nsee her again. He didn\u0026rsquo;t need to talk to her, just to see her. To remind himself\nof what he was doing, and why.\u003c/p\u003e\n\u003cp\u003eOff the horizon, in the direction of Kohlingen, he sighted a thick\npillar\nof black smoke rising from the ground. Worried, he kicked his chocobo into high\ngear.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eThe sight was disturbing. The slightest traces of dawn had begun to\nappear,\nand the rays of light seemed to grotesquely outline the destruction that had\nhappened here. Several houses were burned to the ground, some had collapsed on\nthemselves, now simply a heap of wood and rubble. As Locke rode into the city\nand through the empty streets, he could feel several eyes looking out of the\nhouses that were still standing.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What the hell happened here?\u0026rdquo; Locke pondered for a moment before his\nheart\ntook over again. \u0026ldquo;Rachel!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHe got off his Chocobo, and took a shortcut down a narrow alley. Looking\naround, he saw that most of the brick-and-mortar houses here had survived\nwhatever it was that caused this carnage, so he figured Rachel and her family\nwould be alright. His stomach turned as he saw the remnants of their house\ncollapsed on the ground like a random pile of rocks. He stood there gaping for\nseveral moments before he heard someone call out to him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Master Locke!\u0026rdquo; Seymour, Rachel\u0026rsquo;s family\u0026rsquo;s manservant, came running up\nto\nhim. He was a skinny man in his late forties, and he was often sympathetic to\nLocke and Rachel\u0026rsquo;s relationship even when his master didn\u0026rsquo;t approve.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Seymour!\u0026rdquo; Locke said in relief, \u0026ldquo;What happened here? Where\u0026rsquo;s Rachel?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It was the Empire, sir!\u0026rdquo; Seymour spilled, as he stopped in front of\nLocke,\ngasping for breath. Even though he was almost fifty, he had always insisted he\nwas healthy enough to run a marathon. \u0026ldquo;They came through here last night, saying\n\u0026lsquo;Imperial enemies\u0026rsquo; had been hiding here.\u0026rdquo; He looked around. \u0026ldquo;They burned down\nand destroyed houses and buildings with some new weapon they had. MagiDuck, or\nsomething such, sir! A ghastly meld of monster and machine, a weapon of\ndestruction\u0026hellip;\u0026rdquo; He looked at Locke, \u0026ldquo;It\u0026rsquo;s good to see you again, sir, despite\nthe circumstances\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Rachel!\u0026rdquo; Locke almost shouted, \u0026ldquo;Where is she? Is she alright?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eSeymour hesitated before replying. \u0026ldquo;Best you go see for yourself sire,\nshe\u0026rsquo;s at Largo\u0026rsquo;s right now.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke nodded, and hurried off. \u0026ldquo;Thanks, Seymour. Get some rest, you\nhear?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003ePutting aside his concerns for Seymour\u0026rsquo;s health, Locke made his way to\nthe\nherbalist\u0026rsquo;s shop. Old Largo, the medicine man of Kohlingen, had done many good\nthings for him back when he was still climbing mountains and all. Hopefully,\nRachel would be alright.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eHe had been sitting on this bench for half a day now. He felt so\nuseless.\nAll his efforts, all his sacrifices to find a cure for Rachel, and what happens?\nHe\u0026rsquo;s not there for her at the time she needed him most. Largo had told her what\nhappened, how their house had collapsed on top of them. Seymour and the others\nhad dug through the rubble, expecting to find only their dead bodies. Rachel\u0026rsquo;s\nparents didn\u0026rsquo;t make it. But surprisingly, Rachel did. She had been holding\nsomething in her hand when they found her, gasping for breath, bruised and\nbattered all over. She had been delirious and weak as they carried her to\nLargo\u0026rsquo;s for treatment, mumbling all the way. Once they laid her down on a bed,\nshe had promptly collapsed and had not awakened since. She had dropped whatever\nit was she was holding, a small pendant which had given her something to live\nfor, which Largo had seen fit to give to Locke.\u003c/p\u003e\n\u003cp\u003eHe fingered the small pendant Largo had given him, and opened the\nlocket,\nthe same way he had been doing for the past few hours. The picture inside was a\nbit burned at the edges, but he could nonetheless see their faces so clearly.\nLocke and Rachel. They had taken this picture several months before the\naccident, and she had promised to treasure it forever. He closed the locket and\nslammed his fist into the ground as he recalled Seymour\u0026rsquo;s words. \u0026ldquo;She was\nmumbling your name all the way, sir, even before we found her in the rubble, and\nup to the time she fainted.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;So bloody useless,\u0026rdquo; he muttered to himself, \u0026ldquo;What the hell have I been\ndoing this past year, what the bloody hell has it all been for?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHe remembered Largo telling him about her condition. He said she was in\nbad\nshape, and that it was a miracle she survived. He had given her some medicine to\nkeep her from the brink of death. But that was the best he could do. He didn\u0026rsquo;t\nknow whether she could be revived in any way. The herbs would keep her like\nthis, in a form of suspended animation, for a long while, but that was the best\nhe could do. For all intents and purposes, it was as if she were already dead.\u003c/p\u003e\n\u003cp\u003eBloody useless, Locke repeated to himself. What could he do now? Raise\nthe\ndead? A slight rain began to fall.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Master Locke,\u0026rdquo; he heard Seymour\u0026rsquo;s voice behind him, \u0026ldquo;You should get\nsome\nrest. And get out of the rain, sir.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eHe ignored him for a while, and eventually Seymour\u0026rsquo;s voice vanished from\nhis hearing.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eThe next dawn found him still in the spot, staring lazily at the\nherbalist\nshop across the street. The rain had stopped a few hours before, but he was\nstill quite drenched. He felt his eyelids starting to fall, for the umpteenth\ntime now, and snapped himself awake. He heard footsteps behind him.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry.\u0026rdquo; The voice was the old man\u0026rsquo;s. The one he had met in Figaro\nCastle. What did he say his name was? Oh yeah, Banon.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I came up here as soon as I\u0026rsquo;d heard.\u0026rdquo; The old man sat down beside him.\n\u0026ldquo;We\nknew of your history with the girl here in Kohlingen, and we knew that was why\nyou didn\u0026rsquo;t want to join us. Too bad things had to be like this.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke\u0026rsquo;s silence disturbed him but he went on, \u0026ldquo;Listen, about the\noffer\u0026hellip;\u0026rdquo;\nBanon wasn\u0026rsquo;t sure what to say, but he decided to press on, \u0026ldquo;\u0026hellip;we understand if\nyou choose to decline. After all it must be a difficult time for you ri\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;ll do it.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026ndash;ght now. Eh?\u0026rdquo; Banon turned to him in surprise.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Rachel would\u0026rsquo;ve wanted me to help you guys, I guess,\u0026rdquo; Locke said\nresignedly, \u0026ldquo;She always said the Empire would someday threaten Kohlingen. I\nnever really listened to her.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Locke\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Don\u0026rsquo;t worry about me. I\u0026rsquo;ve had a long time to think about things. I\nsacrificed a lot of things trying to bring back the Rachel I knew, only to have\nthe Empire take her away again. I owe it to her to fight for the ideals she\nbelieved in. I have to do this now, or else, it all has no meaning.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe old man nodded. \u0026ldquo;Very well. I\u0026rsquo;ll be staying at the inn. When you\u0026rsquo;re\nready, just look for me there alright?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLocke nodded. He stood up and looked down at himself. \u0026ldquo;I guess I should\nclean up a bit, huh? Maybe Largo\u0026rsquo;s awake already.\u0026rdquo; He started towards the\nherbalist\u0026rsquo;s shop.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh and Locke,\u0026rdquo; Banon started to say.\u003c/p\u003e\n\u003cp\u003eLocke looked at him questioningly.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Welcome to the Returners.\u0026rdquo;\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003efinis\u003c/p\u003e\n",
            "summary": "Fanfiction.net mirror | Fanfiction.net reviews\n An FF6 fan fiction work by: zroytang@yahoo.com. Final Fantasy VI and all characters involved are copyright of Squaresoft.\nAuthor\u0026rsquo;s note: This story takes place before the start of FF6.\n\u0026ldquo;Stop, thief!\u0026rdquo;\nHe heard the shopkeeper shouting after him, and grimaced. A couple of years or so ago if someone told him he\u0026rsquo;d be stealing food off merchants in South Figaro, he\u0026rsquo;d laugh in their faces.",
            "date_published": "2001-11-09T00:00:00+00:00",
            "date_modified": "2021-01-25T13:54:47+08:00",
            "section": "fiction",
            "source_path": "fiction/fanfic/ff6_something_to_live_for.md"
            , "tags": ["fanfiction"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2001/11/",
            "url": "https://mirror.roytang.net/2001/11/",
            "path": "/2001/11/",
            "title": "Monthly Archives for 11 2001",
            "content_html": "",
            "summary": "",
            "date_published": "2001-11-01T00:00:00+00:00",
            "date_modified": "2019-09-29T18:26:08+08:00",
            "section": "archm",
            "source_path": "archm/2001-11.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2001/01/",
            "url": "https://mirror.roytang.net/2001/01/",
            "path": "/2001/01/",
            "title": "Monthly Archives for 01 2001",
            "content_html": "",
            "summary": "",
            "date_published": "2001-01-01T00:00:00+00:00",
            "date_modified": "2019-10-01T06:33:21+00:00",
            "section": "archm",
            "source_path": "archm/2001-01.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2001/",
            "url": "https://mirror.roytang.net/2001/",
            "path": "/2001/",
            "title": "Yearly Archives for 2001",
            "content_html": "",
            "summary": "",
            "date_published": "2001-01-01T00:00:00+00:00",
            "date_modified": "2019-09-29T18:26:08+08:00",
            "section": "archy",
            "source_path": "archy/2001.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/1997/01/ramna-1/2-time-and-time-again/",
            "url": "https://mirror.roytang.net/1997/01/ramna-1/2-time-and-time-again/",
            "path": "/1997/01/ramna-1/2-time-and-time-again/",
            "title": "Ramna 1/2: Time and Time Again",
            "content_html": "\u003chr\u003e\n\u003cp\u003eRanma 1/2 and all associated characters, places and events are\nundoubtedly property of the esteemed Rumiko Takahashi, and any attempts\nto claim otherwise shall be attended with accordingly.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eNikholas F. Toledo Fanfic Group\npresents\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003eTime and Time Again\nby VECTOR\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003ePart One\u003c/p\u003e\n\u003cp\u003eIt was the usual lunchtime scenario at the Furinkan High cafeteria.\nVarious students were in various states of gobbling. One particular\nstudent, however, was trying to avoid his lunch. This student, Ranma\nSaotome, had concealed himself behind the cafeteria doors in hopes of\navoiding the \u0026ldquo;lunch\u0026rdquo; his \u0026ldquo;fiancee\u0026rdquo; had prepared for him. It wasn\u0026rsquo;t\nexactly normal behavior for such a boy to avoid free food, but the\nfiancee in question was one Akane Tendo, and her cooking could be used as\nnuclear weaponry if only the government realized it.\u003c/p\u003e\n\u003cp\u003eAnother fiancee, however, managed to spot him. This time it was\nokay.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan! I brought you some okonomiyaki!\u0026rdquo; Ukyo Kuonji\u0026rsquo;s voice came\nto Ranma\u0026rsquo;s ears, and Ranma thankfully accepted the okonomiyaki.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Thanks Ucchan\u0026rdquo;, he said between gobbles.\u003c/p\u003e\n\u003cp\u003eSuddenly the nearby wall started to break down.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh no\u0026hellip;\u0026rdquo;, Ranma said.\u003c/p\u003e\n\u003cp\u003eAnd suddenly there was a flash of light.\u003c/p\u003e\n\u003cp\u003eWhen the light dissipated, the wall was broken down and a purple-\nhaired young girl carrying a delivery tray was looking around a bit\nconfused.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ai ya! Where Ranma go?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma and Ukyo had vanished.\u003c/p\u003e\n\u003cp\u003ePart Two\u003c/p\u003e\n\u003cp\u003eIt was the usual lunchtime scenario at the Furinkan High cafeteria.\nVarious students were in various states of gobbling. One particular\nstudent, however, was trying to avoid his lunch. This student, Ranma\nSaotome, had concealed himself behind the cafeteria doors in hopes of\navoiding the \u0026ldquo;lunch\u0026rdquo; his \u0026ldquo;fiancee\u0026rdquo; had prepared for him. It wasn\u0026rsquo;t\nexactly normal behavior for such a boy to avoid free food, but the\nfiancee in question was one Akane Tendo, and her cooking could be used as\nnuclear weaponry if only the government realized it.\u003c/p\u003e\n\u003cp\u003eAnother fiancee, however, managed to spot him. This time it was\nokay.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan! I brought you some okonomiyaki!\u0026rdquo; Ukyo Kuonji\u0026rsquo;s voice came\nto Ranma\u0026rsquo;s ears, and Ranma thankfully accepted the okonomiyaki.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Thanks Ucchan\u0026rdquo;, he said between gobbles.\u003c/p\u003e\n\u003cp\u003eSuddenly the nearby wall started to break down.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh no\u0026hellip;\u0026rdquo;, Ranma said.\u003c/p\u003e\n\u003cp\u003eA purple-haired young girl carrying a delivery tray smashed through\nthe wall and deftly pushed Ukyo away from Ranma.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma, I cook special deluxe ramen for ai len!\u0026rdquo; Shampoo said,\nglomping onto Ranma.\u003c/p\u003e\n\u003cp\u003eAll this had not gone unnoticed to Akane Tendo, and right now she\nwas emanating an incredibly red battle aura.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026hellip;\u0026rdquo; she began, rather furiously.\u003c/p\u003e\n\u003cp\u003eAnd suddenly there was a flash of light.\u003c/p\u003e\n\u003cp\u003eWhen the light dissipated, Ukyo and Akane looked around in shock.\u003c/p\u003e\n\u003cp\u003eRanma and Shampoo had vanished.\u003c/p\u003e\n\u003cp\u003ePart Three\u003c/p\u003e\n\u003cp\u003eRanma Saotome felt the sensation and recognized it. It was a\nfeeling he regularly had, that of submitting his will to gravity.\u003c/p\u003e\n\u003cp\u003eHe was falling.\u003c/p\u003e\n\u003cp\u003eLuckily, Ranma managed to fall into a convenient clump of bushes on\nthe outskirts of Nerima, staving off any real damage (which Ranma\nwould\u0026rsquo;ve been impervious to, anyway). He jumped up to his feet and\nbrushed the dust off his red Chinese clothes. At least this time, he\nhadn\u0026rsquo;t landed in water.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What in the world just happened?\u0026rdquo; he said to himself out loud. The\nshrubbery he had fallen into was just outside the Nerima cemetery,\nmeaning he must\u0026rsquo;ve flown quite a long way from the Tendo Dojo. The\nproblem was, this time he didn\u0026rsquo;t recall anyone in particular smashing him\ninto the sky. He doesn\u0026rsquo;t even recall being at the Dojo for the last\nthirty minutes. To the best of his knowledge, it was presently lunchtime\nat Furinkan High.\u003c/p\u003e\n\u003cp\u003eRanma\u0026rsquo;s musings were interrupted by two familiar voices coming from\nwithin the cemetery. For some strange reason, Ranma\u0026rsquo;s brain decided to\nkick in and realized something strange was going on. The female voice he\nheard was definitely Ukyo\u0026rsquo;s. The weird part was the male voice. He could\nswear it was\u0026hellip;himself.\u003c/p\u003e\n\u003cp\u003eConfused, Ranma leaps over the wall and crosses to a nearby tree.\nSeveral yards away, he sees Ukyo, and surprisingly, himself! They are in\nfront of a grave, and Ukyo seems to be comforting Ranma for some reason.\nDeciding that discretion was the better part of valor, Ranma decided to\nspy on this impostor. Concealing himself in the nearby shrubbery, he\nlistened in to their conversation.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You\u0026rsquo;re doing it again, Ranchan. You keep blaming yourself for what\nhappened. Year after year for five years now we\u0026rsquo;ve been coming here, and\nyou still haven\u0026rsquo;t forgiven yourself.\u0026rdquo; Ukyo\u0026rsquo;s voice came to the (hidden)\nRanma\u0026rsquo;s ears. \u0026ldquo;What?\u0026rdquo; Ranma said to himself, \u0026ldquo;Ukyo\u0026rsquo;s known this impostor\nfor years? Whose grave is this anyway?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThen he heard the impostor\u0026rsquo;s voice, as clear as his own. \u0026ldquo;You\u0026rsquo;re\nright Ucchan\u0026hellip;I just can\u0026rsquo;t help but remember what she meant to me\u0026hellip;\u0026rdquo;\nShe? Ranma wondered to himself.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Come on, Ranchan. It\u0026rsquo;s time to go. Time to move on.\u0026rdquo; Ukyo said,\nmoving away with the impostor.\u003c/p\u003e\n\u003cp\u003ePuzzled, Ranma steps out of the shadows after they leave, then\nwalks over and inspects the grave they were visiting.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I..it can\u0026rsquo;t be\u0026hellip;\u0026rdquo;, he said, shocked, \u0026ldquo;A\u0026ndash;Akane Tendo\u0026hellip;died age\nseventeen\u0026hellip;\u0026rdquo;. Ranma\u0026rsquo;s brain, which normally could not handle anything\nmore complicated than one of Ryoga\u0026rsquo;s schemes, was working overtime. He\nhad just been with Akane about an hour ago, insulting her cooking. How\ncould she be dead, with her grave here for the past five years? And who\nwas that impostor?\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Only one person can explain what\u0026rsquo;s going on here,\u0026rdquo; Ranma muttered\nto himself, \u0026ldquo;Either that or she\u0026rsquo;s behind it all.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eWith that in mind, Ranma ran off in the direction of the\nNekohanten.\u003c/p\u003e\n\u003cp\u003eTo find it no longer there. This was even more of a visual shock\nfor Ranma, as it meant he couldn\u0026rsquo;t get free food there anymore. Besides\nthat, he had just eaten at the Nekohanten this morning! Something strange\nwas definitely going on.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Looking for someone, son-in-law?\u0026rdquo; a familiar old voice came from a\nnearby rooftop.\u003c/p\u003e\n\u003cp\u003eRanma leapt up to the rooftop and found Cologne there. At least she\nstill looked the same, if everything else in Nerima had gone crazy.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What\u0026rsquo;s going on, old ghoul?\u0026rdquo; Ranma spat out.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ah, son-in-law, you are as impolite as ever, in any time.\u0026rdquo; Cologne\nremarked, \u0026ldquo;And to think I came all the way from China to visit you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;China? What were you doing in China? Where\u0026rsquo;s the Nekohanten? What\ndo you mean in any time? And what the hell happened to Akane?\u0026rdquo; Ranma\nindignantly shot back.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;One question at a time, Ranma.\u0026rdquo; Cologne pulls out a folded\nnewspaper from within here robes. \u0026ldquo;Here\u0026rdquo;, she said, passing the paper to\nRanma, \u0026ldquo;read it, and tell me what date it is.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;November 16\u0026hellip;1999?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That is correct, son-in-law. You have traveled in time, and you\nare now five years into the future.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Time travel? But how? Why?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Stop blabbering for a while and listen to me, boy.\u0026rdquo; Cologne said,\n\u0026ldquo;You don\u0026rsquo;t have much time.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Okay.\u0026rdquo; Enough time for what?\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Five years ago, you and Shampoo were sucked into a temporal rift\nnear Furinkan High. You ended up five years in the future, as you are\nnow. However, in that future, Shampoo was dead, her body found after she\nhad mysteriously vanished for months. When you and Shampoo talked to the\nUkyo Kuonji from that time, she said she had also traveled to the future\nwith Ranma five years before, and she had seen a timeline where she had\ndied. Apparently, in that other time, the same thing that happened to\nShampoo happened to Ukyo instead. With their knowledge of their future,\nRanma and Shampoo came back, and Shampoo\u0026rsquo;s death was averted. Instead of\nShampoo, however, it was Akane Tendo who met their fate.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? How could all this be happening?\u0026rdquo; Ranma said, confused.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I believe it has something to do with the temporal rift five years\nago, son-in-law. After that experience and with the death of Akane Tendo,\nShampoo withdrew her claim to you out of respect for her, and we moved\nback to China. The present-day Shampoo told me to meet you here so that I\ncould tell you all this. I believe that some force at this time, but not\nnecessarily in this timeline, is trying to get you, but someone else\nalways gets in the way.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma tried to follow all this, failed, tried again, and finally\ngot it right. \u0026ldquo;How can I stop this? If this is the third time it\u0026rsquo;s\nhappened, even if I save Akane in the past, it\u0026rsquo;ll happen to someone else,\nright?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;There is a chance, son-in-law. You yourself must face whatever\nfate it was that would have fallen upon Ukyo, Shampoo, and now, Akane.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Can you help me?\u0026rdquo; Ranma said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m afraid not, for in this timeline, you are a temporal anomaly,\nso you can \u0026ldquo;Shift\u0026rdquo; back to your time easily, while I cannot. You are\nalone this time, son-in-law.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma just nodded gravely.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;One more thing\u0026rdquo;, Cologne added, \u0026ldquo;when Shampoo came back from her\ntemporal journey, she was very disoriented and could barely remember what\nhad happened in the past, and she was beaten and bruised. This could help\nyou find out who\u0026rsquo;s responsible.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Waitaminute!\u0026rdquo; Ranma said, \u0026ldquo;If Ukyo and Shampoo were with me when\nthey time-traveled, then this time\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026hellip;Akane Tendo would have made the journey with you.\u0026rdquo; Cologne\nended. \u0026ldquo;That is correct, son-in-law. You must find her, before any danger\ncomes to her. You might even figure out what\u0026rsquo;s going on.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;One last thing, \u0026quot; Ranma said, as the ghoul prepared to hop away,\n\u0026ldquo;If I do manage to prevent Akane\u0026rsquo;s death, then this timeline is\ndestroyed? Do you all die?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I don\u0026rsquo;t know son-in-law.\u0026rdquo; Cologne replied, \u0026ldquo;We might cease to\nexist, or just go on as if nothing happened. We don\u0026rsquo;t truly understand\nthe intricacies of time.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Thanks, ghoul. Gotta go!\u0026rdquo; Ranma said, heading for the Dojo. If\nAkane was in this timeline, she would head straight for the Dojo. And who\nknows how her old man would react!\u003c/p\u003e\n\u003cp\u003eIn the meantime, Akane was having troubles of her own. She had\nsuddenly found herself wandering on some street after eating her lunch.\nMaybe Ranma was right\u0026hellip;maybe her cooking did have hallucinogenic\neffects, she thought. That thought had quickly fled her mind and she\nrushed to the Dojo to find out what\u0026rsquo;s going on.\u003c/p\u003e\n\u003cp\u003eWhen she got there, everyone seemed shocked to see her, as if she\nhad come back from the dead or something. Even more shocking was when\nthey told her she did come back from the dead!\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you mean I died five years ago?!\u0026rdquo;, she asked, incredulous,\nwhile trying to shake a crying Soun off her leg, \u0026ldquo;Is this some sort of\nsick joke ?\u0026rdquo;, she said, pointedly looking at Nabiki.\u003c/p\u003e\n\u003cp\u003eNabiki looked hurt, \u0026ldquo;It\u0026rsquo;s not like we would fake your death\nAkane\u0026hellip;the body was there, we all saw it\u0026hellip;Ranma couldn\u0026rsquo;t stop crying\nfor weeks\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026hellip;\u0026rdquo; she said, turning to him, \u0026ldquo;were you really worried about\nme?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Akane\u0026hellip;\u0026rdquo; the purple-shirted Ranma said, \u0026ldquo;I\u0026hellip;I always regret not\nhaving told you before\u0026hellip;but I want you to know that I\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe red-shirted Ranma Saotome had watched Akane enter the Dojo, but\nhad carefully concealed himself on a nearby rooftop. As he watched the\npurple-shirted Ranma hug Akane closely, he shifted a bit and considered\nrevealing himself and explaining everything.\u003c/p\u003e\n\u003cp\u003eBut he knew no one would listen to him anyway, particularly\nhimself. He just had to wait until he could talk to Akane alone.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026rdquo;, Akane said, breaking the hug, \u0026ldquo;I\u0026rsquo;m confused\u0026hellip;just this\nmorning I was at school\u0026hellip;at Furinkan\u0026hellip;how could I have died five years\nago?\u0026rdquo; She looked at everyone for an explanation.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, Akane\u0026rdquo;, Nabiki said, \u0026ldquo;It seems that five years ago, you and\nRanma vanished in flash of light near Furinkan\u0026hellip;when Ranma came back, he\nhad no memory of what happened\u0026hellip;and when you came back a week later, you\nwere near death\u0026hellip;we couldn\u0026rsquo;t save you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I\u0026rsquo;m sorry Akane\u0026rdquo;, Ranma said, \u0026ldquo;If only I had done something back\nthen\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh! My Daughter!!! My Long-Lost Daughter!!!\u0026rdquo;, Soun wailed.\u003c/p\u003e\n\u003cp\u003eRanma had caught enough of the conversation to understand what had\nhappened. He and Akane had leapt forward five years into the future, and\nAkane did not come back alive from the encounter\u0026hellip;which meant that\nsometime between now and their going back to the past, something bad\nwould happen to Akane. He would have to stop whatever it was that was\ngoing to happen\u0026hellip;but what was it? And why did it also happen to Shampoo\nand Ukyo?\u003c/p\u003e\n\u003cp\u003eLater that night, when Akane was about to go to sleep in her newly-\nrefurbished room, she heard a knock on her door.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Come in\u0026rdquo;, she said.\u003c/p\u003e\n\u003cp\u003eRanma, still wearing the same purple shirt, came in, and sat down\nnext to Akane on her bed.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you want?\u0026rdquo; she said, a bit annoyed.\u003c/p\u003e\n\u003cp\u003eRanma held her hand. \u0026ldquo;I just wanted to see if you were okay\u0026hellip;\u0026rdquo; he\ntrailed off.\u003c/p\u003e\n\u003cp\u003eAkane was a bit surprised that he held her hand, \u0026ldquo;Sorry\u0026rdquo;, she said,\n\u0026ldquo;didn\u0026rsquo;t mean to snap at you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma squeezed her hand gently, and she squeezed it back.\u003c/p\u003e\n\u003cp\u003eOutside Akane\u0026rsquo;s bedroom window, Ranma-chan, wearing a wet red\nshirt, was watching them. He waited until the purple-shirted Ranma had\nleft the room.\u003c/p\u003e\n\u003cp\u003eAkane sighed as Ranma left the room. Then she heard a slight\ntapping on her window. When she turned to look, she was surprised to see\na very wet Ranma-chan, in a red shirt, hanging outside her windowsill,\nasking to come in.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma!\u0026rdquo; she said, opening the window and letting him in,\n\u0026ldquo;wha\u0026hellip;how did you get there? I\u0026hellip;we were just\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Shh\u0026hellip;\u0026rdquo;, Ranma said, putting a finger to his lips, \u0026ldquo;Keep quiet and\nI\u0026rsquo;ll explain.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Okay\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You notice how we were in school today, and suddenly you found\nyourself somewhere else?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yeah, I was wondering what happened\u0026hellip;but nobody here could\nexplain it\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, I can. Listen\u0026hellip;\u0026rdquo; Ranma proceeded to tell her Cologne\u0026rsquo;s\nstory.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You really expect me to believe something like that?\u0026rdquo; Akane said,\n\u0026ldquo;Cologne must have been joking or something.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;There\u0026rsquo;s no other explanation Akane. The Nekohanten wasn\u0026rsquo;t there\nthis afternoon, but it was definitely there when I had breakfast this\nmorning.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You mean you had breakfast with Shampoo?!\u0026rdquo; Akane shouted, \u0026ldquo;What\ndid you think you were doing?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe red-shirted Ranma heard footsteps coming and threw himself\noutside the window and flipped up to the roof.\u003c/p\u003e\n\u003cp\u003eThe purple-shirted Ranma and Kasumi opened Akane\u0026rsquo;s door and rushed\ninto the room.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What is it, Akane?\u0026rdquo; Kasumi said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Is there anything wrong?\u0026rdquo; Ranma said, his concern showing, \u0026ldquo;We\nheard you shout and\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;N\u0026hellip;no, it\u0026rsquo;s okay. I, um, just saw a mouse, that\u0026rsquo;s all\u0026hellip;yeah\nthat\u0026rsquo;s it.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh my, a rodent!\u0026rdquo; Kasumi said, \u0026ldquo;I\u0026rsquo;ll have to call some\nexterminators!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Uh, that\u0026rsquo;s okay Kasumi\u0026rdquo;, Akane stammered, \u0026ldquo;I threw it out of the\nhouse.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Okay\u0026rdquo;, Ranma said, stepping out of the room, \u0026ldquo;You sure you\u0026rsquo;ll be\nall right?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Sure\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma and Kasumi left and locked the door behind them.\u003c/p\u003e\n\u003cp\u003eAkane went to the window and looked up. \u0026ldquo;It\u0026rsquo;s okay\u0026rdquo;, she whispered\nto the moon, \u0026ldquo;You can come out now.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe red-shirted Ranma flipped back into Akane\u0026rsquo;s room.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;That was close\u0026rdquo;, Ranma said, \u0026ldquo;we can\u0026rsquo;t let them know who we really\nare. They\u0026rsquo;d never believe it. I know I wouldn\u0026rsquo;t.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026rdquo;, Akane said, \u0026ldquo;If that other person is really you, in the\nfuture, do you and him have the same, um, feelings? About us, I mean?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;There\u0026rsquo;s no time for this Akane\u0026rdquo;, Ranma said, a bit embarrassed, \u0026ldquo;I\nhave to go and figure out who or what is up to this\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What?\u0026rdquo; Akane said, \u0026ldquo;You\u0026rsquo;ll leave me here?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You should be safe here, Akane. They can protect you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I can take care of myself.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I know, Akane, you\u0026rsquo;re a martial artist too, and all that.\u0026rdquo; Ranma\nresponded, \u0026ldquo;but whatever it is that hits us here, is going to kill you.\nAnd I can\u0026rsquo;t risk that happening.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I gotta go. I\u0026rsquo;ll come back when I\u0026rsquo;ve figured out what to do.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma stepped out of the window and was about to leap into the yard\nwhen he heard Akane scream.\u003c/p\u003e\n\u003cp\u003eRanma turned around and saw a weird sight. A blue-violet haze was\nforming in Akane\u0026rsquo;s room and there were blue tendrils of energy grabbing\nonto her.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Akane!\u0026rdquo; Ranma shouted, echoed by another voice from the hallway.\u003c/p\u003e\n\u003cp\u003eRanma tried to stop the pulsating blue trails of energy but he was\ngrabbed in mid-air and both the red-shirted Ranma Saotome and Akane Tendo\nvanished into the vortex.\u003c/p\u003e\n\u003cp\u003eThe purple-shirted Ranma Saotome crashed through Akane\u0026rsquo;s room to\nfind a small energy vortex shrinking out of sight.\u003c/p\u003e\n\u003cp\u003ePart Four\u003c/p\u003e\n\u003cp\u003eAkane found herself conscious and tried to move. Unfortunately, her\nhands wouldn\u0026rsquo;t agree with her. They were tied up for the moment,\nliterally. She was in a small room and tied to a pole. The building\nlooked old, as if it would fall down any second. Numerous crates were\nlocated in the room. She heard a familiar voice.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;He got you too, huh?\u0026rdquo; Ukyo\u0026rsquo;s voice came from behind her.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ukyo!\u0026rdquo; Akane turned to see Ukyo and Shampoo also tied up, all\nthree of them around the pole. \u0026ldquo;Who did this to us?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ai ya!\u0026rdquo; Shampoo remarked, \u0026ldquo;Violent girl not know? It was\u0026ndash;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eShampoo\u0026rsquo;s sentence was cut short by a small maroon projectile sent\nhurtling through the far wall. Instead of crashing into the crates,\nhowever, the maroon blur stopped itself in mid-air and settled down on\nits feet.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Still can\u0026rsquo;t beat me Ranma m\u0026rsquo;boy!\u0026rdquo; Akane recognized the voice; it\nwas\u0026hellip;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Happosai!\u0026rdquo; Akane said, surprised, \u0026ldquo;So you were behind all this!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ai len!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma had emerged from the hole Happosai had made through the far\nwall. He was burning red with battle aura. His clothes were torn in\nseveral places and he had a bruise on his right arm.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;This ain\u0026rsquo;t over yet, you old freak!\u0026rdquo; Ranma spat out.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You\u0026rsquo;re right, Ranma!\u0026rdquo; Happosai gloated, \u0026ldquo;You still have to bring\nme more girlies!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Bring\u0026hellip;?\u0026rdquo;, Akane said, \u0026ldquo;Ranma, you\u0026hellip;!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No, Akane\u0026rdquo;, Ukyo said, \u0026ldquo;it\u0026rsquo;s not his fault\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What do you mean, oh!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eRanma and Happosai had decided to resume their hostilities, and\nthey were moving at incredible speeds. Ranma was dishing out low-level ki\nbursts to Happosai at maximum speed. Happosai, however, managed to dodge\neach and every one.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Enough playing around, Ranma\u0026rdquo;, Happosai said, landing on a crate,\n\u0026ldquo;You\u0026rsquo;ve got work to do!\u0026rdquo; Suddenly, Ranma noticed a blue sapphire Happosai\nwore on his neck. The gem glinted a bit and then blue energy formed in\nfront of Happosai.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Time Flare!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan look out!\u0026rdquo;, Ukyo shouted.\u003c/p\u003e\n\u003cp\u003eToo late. A pulsating blue energy burst flew towards Ranma. Ranma\nleapt out of the way, but the blast followed him and enveloped him. A\nbright light formed around him and he vanished.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma!\u0026rdquo; Akane shouted, \u0026ldquo;What did you do to him?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Why, sent him back in time, of course!\u0026rdquo; Happosai said gleefully,\n\u0026ldquo;So he can bring back more girls!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What? Where\u0026hellip;when are we anyway?\u0026rdquo; Akane said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;In your future, of course\u0026rdquo;, Happosai said, as if Akane would\nunderstand immediately. When he saw she didn\u0026rsquo;t he elaborated, \u0026ldquo;Five years\nto be exact.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Why are you doing this to us?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh, dear Akane, you don\u0026rsquo;t know how terrible it\u0026rsquo;s been!\u0026rdquo; Happosai\nwhimpered, latching himself unto Akane\u0026rsquo;s chest, \u0026ldquo;Allow me a moment in\nyour bosom to tell my tale.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAkane fumed a bit, but realizing there was nothing she could do,\nnodded. \u0026ldquo;Go on.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You see, in this future, my future, I had accidentally killed you\nall when I discovered the powers of this\u0026rdquo;, Happosai pointed to the gem\nlaced around his neck. \u0026ldquo;This\u0026rdquo;, he continued, \u0026ldquo;is the TimeStone. It allows\nsomeone to displace another person through time! So, using the powers of\nthe Stone, I sent Ranma to the past, knowing that there\u0026rsquo;d be girls around\nhim for sure, and then I moved him five years into the future, and then\nshifted him to this future!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What! You pervert!\u0026rdquo; Akane shouted, \u0026ldquo;You\u0026rsquo;re doing all this just so\nyou can harass some girls?!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You don\u0026rsquo;t understand, Akane\u0026rdquo;, Happosai continued, \u0026ldquo;In this future,\nthe Time Stone gives me incredible powers, and I\u0026rsquo;m close to becoming all-\npowerful. However, I need to be in the presence of pretty ladies to be\neffective! I drain their youthful energy to become stronger. So I used\nRanma as a temporal female magnet!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Wait\u0026rdquo;, Ukyo said, whereupon Happosai immediately leapt off Akane\nand glomped onto Ukyo\u0026rsquo;s chest.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Yes?\u0026rdquo; Happosai said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Thanks, Ukyo\u0026rdquo;, Akane smiled.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Grr\u0026hellip;anyway, if all this is true, how come Ranma didn\u0026rsquo;t tell us\nwhen we time-traveled?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Well, you see, when I shoot him back in time, his mind also goes\nback in time. He only remembers what\u0026rsquo;s going on when he gets back here.\u0026rdquo;\nHapposai explained.\u003c/p\u003e\n\u003cp\u003eSo that\u0026rsquo;s it, Akane thought. \u0026ldquo;But wait\u0026rdquo;, she interrupted, \u0026ldquo;In the\nother timelines, Shampoo and Ukyo managed to survive. That means Ranma\u0026rsquo;s\ngoing to beat you!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No way, girl!\u0026rdquo; Happosai laughed, \u0026ldquo;Those weren\u0026rsquo;t my timelines. They\nwere just branch-offs that resulted from Ranma\u0026rsquo;s perpetual time-jumping.\nWhy, you\u0026rsquo;re already the third batch of girls here!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What! Where are the others then.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I sent them back, of course. I can\u0026rsquo;t use them anymore after I\u0026rsquo;ve\nrun them out of energy. In that state, they\u0026rsquo;re already near-death.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You monster!\u0026rdquo; Akane said, realizing why the other Ukyo, Shampoo\nand Akane had died.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Nothing can stop me, Akane-chan!\u0026rdquo; Happosai said, glomping on Akane\nagain, \u0026ldquo;Nothing.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Perhaps you are right. Perhaps not.\u0026rdquo; The voice came from somewhere\noutside the building.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;What the\u0026ndash;?!\u0026rdquo;, Happosai said, \u0026ldquo;That voice\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You are indeed a menace, in any time, Happy.\u0026rdquo; The small figure\nsaid as it came into the building.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ai ya! Great-grandmother!\u0026rdquo; Shampoo said.\u003c/p\u003e\n\u003cp\u003eThe figure was indeed, Cologne, carrying her staff around her. \u0026ldquo;You\ndidn\u0026rsquo;t think I\u0026rsquo;d come along with Ranma, did you?\u0026rdquo; Cologne said, \u0026ldquo;It\u0026rsquo;s\nover Happosai. Surrender the TimeStone!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;To you? Ha!\u0026rdquo;, Happosai snickered, \u0026ldquo;I killed you months ago, and\nI\u0026rsquo;ll kill you again !\u0026rdquo; Happosai leapt towards her.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;We\u0026rsquo;ll see\u0026rdquo;, Cologne said, also leaping towards Happosai.\u003c/p\u003e\n\u003cp\u003eThe battle began.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan!\u0026rdquo; Ukyo said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Huh?\u0026rdquo; Akane said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ai len!\u0026rdquo; Shampoo said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Shh\u0026rdquo;, Ranma said, \u0026ldquo;Cologne and I heard everything. Relax, I\u0026rsquo;ll get\nyou all free.\u0026rdquo; He started to work on the ropes.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Elemental Storm!\u0026rdquo; Happosai shrieked, creating a powerful hurricane\nwithin the building. The roof was blown off and lightning and thunder\ncrashed across the sky. He extended his battle aura into the hurricane,\nlighting the night with energy.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Hiryu Shoten Ha!\u0026rdquo; Cologne countered with the Dragon Cyclone, and\nsoon the area was filled with a storm of lightning and flame.\u003c/p\u003e\n\u003cp\u003eRanma, Akane, Shampoo and Ukyo were struggling to stay standing in\nthe midst of the powerful display of energy.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Sorry, Cologne\u0026rdquo;, Happosai said, momentarily halting the Elemental\nStorm, \u0026ldquo;I have to send you back now. You just weren\u0026rsquo;t good enough.\u0026rdquo; The\ngem around Happosai\u0026rsquo;s neck glowed with power and pulsating blue energy\ngathered around his body.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;No!\u0026rdquo; Ranma said, gathering his ki, \u0026ldquo;Mokou Takabishya!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe ki bolt hit Happosai from behind and disrupted his Time Flare.\nCologne, however, was exhausted and landed on the ground, breathing hard.\nHapposai turned his attention on Ranma.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;All right, then\u0026rdquo;, Happosai said, gathering his energy again, \u0026ldquo;You\nfirst. Time Flare!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThe pulsating blue energy bolt leapt towards Ranma. Ranma was\nexpecting it and leapt high into the air. Th bolt turned before hitting\nthe girls and was close behind him.\u003c/p\u003e\n\u003cp\u003eRanma twisted in mid-air and made a dive for Happosai. The energy\nbolt turned and followed.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Kachu Tenshin Amaguriken Maximum!\u0026rdquo; Ranma said, bringing his fists\ninto Happosai.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;You can\u0026rsquo;t beat me, boy!\u0026rdquo; Happosai said, blocking all 23,000\nattacks. Suddenly Ranma turned sharply and leapt away.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Scared you, didn\u0026rsquo;t I\u0026ndash;Ahh!! No!!!\u0026rdquo;, Happosai\u0026rsquo;s words were cut off\nby the blue energy bolt that slammed into him. The energy bolt had failed\nto turn and had collided with Happosai, enveloping him with pulsating\nblue energy. Happosai faded out of sight. \u0026ldquo;I\u0026rsquo;ll be back \u0026hellip; \u0026quot; his voice\ntrailed off. The TimeStone glistened then fell off his disappearing neck.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Not bad, son-in-law.\u0026rdquo; Cologne said. They had recovered from the\nbattle and were studying the TimeStone left behind.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;So, how do we get back?\u0026rdquo; Ranma said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;This TimeStone is said to be unique throughout all of time. If we\ndestroy it here and now, all other traces of it across time and space\nshall be destroyed as well.\u0026rdquo; Cologne said, \u0026ldquo;In which case Happosai would\nnever have found it in the first place.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Wait\u0026rdquo;, Akane cut in, \u0026ldquo;What about us? And all those alternate\ntimelines? If Happosai never found it, we shouldn\u0026rsquo;t be here, right?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s a temporal paradox\u0026rdquo;, Cologne explained, \u0026ldquo;Once we destroy this\nStone, we, and all the alternate timelines, will cease to exist. The day\nwill go on as if something never happened. And we will have no memory of\nwhat happened.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh\u0026hellip;\u0026rdquo; Akane said, sounding disappointed. She turned to her\nfiancee. \u0026ldquo;Ranma, what I asked you back in my bedroom\u0026hellip;?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Um, well\u0026hellip;\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Enough fooling around\u0026rdquo;, Cologne said, smashing the TimeStone to\nbits, \u0026ldquo;Let\u0026rsquo;s go.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eAnd there was a flash of light.\u003c/p\u003e\n\u003cp\u003ePart Five\u003c/p\u003e\n\u003cp\u003eIt was the usual lunchtime scenario at the Furinkan High cafeteria.\nVarious students were in various states of gobbling. One particular\nstudent, however, was trying to avoid his lunch. This student, Ranma\nSaotome, had concealed himself behind the cafeteria doors in hopes of\navoiding the \u0026ldquo;lunch\u0026rdquo; his \u0026ldquo;fiancee\u0026rdquo; had prepared for him. It wasn\u0026rsquo;t\nexactly normal behavior for such a boy to avoid free food, but the\nfiancee in question was one Akane Tendo, and her cooking could be used as\nnuclear weaponry if only the government realized it.\u003c/p\u003e\n\u003cp\u003eAnother fiancee, however, managed to spot him. This time it was\nokay.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranchan! I brought you some okonomiyaki!\u0026rdquo;, Ukyo Kuonji\u0026rsquo;s voice\ncame to Ranma\u0026rsquo;s ears, and Ranma thankfully accepted the okonomiyaki.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Thanks Ucchan\u0026rdquo;, he said between gobbles.\u003c/p\u003e\n\u003cp\u003eSuddenly the nearby wall started to break down.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Oh no\u0026hellip;\u0026rdquo;, Ranma said.\u003c/p\u003e\n\u003cp\u003eA purple-haired young girl carrying a delivery tray smashed through\nthe wall and deftly pushed Ukyo away from Ranma.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma, I cook special deluxe ramen for ai len!\u0026rdquo; Shampoo said,\nglomping onto Ranma.\u003c/p\u003e\n\u003cp\u003eAll this had not gone unnoticed to Akane Tendo, and right now she\nwas emanating an incredibly red battle aura.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma\u0026hellip;\u0026rdquo; she began, rather furiously, \u0026ldquo;How dare you eat their\ncooking, and refuse mine!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Look, Akane\u0026rdquo;, Ranma said, pushing off Shampoo, \u0026ldquo;In case you\nhaven\u0026rsquo;t noticed, a garbage can would be a better alternative than your\ncooking!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ranma you jerk!\u0026rdquo; Akane screamed, sending Ranma into LEO at the\nsame time.\u003c/p\u003e\n\u003cp\u003eRanma landed in the Nekohanten\u0026rsquo;s trash can. Cologne fished him out.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Having trouble with your girlfriends, son-in-law?\u0026rdquo; Cologne said.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I am not your son-in-law!\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eSomewhere in China\u0026hellip;\u003c/p\u003e\n\u003cp\u003eThe Jusenkyo guide looked out of his window to see a bright blue\nlight form over Jusenkyo. The light quickly vanished and a small figure\nof a man hurtled towards the cursed springs.\u003c/p\u003e\n\u003cp\u003eThe Guide rushed to the pools and saw a small frog hop out of a\nnearby pool.\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Aw, too bad.\u0026rdquo;, the Guide said in his weird voice and accent, \u0026ldquo;You\nfall into Spring of Drowned Frog. Very tragic story of frog that drown\nthere seven hundred year ago.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;Ribbit.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ndash;End\u0026ndash;\u003c/p\u003e\n\u003chr\u003e\n\u003ch2 id=\"-----------------------------------------------authors-witty-repartee---\"\u003e\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026mdash;\u0026ndash;Author\u0026rsquo;s Witty Repartee\u0026mdash;\u003c/h2\u003e\n\u003cp\u003eThis fic is weird. I wrote this after watching some weird time loop\nTV show I couldn\u0026rsquo;t place. Anyway, it\u0026rsquo;s really my first fic, so if you\nwanna say anything \u0026lsquo;bout it, send stuff to the Nikholas F. Toledo\naddress. If is suck, say so, if I don\u0026rsquo;t you can say that too. Oh yeah,\nplease check for misspellings or grammar errors or whatever. I am not\n\u0026ldquo;SWITCH\u0026rdquo; OK? I\u0026rsquo;m just using his address. Oh yeah, could people please\nwrite more weird time travel thingies. I\u0026rsquo;m kinda sick and tired of all\nthe herbs and spices plots, and I kinda like pointing out continuity\nfaults. BTW, does anybody think Ukyou can beat Kunou in combat?\u003c/p\u003e\n\u003ch2 id=\"this-fic-was-written-in-1994\"\u003eNotes (07/04/2003)\nThis fic was written in 1994!\u003c/h2\u003e\n\u003cp\u003eVECTOR (aka roytang)\u003c/p\u003e\n",
            "summary": "Ranma 1/2 and all associated characters, places and events are undoubtedly property of the esteemed Rumiko Takahashi, and any attempts to claim otherwise shall be attended with accordingly.\n Nikholas F. Toledo Fanfic Group presents\n Time and Time Again by VECTOR\n Part One\nIt was the usual lunchtime scenario at the Furinkan High cafeteria. Various students were in various states of gobbling. One particular student, however, was trying to avoid his lunch.",
            "date_published": "1997-01-01T00:00:00+00:00",
            "date_modified": "2019-10-19T04:36:23+08:00",
            "section": "fiction",
            "source_path": "fiction/fanfic/ranma_time_again.md"
            , "tags": ["fanfiction"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-31/",
            "url": "https://mirror.roytang.net/otd/12-31/",
            "path": "/otd/12-31/",
            "title": "On This Day for 12-31",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-31T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-31.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-30/",
            "url": "https://mirror.roytang.net/otd/12-30/",
            "path": "/otd/12-30/",
            "title": "On This Day for 12-30",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-30T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-30.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-29/",
            "url": "https://mirror.roytang.net/otd/12-29/",
            "path": "/otd/12-29/",
            "title": "On This Day for 12-29",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-29T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-29.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-28/",
            "url": "https://mirror.roytang.net/otd/12-28/",
            "path": "/otd/12-28/",
            "title": "On This Day for 12-28",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-28T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-28.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-27/",
            "url": "https://mirror.roytang.net/otd/12-27/",
            "path": "/otd/12-27/",
            "title": "On This Day for 12-27",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-27T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-27.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-26/",
            "url": "https://mirror.roytang.net/otd/12-26/",
            "path": "/otd/12-26/",
            "title": "On This Day for 12-26",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-26T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-26.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-25/",
            "url": "https://mirror.roytang.net/otd/12-25/",
            "path": "/otd/12-25/",
            "title": "On This Day for 12-25",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-25T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-25.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-24/",
            "url": "https://mirror.roytang.net/otd/12-24/",
            "path": "/otd/12-24/",
            "title": "On This Day for 12-24",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-24T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-24.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-23/",
            "url": "https://mirror.roytang.net/otd/12-23/",
            "path": "/otd/12-23/",
            "title": "On This Day for 12-23",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-23T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-23.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-22/",
            "url": "https://mirror.roytang.net/otd/12-22/",
            "path": "/otd/12-22/",
            "title": "On This Day for 12-22",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-22T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-22.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-21/",
            "url": "https://mirror.roytang.net/otd/12-21/",
            "path": "/otd/12-21/",
            "title": "On This Day for 12-21",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-21T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-21.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-20/",
            "url": "https://mirror.roytang.net/otd/12-20/",
            "path": "/otd/12-20/",
            "title": "On This Day for 12-20",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-20T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-20.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-19/",
            "url": "https://mirror.roytang.net/otd/12-19/",
            "path": "/otd/12-19/",
            "title": "On This Day for 12-19",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-19T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-19.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-18/",
            "url": "https://mirror.roytang.net/otd/12-18/",
            "path": "/otd/12-18/",
            "title": "On This Day for 12-18",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-18T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-18.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-17/",
            "url": "https://mirror.roytang.net/otd/12-17/",
            "path": "/otd/12-17/",
            "title": "On This Day for 12-17",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-17T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-17.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-16/",
            "url": "https://mirror.roytang.net/otd/12-16/",
            "path": "/otd/12-16/",
            "title": "On This Day for 12-16",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-16T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-16.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-15/",
            "url": "https://mirror.roytang.net/otd/12-15/",
            "path": "/otd/12-15/",
            "title": "On This Day for 12-15",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-15T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-15.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-14/",
            "url": "https://mirror.roytang.net/otd/12-14/",
            "path": "/otd/12-14/",
            "title": "On This Day for 12-14",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-14T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-14.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-13/",
            "url": "https://mirror.roytang.net/otd/12-13/",
            "path": "/otd/12-13/",
            "title": "On This Day for 12-13",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-13T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-13.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-12/",
            "url": "https://mirror.roytang.net/otd/12-12/",
            "path": "/otd/12-12/",
            "title": "On This Day for 12-12",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-12T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-12.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-11/",
            "url": "https://mirror.roytang.net/otd/12-11/",
            "path": "/otd/12-11/",
            "title": "On This Day for 12-11",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-11T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-11.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/otd/12-10/",
            "url": "https://mirror.roytang.net/otd/12-10/",
            "path": "/otd/12-10/",
            "title": "On This Day for 12-10",
            "content_html": "",
            "summary": "",
            "date_published": "1980-12-10T00:00:00+00:00",
            "date_modified": "2020-06-25T21:03:06+08:00",
            "section": "otd",
            "source_path": "otd/12-10.md"
            
            
            
            
            }
        
    ]
     , "prev": "/p/353/feed.json" 
     , "next": "/p/355/feed.json" 
}