{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2019/11/hong-kong-revolution-of-our-time/",
            "url": "https://mirror.roytang.net/2019/11/hong-kong-revolution-of-our-time/",
            "path": "/2019/11/hong-kong-revolution-of-our-time/",
            "title": "Hong Kong: The Revolution of Our Time",
            "content_html": "\u003cp\u003eHong Kong is on fire.\u003c/p\u003e\n\u003cp\u003eFor months now, protests and unrests, led mainly by university students, have \u003ca href=\"https://en.wikipedia.org/wiki/2019_Hong_Kong_protests\"\u003ewracked the city.\u003c/a\u003e Initially in response to a controversial China-backed extradition bill, it is also believed to be fueled by political and social inequality and interference by the Chinese government. As the months went on, the stakes have escalated in the wake of widespread anger at the way the police are brutally cracking down on protests. Many incidents of violence have been reported, mainly from the police, but some from the protestors as well.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not from Hong Kong, but I admit some fondness for the British territory - I\u0026rsquo;ve \u003ca href=\"/tags/hong-kong\"\u003etravelled there a few times\u003c/a\u003e and I worked for a Hong-Kong based company for more than a decade, so I know quite a number of people working there even now. I was hesitant to write down my thoughts on the current crisis, as things were moving and escalating quickly, and there was a good chance that whatever I write might be overtaken by events.\u003c/p\u003e\n\u003cp\u003eI stand in support of the protestors, and I am hopeful that they succeed, although I am not optimistic. They are standing against China, the fascist juggernaut of the modern world, and the odds of victory are low. This week, the police have laid siege to university campuses, and recently the \u003ca href=\"https://www.smh.com.au/world/asia/hong-kong-university-campus-like-a-warzone-as-night-time-battle-breaks-out-20191113-p53a1f.html\"\u003epolice have evacuated mainland students\u003c/a\u003e from HK, which seems to me as an indication that we are nearing some kind of tipping point, something akin to 1989\u0026rsquo;s Tiananmen massacre.\u003c/p\u003e\n\u003cp\u003eThe international response has been tepid at best, although both houses of the US legislature have passed or are preparing resolutions condemning the police brutality. Private companies have been embroiled in controversy for censoring efforts to voice support for the protestors, in a blatant example of how capitalism will not stand in support of freedom if it contradicts the bottom line. The gamer-relevant example is of course Blizzard, who suspended and censored Hearthstone pro Blitzchung for delivering this post\u0026rsquo;s title during a livestream.\u003c/p\u003e\n\u003cp\u003eThe Hong Kong protests are perhaps a microcosm of many of the problems faced by modern society: inequality, authoritarianism, state surveillance, police brutality, the indifference of capitalism, and even China itself. As the decade winds to a close, perhaps the HK revolution and its eventual outcome (whether that be the successful repression of the protests by China or a full-blown rebellion) provide a stark preview of what to expect in the decade to come. Indeed, Hong Kong is the revolution of our time.\u003c/p\u003e\n",
            "summary": "Hong Kong is on fire.\nFor months now, protests and unrests, led mainly by university students, have wracked the city. Initially in response to a controversial China-backed extradition bill, it is also believed to be fueled by political and social inequality and interference by the Chinese government. As the months went on, the stakes have escalated in the wake of widespread anger at the way the police are brutally cracking down on protests.",
            "date_published": "2019-11-15T00:00:00+00:00",
            "date_modified": "2019-11-23T05:46:16+08:00",
            "section": "post",
            "source_path": "post/2019/11/hong-kong-revolution-of-our-time/index.md"
            , "tags": ["current events","hong kong"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1195160540429066241/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1195160540429066241#favorited-by-825037256",
                    "source_file": "like-20191115T032755-webmention-724458.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/tales-from-p2p/",
            "url": "https://mirror.roytang.net/2019/11/tales-from-p2p/",
            "path": "/2019/11/tales-from-p2p/",
            "title": "Tales from a P2P Bus",
            "content_html": "\u003cp\u003eIt\u0026rsquo;s a lot more uncommon for me to go to places like Ortigas or Makati nowadays, but when I do I almost always take the P2P bus. The P2P (Point-to-Point) buses were introduced in Metro Manila I think around late 2015/early 2016, as a pricier alternative to the usual city buses. The fares are more expensive, but the buses are also much more comfortable and they don\u0026rsquo;t make stops along their route, only at the endpoints, so their travel time is faster compared to the usual city buses.\u003c/p\u003e\n\u003cp\u003eDuring a recent P2P trip, the bus driver had another person with him that he mentioned was an \u0026ldquo;apprentice\u0026rdquo;, basically a new hire that was shadowing him to learn the route. During the 45 minute ride, the two of them talked quite a bit about the P2P business model (from the POV of the driver/employee of course). I learned some interesting things so I thought I\u0026rsquo;d write about it. All of these points I just overheard from the two so maybe take it with a grain of salt especially in regards to accuracy of numbers etc.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe more senior driver had only been in this job since July, but he seemed very satisfied with how much he was earning.\u003c/li\u003e\n\u003cli\u003eUnlike regular drivers and their boundary system, P2P drivers are salaried, with a daily salary of around P700 + P150 allowance. They are required to render 8 hrs/day for their daily pay.\u003c/li\u003e\n\u003cli\u003eThey are given an incentive based on the number of people they carry over a day. The example given was if you manage to ferry 225 people in one day, you get a P300 incentive; 300 people is a P500 incentive, and so on. From what I gather, 300 riders is already very high for a single day. The senior driver says this route is comparatively better than the other route (also from the same general endpoint), since that other route is longer and it\u0026rsquo;s harder to meet the incentives.\u003c/li\u003e\n\u003cli\u003eThey also have overtime pay, around P85-P100 per hour (the two had conflicting info).\u003c/li\u003e\n\u003cli\u003eThe more senior driver says the job is pretty good, \u003cem\u003e\u0026ldquo;basta masipag ka.\u0026quot;\u003c/em\u003e He always drives as many trips as he could to get as much overtime as possible; he sometimes finishes at 11pm, then just eats and goes home to sleep. \u003cem\u003e\u0026ldquo;Wala naman akong libangan\u0026rdquo;\u003c/em\u003e, he says. (This saddened me a bit.)\u003c/li\u003e\n\u003cli\u003eThe senior driver mentioned that they get paid on the 10th and the 25th, but there\u0026rsquo;s also a daily salary?? I think like maybe the allowance is given daily because he said \u0026ldquo;hindi ka magugutom kasi may pera araw-araw\u0026rdquo; or maybe the incentive is given daily? The overtime pay he has to file his extra hours, so that\u0026rsquo;s not a daily thing.\u003c/li\u003e\n\u003cli\u003eThe senior driver says that his last overtime filing was for 100+ hours. At P100/hour that\u0026rsquo;s more than P10K, so not bad.\u003c/li\u003e\n\u003cli\u003eThe senior driver says in this job, your driver\u0026rsquo;s license is much \u0026ldquo;safer\u0026rdquo; than a regular city bus driving job. He claims the traffic authorities \u003cem\u003enever\u003c/em\u003e apprehend P2P drivers. Presumably because it\u0026rsquo;s a government project? The apprentice says \u003cem\u003e\u0026ldquo;ah kaya pala hindi ka nagseseatbelt\u0026rdquo;\u003c/em\u003e, and the senior driver says yes, he never wears the seat belt, even when there\u0026rsquo;s a cop standing right in front of the bus. By contrast, if a cop spotted any normal city bus driver without a seat belt, that would be an automatic infraction.\u003c/li\u003e\n\u003cli\u003eGiven the economics of his job, the senior driver says he doesn\u0026rsquo;t feel the need to compete with the city bus drivers (\u003cem\u003e\u0026ldquo;hindi na ko nakikipaggitgitan\u0026rdquo;\u003c/em\u003e), and his drive is more relaxed since he doesn\u0026rsquo;t have to worry about picking up passengers etc. \u003cem\u003e\u0026ldquo;Parang naglalaro lang.\u0026quot;\u003c/em\u003e\u003c/li\u003e\n\u003cli\u003eThe apprentice used to work as a 10-wheeler truck driver (hauling cargo). He says the pay was a bit higher in his last job, but they didn\u0026rsquo;t give him benefits (overtime, SSS, philhealth, etc). This seems illegal to me??\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eObviously I\u0026rsquo;m not from the same economic bracket as those targetted to work in this occupation, but it seems like a pretty good gig, compared to normal city bus driver jobs at least. I\u0026rsquo;m glad the economics are working out for both the drivers and the service providers, as the P2P buses are a pretty good alternative option for those who can afford it.\u003c/p\u003e\n",
            "summary": "It\u0026rsquo;s a lot more uncommon for me to go to places like Ortigas or Makati nowadays, but when I do I almost always take the P2P bus. The P2P (Point-to-Point) buses were introduced in Metro Manila I think around late 2015/early 2016, as a pricier alternative to the usual city buses. The fares are more expensive, but the buses are also much more comfortable and they don\u0026rsquo;t make stops along their route, only at the endpoints, so their travel time is faster compared to the usual city buses.",
            "date_published": "2019-11-14T00:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/tales-from-p2p/index.md"
            , "tags": ["philippines"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194798433502150658/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-955453269727363072",
                    "source_file": "like-20191114T022705-webmention-724213.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-43804316",
                    "source_file": "like-20191114T035606-webmention-724215.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194798433502150658#favorited-by-262052694",
                    "source_file": "like-20191114T065947-webmention-724238.json"
                }, { 
                    "url": "https://twitter.com/mlq3/status/1194798749609943040",
                    "source_file": "repost-20191114T022705-webmention-724212.json"
                }, { 
                    "url": "https://twitter.com/hoco27/status/1194869181134409728",
                    "source_file": "repost-20191114T065947-webmention-724237.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1194525792778121216/",
            "url": "https://mirror.roytang.net/2019/11/1194525792778121216/",
            "path": "/2019/11/1194525792778121216/",
            "title": "",
            "content_html": "\u003cp\u003eHong Kong protests are in their fifth month despite an escalating crackdown. How? One surprising answer: the fate of China\u0026rsquo;s Uyghurs. Many talked to me about it. They watched and learned. They\u0026rsquo;ve decided that they \u0026ldquo;may as well go down fighting.\u0026rdquo; My latest. \u003ca href=\"https://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/\"\u003ehttps://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "Hong Kong protests are in their fifth month despite an escalating crackdown. How? One surprising answer: the fate of China\u0026rsquo;s Uyghurs. Many talked to me about it. They watched and learned. They\u0026rsquo;ve decided that they \u0026ldquo;may as well go down fighting.\u0026rdquo; My latest. https://www.theatlantic.com/international/archive/2019/11/escalating-violence-hong-kong-protests/601804/",
            "date_published": "2019-11-13T08:01:56+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1194525792778121216/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194525792778121216/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/sql-dying-art/",
            "url": "https://mirror.roytang.net/2019/11/sql-dying-art/",
            "path": "/2019/11/sql-dying-art/",
            "title": "Is SQL a dying art?",
            "content_html": "\u003cp\u003eI was helping my brother check some database issues the other week, and he mentioned how impressed he was with how quickly I was able to come up with SQL queries on the fly. I told him that SQL was one of the skills I considered myself to have mastery over. This shouldn\u0026rsquo;t be surprising given my early career path:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003efor most of my first year working as a software developer, I was working on reports which involved lovingly handcrafted (and oftentimes quite complicated) SQL queries. And there was a lot of Oracle PL/SQL too\u003c/li\u003e\n\u003cli\u003eby my second year, I was already conducting SQL training for new hires in the company\u003c/li\u003e\n\u003cli\u003eby my third year and onwards, I was already regularly asked to help other projects with their SQL performance issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMost of my experience was with Oracle SQL, but as the ANSI standard has evolved quite well, the knowledge translates well to other databases. (Maybe not the PL/SQL though.)\u003c/p\u003e\n\u003cp\u003eThese days I feel like SQL knowledge has become a much rarer skill among developers, chiefly for 2-3 reasons:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe introduction and widespread use of tools like frameworks with ORMs and business intelligence software, minimizing the amount of SQL that needs to be hand-written in most applications\u003c/li\u003e\n\u003cli\u003ethe modern software development stack is much more complicated than it used to be, particularly for web development. When I started out, almost everybody was a \u0026ldquo;full stack engineer\u0026rdquo;, and that meant having to be familiar with most technologies you were using, including the database layer. These days, for any nontrivial project, developers on a team will often need to be specialized, with many working only on frontend issues, some on backend, and any SQL or stored procedure work is handled by a specialist developer or a DBA.\u003c/li\u003e\n\u003cli\u003ea possible secondary reason is the rise of alternative data storage solutions such as NoSQL databases.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRealistically, the need for people who can write good SQL may never go away, but the poor of people who can do so may be getting smaller due to the reasons above. Well, maybe it\u0026rsquo;s a good thing for me, since scarcity means it may become a more valuable skill as time goes on!\u003c/p\u003e\n",
            "summary": "I was helping my brother check some database issues the other week, and he mentioned how impressed he was with how quickly I was able to come up with SQL queries on the fly. I told him that SQL was one of the skills I considered myself to have mastery over. This shouldn\u0026rsquo;t be surprising given my early career path:\n for most of my first year working as a software developer, I was working on reports which involved lovingly handcrafted (and oftentimes quite complicated) SQL queries.",
            "date_published": "2019-11-13T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/sql-dying-art/index.md"
            , "tags": ["software development","sql"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194436027081019406/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/prod-crisis/",
            "url": "https://mirror.roytang.net/2019/11/prod-crisis/",
            "path": "/2019/11/prod-crisis/",
            "title": "What to do in a production crisis",
            "content_html": "\u003cp\u003eDespite our best efforts as software developers, it can still happen: production goes down. Or some sort of bug introduces catastrophic data error. Hopefully you have a support/DevOps team to handle the response. If not, the dev team themselves have to step in. This usual means a mad rush to figure out what happened and how to fix it, sometimes during off hours and maybe even into the early morning, all while facing pressure from clients and higher-ups. I was advising another developer in such a situation a while back, and it was his first stint as technical lead so he was extra worried. I gave him a few tips to see him through the time of crisis.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eKeep calm. In Tagalog, \u003ca href=\"/2019/04/project-management-tip-kalma-lang/\"\u003ekalma lang\u003c/a\u003e. In a crisis, there can be a lot of stress and pressure to fix things immediately. It\u0026rsquo;s best to keep a level head and make sure the team is keeping it together. Don\u0026rsquo;t let your emotions carry you away, and try to avoid panic.\u003c/li\u003e\n\u003cli\u003eSolve one problem at a time until you can go home. This is a lesson from the movie \u003ca href=\"/2015/10/10154142633048912/\"\u003eThe Martian\u003c/a\u003e. In a crisis it can be difficult to focus on the task at hand and if you\u0026rsquo;re not thinking straight you might just charge in there blindly and move things around until things get better. Follow step #1, then figure out what are the most pressing problems that need to be solved immediately, then address them one at a time. It can also help your team morale to identify which issues can be left until the next day. This gives them a concrete sense of what is set of problems to focus on, and motivates them to solve those so they can go home.\u003c/li\u003e\n\u003cli\u003eBe extra careful. In times like these, you may find yourself needing to deploy hotfixes directly to production or maybe even update data directly in the production database, in the interest of expediency. It\u0026rsquo;s also during times like these that you are more likely to make a mistake, especially if your team is under stress and working overtime/during off hours. So it would pay to be extra careful, maybe add an additional layer of review before deploying things directly to production. You\u0026rsquo;re already in a crisis, don\u0026rsquo;t make things worse by making a sloppy mistake.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eHaving to provide tech support during such a crisis is something you shouldn\u0026rsquo;t wish on any developer, but sometimes it can\u0026rsquo;t be avoided. (Some might even consider it a kind of rite of passage so to speak). Make sure to have the right mindset to be able to operate well under such stressful conditions.\u003c/p\u003e\n",
            "summary": "Despite our best efforts as software developers, it can still happen: production goes down. Or some sort of bug introduces catastrophic data error. Hopefully you have a support/DevOps team to handle the response. If not, the dev team themselves have to step in. This usual means a mad rush to figure out what happened and how to fix it, sometimes during off hours and maybe even into the early morning, all while facing pressure from clients and higher-ups.",
            "date_published": "2019-11-12T00:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/prod-crisis/index.md"
            , "tags": ["software development"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1194052290363232257/"}]
            
            , "comments": [
                { 
                    "url": "https://lostfocus.de/2019/11/23923/",
                    "source_file": "comment-20191112T084315-webmention-723389.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1194052290363232257#favorited-by-2251223190",
                    "source_file": "like-20191113T022938-webmention-723865.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1193936749342277639/",
            "url": "https://mirror.roytang.net/2019/11/1193936749342277639/",
            "path": "/2019/11/1193936749342277639/",
            "title": "",
            "content_html": "\u003cp\u003eShould really be going to sleep, but I\u0026rsquo;m really enjoying reading the release notes for Mystery Booster lol\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\"\u003ehttps://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThoughts on the set: it\u0026rsquo;s clearly meant to be drafted for fun, don\u0026rsquo;t worry so much about the \u0026ldquo;value\u0026rdquo;, unless it turns out to be horribly overpriced\u003c/p\u003e\n",
            "summary": "Should really be going to sleep, but I\u0026rsquo;m really enjoying reading the release notes for Mystery Booster lol\nhttps://magic.wizards.com/en/articles/archive/feature/mystery-booster-release-notes-2019-11-11\nThoughts on the set: it\u0026rsquo;s clearly meant to be drafted for fun, don\u0026rsquo;t worry so much about the \u0026ldquo;value\u0026rdquo;, unless it turns out to be horribly overpriced",
            "date_published": "2019-11-11T17:01:17+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1193936749342277639/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193936749342277639/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/anime-op/",
            "url": "https://mirror.roytang.net/2019/11/anime-op/",
            "path": "/2019/11/anime-op/",
            "title": "Anime Opening/Ending Themes",
            "content_html": "\u003cp\u003eHad a friendly discussion last night about our favorite anime theme music, figured I\u0026rsquo;d share some of my favorites. J-Pop in general and anime theme music in particular have a kind of energy that you just don\u0026rsquo;t get from Western music. I think that generally I tend to favor those that openings for series that I had a chance to watch on TV (instead of via streaming/online channels), since back in those days I had to sit through the openings! (So most of these are rather old!)\u003c/p\u003e\n\u003cp\u003eKimi Ga Suki da to Sakebitai from Slam Dunk by Baad:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/7qLwmho_240\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eHohoemi no Bakudan from Yu Yu Hakusho by Matsuko Mawatari:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/IEjRBJChZMA\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003e1/3 no Junjou na Kanjou from Rurouni Kenshin by Siam Shade:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/rzziisIJudY\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003e(RK in particular had a lot of tracks I liked, but let\u0026rsquo;s limit it to one per series)\u003c/p\u003e\n\u003cp\u003eChala Head Chala from Dragonball Z by Hironobu Kageyama:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/pYnLO7MVKno\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eWe Are! from One Piece by Hiroshi Kitadani:\u003c/p\u003e\n\u003cdiv style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden;\"\u003e\n  \u003ciframe src=\"https://www.youtube.com/embed/ZwXKz2CeHwY\" style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%; border:0;\" allowfullscreen title=\"YouTube Video\"\u003e\u003c/iframe\u003e\n\u003c/div\u003e\n\u003cp\u003eThat\u0026rsquo;s all for now! Here\u0026rsquo;s a \u003ca href=\"https://open.spotify.com/playlist/1aUsKTSASpG2jPSDSzVICw\"\u003espotify playlist\u003c/a\u003e if you\u0026rsquo;re into that sort of thing.\u003c/p\u003e\n",
            "summary": "Had a friendly discussion last night about our favorite anime theme music, figured I\u0026rsquo;d share some of my favorites. J-Pop in general and anime theme music in particular have a kind of energy that you just don\u0026rsquo;t get from Western music. I think that generally I tend to favor those that openings for series that I had a chance to watch on TV (instead of via streaming/online channels), since back in those days I had to sit through the openings!",
            "date_published": "2019-11-11T05:07:32+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/anime-op/index.md"
            , "tags": ["anime","music"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193770770398400512/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1193558150223261697/",
            "url": "https://mirror.roytang.net/2019/11/1193558150223261697/",
            "path": "/2019/11/1193558150223261697/",
            "title": "",
            "content_html": "",
            "summary": "",
            "date_published": "2019-11-10T15:56:52+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1193558150223261697/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193558150223261697/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/indieweb/",
            "url": "https://mirror.roytang.net/2019/11/indieweb/",
            "path": "/2019/11/indieweb/",
            "title": "Indieweb Updates and Thoughts",
            "content_html": "\u003cp\u003eI \u003ca href=\"/2019/07/move-fast-break-things/\"\u003ementioned before\u003c/a\u003e that I was looking into indieweb stuff. There\u0026rsquo;s a \u003ca href=\"https://indieweb.org/\"\u003ewhole wiki of information\u003c/a\u003e about it if you\u0026rsquo;re into that sort of thing, but also \u003ca href=\"https://www.jvt.me/posts/2019/10/20/indieweb-talk/\"\u003ehere\u0026rsquo;s a recent post\u003c/a\u003e which kind of serves as an overview. I have some comments on the content of this post, more on that \u003ca href=\"#later\"\u003elater\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eIndieweb things I\u0026rsquo;ve already implemented on this site:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehave a personal domain (\u003ca href=\"/2006/02/welcome-to-roytang-net/\"\u003esince 2006\u003c/a\u003e)\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://microformats.io/\"\u003emicroformats\u003c/a\u003e (h-card and h-feeds and h-entrys), though I would have to be using some sort of microformats reader to make sure everything there is hunky-dory (no concrete plans for this yet)\u003c/li\u003e\n\u003cli\u003ewebmention support, via \u003ca href=\"https://webmention.io/\"\u003ewebmention.io\u003c/a\u003e. Of course, I\u0026rsquo;m not actually interacting with anyone else on the indieweb yet, so this is mostly experimental and untested.\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://indieweb.org/POSSE\"\u003ePOSSE\u003c/a\u003e (partially): blog posts are syndicated to Twitter and Mastodon, but I\u0026rsquo;m also still posting content on those platforms (and to Instagram)\u003c/li\u003e\n\u003cli\u003eowning my content: (almost) all posts I make to other social media channels now get backfed into the \u003ca href=\"/2019/10/archive-of-my-own/\"\u003earchive on this site\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThings I hope to be able to implement (no timetable):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePOSSE (full) - currently for notes and photos I still mostly post using Twitter and Instagram because their native posting features are more convenient (especially on mobile) compared to my current workflow of \u0026ldquo;push a markdown file to git\u0026rdquo;. This is largely contingent on me implementing the next item:\u003c/li\u003e\n\u003cli\u003eA web interface for posting to the site. A web interface should be sufficient convenient for mobile use. Optionally using the next item:\u003c/li\u003e\n\u003cli\u003eMicropub. I\u0026rsquo;m still iffy whether I really need the protocol. It could be handy in certain situations.\u003c/li\u003e\n\u003cli\u003eI\u0026rsquo;ve also been \u003ca href=\"https://mastodon.technology/@roytang/102954512082445097\"\u003edigging into ActivityPub\u003c/a\u003e lately. My hope is to eventually have this site itself serve as an ActivityPub server, such that one would be able to follow me on Mastodon via something like \u003ca href=\"mailto:roy@roytang.net\"\u003eroy@roytang.net\u003c/a\u003e. Similar to how \u003ca href=\"https://aaronparecki.com/aaronpk\"\u003eAaron Parecki has done it\u003c/a\u003e. I\u0026rsquo;ve already done some exploratory work on this but it might be a ways off (low priority I guess.)\u003c/li\u003e\n\u003cli\u003eArchive Mastodon posts into this site (this is kinda ironic for some reason)\u003c/li\u003e\n\u003cli\u003eAutomatic sending out of webmentions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca id=\"later\"\u003e#\u003c/a\u003e Anyway, back to the post I linked above. My main criticism for the indieweb movement at the moment is that I don\u0026rsquo;t see a path to mass adoption, especially for the purposes of moving people away from silos like Facebook. Maybe that\u0026rsquo;s not really one of the goals. My main issue is with two of the principles outlined in the post above (read the post again for more details):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u0026ldquo;Make What You Need / Scratch Your Itch\u0026rdquo;\u003c/li\u003e\n\u003cli\u003e\u0026ldquo;Use What You Make / Dogfood\u0026rdquo;\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe thing about these concepts is that there is a lot of work involved and there are significant barriers to entry for getting involved. I mean, most people aren\u0026rsquo;t going to (won\u0026rsquo;t be able to) bother with the first step (getting your own domain), much more be able to \u0026ldquo;make what you need\u0026rdquo;. It\u0026rsquo;s ok for people like me who are comfortable with the highly technical and have a bunch of free time, but for the average person it seems unlikely.\u003c/p\u003e\n\u003cp\u003eI can imagine there might be created a service that supports most of the Indieweb features and can easily be adopted by the mass market, although that has a lot of its own challenges as well, and it\u0026rsquo;s kind of like replacing one kind of silo with another? At least it would be a more open silo I guess? I think \u003ca href=\"https://micro.blog/\"\u003emicro.blog\u003c/a\u003e already supports the indieweb stuff, but I haven\u0026rsquo;t yet looked too closely into that.\u003c/p\u003e\n\u003cp\u003eI am still moving forward with the indieweb stuff, and I am hopeful that it manages to coalesce into something that can challenge the way the modern internet works, but that may be a long way off. As far as I can tell, adoption is not yet very widespread, and AFAICT the main people driving the effort with their \u003ca href=\"https://indieweb.org/events/2019-11-13-homebrew-website-club\"\u003eHomebrew Website Clubs\u003c/a\u003e are in Western countries. It\u0026rsquo;s even possible that I\u0026rsquo;m the first in the Philippines looking into this Indieweb stuff. :)\u003c/p\u003e\n",
            "summary": "I mentioned before that I was looking into indieweb stuff. There\u0026rsquo;s a whole wiki of information about it if you\u0026rsquo;re into that sort of thing, but also here\u0026rsquo;s a recent post which kind of serves as an overview. I have some comments on the content of this post, more on that later.\nIndieweb things I\u0026rsquo;ve already implemented on this site:\n have a personal domain (since 2006) microformats (h-card and h-feeds and h-entrys), though I would have to be using some sort of microformats reader to make sure everything there is hunky-dory (no concrete plans for this yet) webmention support, via webmention.",
            "date_published": "2019-11-10T15:00:00+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "post",
            "source_path": "post/2019/11/indieweb/index.md"
            , "tags": ["tech life","meta","changelog"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193551787376156672/"}]
            
            , "comments": [
                { 
                    "url": "https://stream.jeremycherfas.net/2019/good-work-so-far-as-you-note",
                    "source_file": "comment-20191110T153701-webmention-722915.json"
                }, { 
                    "url": "http://known.kevinmarks.com/2019/hello-and-welcome-to-the-indieweb",
                    "source_file": "comment-20191110T153800-webmention-722916.json"
                }, { 
                    "url": "https://www.jvt.me/mf2/2019/11/w4tgj/",
                    "source_file": "comment-20191110T211800-webmention-723052.json"
                }, { 
                    "url": "https://janboddez.tech/notes/946613625",
                    "source_file": "comment-20191111T092014-webmention-723186.json"
                }, { 
                    "url": "https://beko.famkos.net/2019/11/11/microformat-parser/",
                    "source_file": "comment-20191111T102301-webmention-723190.json"
                }, { 
                    "url": "https://twitter.com/NurseMcHurt/status/1193962253445414913",
                    "source_file": "comment-20191111T185234-webmention-723280.json"
                }, { 
                    "url": "https://gregorlove.com/2019/11/hello-and-welcome/",
                    "source_file": "comment-20191111T185755-webmention-723281.json"
                }, { 
                    "url": "https://boffosocko.com/2019/11/11/indieweb-updates-and-thoughts-roy-tang/",
                    "source_file": "comment-20191111T224645-webmention-723306.json"
                }, { 
                    "url": "https://simply.micro.jenett.org/2019/11/11/20:50:10/",
                    "source_file": "comment-20191112T015018-webmention-723325.json"
                }, { 
                    "url": "https://grant.codes/2019/11/11/11-00-37",
                    "source_file": "like-20191111T110047-webmention-723194.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-2691886662",
                    "source_file": "like-20191111T195013-webmention-723291.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-1154684923",
                    "source_file": "like-20191111T195014-webmention-723292.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-5398102",
                    "source_file": "like-20191111T211331-webmention-723300.json"
                }, { 
                    "url": "https://twitter.com/roytang/status/1193551787376156672#favorited-by-2868925860",
                    "source_file": "like-20191111T234435-webmention-723317.json"
                }, { 
                    "url": "https://blog.voss.co/2019/indieweb-updates-and-thoughts-middot-roy-tang",
                    "source_file": "like-20191115T235212-webmention-724735.json"
                }, { 
                    "url": "https://hub.iwebthings.com/simply-micro-2019-11-11-205010/",
                    "source_file": "like-20200114T225333-webmention-744477.json"
                }, { 
                    "url": "https://twitter.com/kevinmarks/status/1193553850424266757",
                    "source_file": "repost-20191110T154940-webmention-722920.json"
                }, { 
                    "url": "https://twitter.com/tchambers/status/1193667075757281281",
                    "source_file": "repost-20191110T233837-webmention-723088.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4op_a_h17a/",
            "url": "https://mirror.roytang.net/2019/11/b4op_a_h17a/",
            "path": "/2019/11/b4op_a_h17a/",
            "title": "",
            "content_html": "\u003cp\u003eFirst #ps4 purchase for the year #pickups\u003c/p\u003e\n",
            "summary": "First #ps4 purchase for the year #pickups",
            "date_published": "2019-11-09T07:08:35+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4op_a_h17a/index.md"
            , "tags": ["ps4","pickups"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1193062813448785920/"},{"type":"instagram","url":"https://instagram.com/p/B4op_a_h17a/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/so-good-they-cant-ignore-you/",
            "url": "https://mirror.roytang.net/2019/11/so-good-they-cant-ignore-you/",
            "path": "/2019/11/so-good-they-cant-ignore-you/",
            "title": "Book Review: So Good They Cant Ignore You by Cal Newport",
            "content_html": "\u003cp\u003eAha! I finally managed to finish a book again!\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;ve heard of Cal Newport since years ago tangentially due to his Study Hacks blog, which was pretty good at the time. I haven\u0026rsquo;t followed his career too closely, but he\u0026rsquo;s an academic at Georgetown apparently. I wasn\u0026rsquo;t looking for any career advice in particular, but I did have a recommendation for this book from somewhere so I thought I\u0026rsquo;d give it a go.\u003c/p\u003e\n\u003cp\u003eThe book is \u003cem\u003eSo Good They Can\u0026rsquo;t Ignore You\u003c/em\u003e, and focuses on what it takes to have a \u0026ldquo;successful career\u0026rdquo;.\u003c/p\u003e\n\u003cp\u003eMy favorite thing about this book is that from the get-go, the author discards something most self-improvement books focus on: passion. The author discards passion as non-essential. A lot of self-improvement books also lay out a bunch of principles and rules and wink at the reader and say something to the effect of \u0026ldquo;You just have to do all of this stuff, and you\u0026rsquo;ll be super successful!\u0026rdquo;, as if all of those rules + a bit of passion are some sort of secret ingredient that allow you to skip past all the hard work necessary to find success. This book doesn\u0026rsquo;t shy away from the concept of hard work. Instead, it embraces it, in the form of what the author calls \u0026ldquo;career capital\u0026rdquo;. Basically, you need to earn enough \u0026ldquo;career capital\u0026rdquo; in order to then exchange that capital for the trappings of a successful career, such as more control over your time. \u0026ldquo;Career capital\u0026rdquo; is what makes you \u0026ldquo;so good they can\u0026rsquo;t ignore you.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eLike many books of this type, the ideas are presented as if the author came by them scientific analysis, but really the basis seems to be a series of anecdotal success stories of people whose career paths coincide with the author\u0026rsquo;s central thesis. This is not inherently a bad thing, though it does weaken the foundation of the books claims that it\u0026rsquo;s not backed by a detailed scientific study. But for purposes of laying out his ideas in an entertaining manner, the format is certainly sufficient. The success stories are really the meat of the book, designed to lay out the author\u0026rsquo;s rules and show how they are applicable to real, actual careers. And in most of the success stories, he traces their story for more than a decade of building up \u0026ldquo;career capital\u0026rdquo;, again emphasizing hard work over dreaming of overnight success.\u003c/p\u003e\n\u003cp\u003eI personally relate to the concept of not being defined by passion and instead working hard to earn \u0026ldquo;career capital\u0026rdquo; and the idea that you can cash that capital in for more control. This mirrors my own career path where I spent more than a decade working for some multinational company, not really specializing in anything in particular and developing a variety of interests before deciding to use that career capital to go freelance and establish more control over my life. What I don\u0026rsquo;t have yet, is the overarching \u0026ldquo;mission\u0026rdquo; described by the author\u0026rsquo;s Rule #4. I don\u0026rsquo;t have a unifying vision driving my life forward, probably a result of my being very \u003ca href=\"/2019/11/unfocused/\"\u003eunfocused\u003c/a\u003e. Or perhaps I already have one and it is yet to be clearly articulated? Hmm, we\u0026rsquo;ll see. In any case, I find the book\u0026rsquo;s contents quite relevant to my own career and the ideas presented here will probably be relevant to me personally as I try to crystallize my own plans for the future.\u003c/p\u003e\n\u003cp\u003eThe book is a relatively short (Kindle version says 276 pages, and a lot of that is notes and links) and a quick read (I finished it piecemeal over 3 days, but could have easily finished in 1). I think I got it on sale a few months ago for around $4, not bad for that price, and a decent pickup for anyone looking to chart a clearer career path.\u003c/p\u003e\n",
            "summary": "Aha! I finally managed to finish a book again!\nI\u0026rsquo;ve heard of Cal Newport since years ago tangentially due to his Study Hacks blog, which was pretty good at the time. I haven\u0026rsquo;t followed his career too closely, but he\u0026rsquo;s an academic at Georgetown apparently. I wasn\u0026rsquo;t looking for any career advice in particular, but I did have a recommendation for this book from somewhere so I thought I\u0026rsquo;d give it a go.",
            "date_published": "2019-11-09T00:00:00+00:00",
            "date_modified": "2021-03-28T22:48:00+08:00",
            "section": "post",
            "source_path": "post/2019/11/book-review-so-good-they-cant-ignore-you/index.md"
            , "tags": ["books","review"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192987972989325312/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1192929877449527298/",
            "url": "https://mirror.roytang.net/2019/11/1192929877449527298/",
            "path": "/2019/11/1192929877449527298/",
            "title": "",
            "content_html": "\u003cp\u003eThe weight of last night’s decisions bear heavily upon me\u003c/p\u003e\n",
            "summary": "The weight of last night’s decisions bear heavily upon me",
            "date_published": "2019-11-08T22:20:21+00:00",
            "date_modified": "2019-11-19T07:20:58+00:00",
            "section": "notes",
            "source_path": "notes/2019/11/1192929877449527298/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192929877449527298/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/removed-webfont/",
            "url": "https://mirror.roytang.net/2019/11/removed-webfont/",
            "path": "/2019/11/removed-webfont/",
            "title": "",
            "content_html": "\u003cp\u003eFontAwesome has been fun and all, but in the interest of reducing load time and external dependencies, I removed the FA dependency on this blog and switched to SVG icons instead. Icons are from \u003ca href=\"http://svgicons.sparkk.fr/\"\u003ehere\u003c/a\u003e, specifically the \u003ca href=\"https://dribbble.com/shots/1934932-77-Essential-Icons-Free-Download\"\u003eset by Bryn Taylor\u003c/a\u003e and the Special Social Icon Set #9. Not all the icons carried over, especially some of the social ones (Mastodon, etc). Workarounds had to be made. Hopefully nothing breaks!\u003c/p\u003e\n",
            "summary": "FontAwesome has been fun and all, but in the interest of reducing load time and external dependencies, I removed the FA dependency on this blog and switched to SVG icons instead. Icons are from here, specifically the set by Bryn Taylor and the Special Social Icon Set #9. Not all the icons carried over, especially some of the social ones (Mastodon, etc). Workarounds had to be made. Hopefully nothing breaks!",
            "date_published": "2019-11-08T23:18:49+08:00",
            "date_modified": "2019-11-08T23:22:40+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/removed-webfont.md"
            , "tags": ["meta","changelog"]
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/unfocused/",
            "url": "https://mirror.roytang.net/2019/11/unfocused/",
            "path": "/2019/11/unfocused/",
            "title": "Unfocused",
            "content_html": "\u003cp\u003eI am envious sometimes of people who are able to narrow down their interests to a specific scope, it\u0026rsquo;s kind of like a lot of their decisions are made easier. Consider a person whose only hobby/interest is something like sports (not necessarily all sports, or just one sport, just sports in general).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003elooking for something to do in your spare time? Sports!\u003c/li\u003e\n\u003cli\u003ewant to watch something on TV? Sports!\u003c/li\u003e\n\u003cli\u003epicking up a newspaper, but don\u0026rsquo;t have much time to read? Sports section!\u003c/li\u003e\n\u003cli\u003eneed a small talk topic? Sports!\u003c/li\u003e\n\u003cli\u003edo your social media posts have a focused topic? Sports!\u003c/li\u003e\n\u003cli\u003ewant to start a blog/podcast/youtube channel and need a topic? Sports!\u003c/li\u003e\n\u003cli\u003egiving a TED talk? Sports!\u003c/li\u003e\n\u003cli\u003ewant to write a book? Sports!\u003c/li\u003e\n\u003cli\u003ewant to learn something new? Find a new sport!\u003c/li\u003e\n\u003cli\u003eneed an advocacy? Find something related to sports!\u003c/li\u003e\n\u003cli\u003ewant to play video games? Sports games!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e(\u0026ldquo;Sports\u0026rdquo; is just an example, it might as well be \u0026ldquo;arts and crafts\u0026rdquo; or \u0026ldquo;birdwatching\u0026rdquo; or something else.)\u003c/p\u003e\n\u003cp\u003eCompare that with someone like myself, who has like a bajillion hobbies/interests, if I needed to think about things like the above, I would have to choose among topics like (in no particular order, and non extensive):\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003esoftware development (this already covers a lot of subtopics by itself!)\u003c/li\u003e\n\u003cli\u003ethe tech industry\u003c/li\u003e\n\u003cli\u003estartups/entrepreneurship\u003c/li\u003e\n\u003cli\u003egeneral science/advances in science\u003c/li\u003e\n\u003cli\u003egaming (pc, console, handheld, boardgames, esports)\u003c/li\u003e\n\u003cli\u003egame design/development\u003c/li\u003e\n\u003cli\u003emagic the gathering\u003c/li\u003e\n\u003cli\u003ebooks (sci-fi, fantasy)\u003c/li\u003e\n\u003cli\u003ecomics (marvel, dc, manga, webcomics, etc)\u003c/li\u003e\n\u003cli\u003ewriting\u003c/li\u003e\n\u003cli\u003eart/drawing/sketching\u003c/li\u003e\n\u003cli\u003epolitics/current events\u003c/li\u003e\n\u003cli\u003ejokes/puns\u003c/li\u003e\n\u003cli\u003eblogging\u003c/li\u003e\n\u003cli\u003emyths and legends/history\u003c/li\u003e\n\u003cli\u003einternet subculture/memes/shitposting\u003c/li\u003e\n\u003cli\u003etrivia\u003c/li\u003e\n\u003cli\u003eself-improvement/productivity/optimization\u003c/li\u003e\n\u003cli\u003egeneral pop/geek culture (movies/tv)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe wide variety of interests makes it more difficult to stay focused on and specialize in a particular niche. This blog is a great example: it\u0026rsquo;s not the sort of thing that is difficult to monetize or focus into a large audience because I tend to write about a lot of things and no one thing in particular. I\u0026rsquo;ve tried spinning off separate blogs that focus on particular topics only: I\u0026rsquo;ve started an MtG-focused blog and a comic-book focused blog. I can put in the effort for these things because I do have interest, but because of the wide variety of interests, my focus on each one inevitably waxes and wanes, and when I look away from those particular niches to focus on other things for a while, those blogs suffer and eventually die.\u003c/p\u003e\n\u003cp\u003eI was thinking about this because the other day I was trying to sort/arrange my RSS feeds and I was like \u0026ldquo;Why am I following so many damn feeds?\u0026rdquo; and the answer was of course because I\u0026rsquo;m interested in so many things. I like reading things, but I also can\u0026rsquo;t read everything!\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not saying it\u0026rsquo;s a bad thing (or necessarily better or worse than a life with more focused interests!). But at best it\u0026rsquo;s a double-edged sword. It is difficult to find focus true, and one tends to jump from topic to topic at a moment\u0026rsquo;s notice. But there are a lot of perks as well. Life is almost always interesting, there is very little downtime, unless you choose it. There is always some event, some convention, some announcement, some new release to look forward to. Life is short and there is so much of it to appreciate and enjoy that for me personally it would feel like a waste to be so narrowly-focused. The world is huge and there is so much of it to embrace that it seems a shame to stay in one tiny corner of it for all your life.\u003c/p\u003e\n\u003cp\u003eI guess I will kind of just lean into it and enjoy the chaos it brings to life!\u003c/p\u003e\n",
            "summary": "I am envious sometimes of people who are able to narrow down their interests to a specific scope, it\u0026rsquo;s kind of like a lot of their decisions are made easier. Consider a person whose only hobby/interest is something like sports (not necessarily all sports, or just one sport, just sports in general).\n looking for something to do in your spare time? Sports! want to watch something on TV? Sports! picking up a newspaper, but don\u0026rsquo;t have much time to read?",
            "date_published": "2019-11-08T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/unfocused/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192676847038992390/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/python-yield/",
            "url": "https://mirror.roytang.net/2019/11/python-yield/",
            "path": "/2019/11/python-yield/",
            "title": "DevNotes: Python's yield",
            "content_html": "\u003cp\u003eI\u0026rsquo;ve been using Python for well over 10 years, and I still don\u0026rsquo;t have an intuitive mastery of one of its keywords: \u003ccode\u003eyield\u003c/code\u003e. Everytime I see it in someone\u0026rsquo;s code I need to stop and mentally remind myself what it does. I figured I\u0026rsquo;d write a devnote to help improve my recall.\u003c/p\u003e\n\u003cp\u003eTypically, \u003ccode\u003eyield\u003c/code\u003e is used in a function with a loop, like so:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003edef\u003c/span\u003e \u003cspan style=\"color:#a6e22e\"\u003esome_func\u003c/span\u003e(lim):\n    \u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e i \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e range(\u003cspan style=\"color:#ae81ff\"\u003e0\u003c/span\u003e, lim):\n        \u003cspan style=\"color:#66d9ef\"\u003eyield\u003c/span\u003e i\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003e\u003ccode\u003eyield\u003c/code\u003e means the function returns a \u0026ldquo;generator\u0026rdquo; that can be used as an iterable in a loop:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e val \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e some_func(\u003cspan style=\"color:#ae81ff\"\u003e5\u003c/span\u003e):\n    \u003cspan style=\"color:#66d9ef\"\u003eprint\u003c/span\u003e(val)\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eYou can also straight up convert the generator into a list via something like \u003ccode\u003elist(some_func(5))\u003c/code\u003e.\u003c/p\u003e\n\u003cp\u003eThe equivalent function, without using \u003ccode\u003eyield\u003c/code\u003e would be something like:\u003c/p\u003e\n\u003cdiv class=\"highlight\"\u003e\u003cpre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"\u003e\u003ccode class=\"language-python\" data-lang=\"python\"\u003e\u003cspan style=\"color:#66d9ef\"\u003edef\u003c/span\u003e \u003cspan style=\"color:#a6e22e\"\u003esome_func\u003c/span\u003e(lim):\n    result \u003cspan style=\"color:#f92672\"\u003e=\u003c/span\u003e []\n    \u003cspan style=\"color:#66d9ef\"\u003efor\u003c/span\u003e i \u003cspan style=\"color:#f92672\"\u003ein\u003c/span\u003e range(\u003cspan style=\"color:#ae81ff\"\u003e0\u003c/span\u003e, lim):\n        result\u003cspan style=\"color:#f92672\"\u003e.\u003c/span\u003eappend(i)\n    \u003cspan style=\"color:#66d9ef\"\u003ereturn\u003c/span\u003e result\n\u003c/code\u003e\u003c/pre\u003e\u003c/div\u003e\u003cp\u003eThis is definitely the kind of function I\u0026rsquo;ve written often! Now that I\u0026rsquo;ve actually written it down, \u003ccode\u003eyield\u003c/code\u003e is rather straightforward, and hopefully it can help me shorten some of the python code I\u0026rsquo;ll be writing in the future!\u003c/p\u003e\n",
            "summary": "I\u0026rsquo;ve been using Python for well over 10 years, and I still don\u0026rsquo;t have an intuitive mastery of one of its keywords: yield. Everytime I see it in someone\u0026rsquo;s code I need to stop and mentally remind myself what it does. I figured I\u0026rsquo;d write a devnote to help improve my recall.\nTypically, yield is used in a function with a loop, like so:\ndef some_func(lim): for i in range(0, lim): yield i yield means the function returns a \u0026ldquo;generator\u0026rdquo; that can be used as an iterable in a loop:",
            "date_published": "2019-11-07T00:00:00+00:00",
            "date_modified": "2020-09-16T14:57:40+08:00",
            "section": "post",
            "source_path": "post/2019/11/python-yield/index.md"
            , "tags": ["software development","devnotes"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192280118468792321/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/roytang/status/1192280118468792321#favorited-by-1000529293171150849",
                    "source_file": "like-20191107T233128-webmention-722387.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/dsg036/",
            "url": "https://mirror.roytang.net/2019/11/dsg036/",
            "path": "/2019/11/dsg036/",
            "title": "",
            "content_html": "\u003ch4 id=\"posted-on-ronepiece-found-these-in-storage-from-years-ago-forgot-where-i-got-them-idk-why-luffy-has-a-stickhttpsredditcomronepiececommentsdsg036found_these_in_storage_from_years_ago_forgot\"\u003ePosted on r/OnePiece: \u003ca href=\"https://reddit.com/r/OnePiece/comments/dsg036/found_these_in_storage_from_years_ago_forgot/\"\u003eFound these in storage from years ago. Forgot where I got them. IDK why Luffy has a stick.\u003c/a\u003e\u003c/h4\u003e\n",
            "summary": "Posted on r/OnePiece: Found these in storage from years ago. Forgot where I got them. IDK why Luffy has a stick. ",
            "date_published": "2019-11-06T21:03:01+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/dsg036/index.md"
            , "tags": ["onepiece"]
            , "syndicated": [{"type":"reddit","url":"https://reddit.com/r/OnePiece/comments/dsg036/found_these_in_storage_from_years_ago_forgot/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/handover-documentation/",
            "url": "https://mirror.roytang.net/2019/11/handover-documentation/",
            "path": "/2019/11/handover-documentation/",
            "title": "The Perils of Handover Documentation",
            "content_html": "\u003cp\u003eA while back I found myself having to figure out how to compile/build/run a mobile application. The developers previously assigned to the project were no longer available to consult with, but they did leave behind some documentation. However, their documentation quality left a lot to be desired. The instructions they left basically amounted to:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\u003ccode\u003enpm install\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eionic serve\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eionic codrova run android\u003c/code\u003e/\u003ccode\u003eios\u003c/code\u003e\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eOkay, first sign of trouble is that their instructions were basically commands that anyone who knew the app used Ionic would be able to Google. But ok, I gave this a shot, even though I had not used Ionic/Cordova before, I assumed the simple documentation meant it would be straightforward (spoiler: it was not).\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirst problem: \u003ccode\u003enpm install\u003c/code\u003e fails. Okaaaay. I dig around for a bit and figure out there\u0026rsquo;s an incompatibility between one of the packages and my node version (12). Some more digging around tells me that the previous developers likely were using Node 8. I switch to Node 8 and \u003ccode\u003enpm install\u003c/code\u003e finishes successfully, somehow.\u003c/li\u003e\n\u003cli\u003eSecond problem: \u003ccode\u003eionic serve\u003c/code\u003e throws an error from one of the dependencies. A bit more digging around. Reading ionic docs. Stackoverflow. Turns out there was some extra configuration needed to be added if you\u0026rsquo;re doing this stuff on Windows. (I later found out the previous developers had used Ubuntu.)\u003c/li\u003e\n\u003cli\u003eThird problem: \u003ccode\u003eionic serve\u003c/code\u003e throws a whole bunch of typescript errors. Why? After facepalming for a bit, I dig around again. And dig some more. Looks like dependency issues. But the \u003ccode\u003epackage.json\u003c/code\u003e has dozens of dependencies, it would take me forever to figure out the problem. I find myself digging through the repository\u0026rsquo;s commit history trying to figure out if there was a recent change to the \u003ccode\u003epackage.json\u003c/code\u003e that would cause the issue. What I notice instead is that a couple of weeks before the handover, someone deleted \u003ccode\u003epackage-lock.json\u003c/code\u003e from the repository for some unknown reason. Deciding to try it out, I restore the old version of \u003ccode\u003epackage-lock.json\u003c/code\u003e, do the whole \u003ccode\u003enpm install\u003c/code\u003e dance again, and sure enough the typescript errors vanish. But we\u0026rsquo;re not yet done.\u003c/li\u003e\n\u003cli\u003eFourth problem: \u003ccode\u003eionic serve\u003c/code\u003e no longer throws an error, but when it launches the browser, there\u0026rsquo;s a cyclic error stacktrace shown. Some stackoverflow answers tells me this is because something can\u0026rsquo;t be serialize it, and I trace the problem to a generic error handler that just calls \u003ccode\u003econsole.log\u003c/code\u003e. I comment this out so that I can see the actual error, which is \u0026ldquo;cordova doesn\u0026rsquo;t exist\u0026rdquo; (or something to that effect). I realize this means that the mobile app uses some native-specific things, so Cordova is required and it\u0026rsquo;s not going to work when served via web, so why did they include this step?\u003c/li\u003e\n\u003cli\u003eSo instead I do \u003ccode\u003eionic cordova run android\u003c/code\u003e (after installing the necessary Android Studio/SDK things\u0026hellip;this was after my \u003ca href=\"/2019/09/two-backups/\"\u003erecent computer troubles\u003c/a\u003e, so I had a fresh OS install.) And yes, long story short, I am finally able to get the Android app running in an emulator (and eventually in a device, and then the iOS version as well).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eI recounted this because I could use it as lesson to note that even when you do have documentation, there are so many ways the documentation can be insufficient. In this case:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ethe dependencies/requirements were not specified\u003c/li\u003e\n\u003cli\u003ethey did not have someone actually go through these steps from a fresh install to verify things would work\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA case could also be made that they should have just had something like a Docker setup available, but they actually did have a \u003ccode\u003edocker-compose.yml\u003c/code\u003e in the repository! Sadly, it wouldn\u0026rsquo;t have worked either because it referenced some environment variables that I had no idea what the value needed to be. And besides, my PC doesn\u0026rsquo;t support Docker (silly Windows Home), but looking at the docker image did clue me in to what Node version to use.\u003c/p\u003e\n\u003cp\u003eIn this instance, it was also a problem was that the old team was asked to provide the documentation only after the handover (due to circumstances beyond our control). Ideally, a handover would have them available for consultation should there be problems found with their documentation, and the documentation would only be cleared for acceptance after such review. (Realistically, a lot of documentation like user manuals wouldn\u0026rsquo;t even be looked at, but in this case, the ability to build the application was kind of crucial!)\u003c/p\u003e\n",
            "summary": "A while back I found myself having to figure out how to compile/build/run a mobile application. The developers previously assigned to the project were no longer available to consult with, but they did leave behind some documentation. However, their documentation quality left a lot to be desired. The instructions they left basically amounted to:\n npm install ionic serve ionic codrova run android/ios  Okay, first sign of trouble is that their instructions were basically commands that anyone who knew the app used Ionic would be able to Google.",
            "date_published": "2019-11-06T12:07:37+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/documentation/index.md"
            , "tags": ["software development"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1192065025537716226/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4ftel9hegp/",
            "url": "https://mirror.roytang.net/2019/11/b4ftel9hegp/",
            "path": "/2019/11/b4ftel9hegp/",
            "title": "",
            "content_html": "\u003cp\u003e#sketchdaily dumplings. another quick one for catchup purposes\u003c/p\u003e\n",
            "summary": "#sketchdaily dumplings. another quick one for catchup purposes",
            "date_published": "2019-11-05T16:02:10+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4fTel9heGp/index.md"
            , "tags": ["sketchdaily"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191747542209486853/"},{"type":"instagram","url":"https://instagram.com/p/B4fTel9heGp/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/drfjpn/november_4th_dumplings/f6m8qxc/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4fpyqbhbke/",
            "url": "https://mirror.roytang.net/2019/11/b4fpyqbhbke/",
            "path": "/2019/11/b4fpyqbhbke/",
            "title": "",
            "content_html": "\u003cp\u003eCharging monstrosaur from ixalan rough sketch #sketchdaily #mtg. This is one of those things where I’d like to flesh it out and color it but I don’t have time and I’m already a few days behind on the daily sketches. maybe I’ll revisit it in the future\u003c/p\u003e\n",
            "summary": "Charging monstrosaur from ixalan rough sketch #sketchdaily #mtg. This is one of those things where I’d like to flesh it out and color it but I don’t have time and I’m already a few days behind on the daily sketches. maybe I’ll revisit it in the future",
            "date_published": "2019-11-05T15:17:41+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4fPyQbhbkE/index.md"
            , "tags": ["sketchdaily","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191736349210091520/"},{"type":"instagram","url":"https://instagram.com/p/B4fPyQbhbkE/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dqydoa/november_3rd_tufted_coquette/f6m4r4o/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1191702488740548608/",
            "url": "https://mirror.roytang.net/2019/11/1191702488740548608/",
            "path": "/2019/11/1191702488740548608/",
            "title": "",
            "content_html": "\u003cp\u003eA bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.\u003c/p\u003e\n",
            "summary": "A bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.",
            "date_published": "2019-11-05T13:03:08+00:00",
            "date_modified": "2019-11-05T13:22:32+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1191702488740548608/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191702488740548608/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/world-can-be-suffocating/",
            "url": "https://mirror.roytang.net/2019/11/world-can-be-suffocating/",
            "path": "/2019/11/world-can-be-suffocating/",
            "title": "The World Can Be Suffocating",
            "content_html": "\u003cp\u003eThe world can be suffocating.\u003c/p\u003e\n\u003cp\u003eYou won\u0026rsquo;t always have enough energy.\u003c/p\u003e\n\u003cp\u003eYou\u0026rsquo;ll have too much to do.\u003c/p\u003e\n\u003cp\u003eYou\u0026rsquo;ll fall behind on your commitments.\u003c/p\u003e\n\u003cp\u003eBad things will happen at work.\u003c/p\u003e\n\u003cp\u003eYour problems will pile up.\u003c/p\u003e\n\u003cp\u003eRoadblocks will stand in your way.\u003c/p\u003e\n\u003cp\u003eYou\u0026rsquo;ll never have enough time.\u003c/p\u003e\n\u003cp\u003eOther people will come to you for help. You will bear the weight of their problems as well, even a little.\u003c/p\u003e\n\u003cp\u003eThen there\u0026rsquo;s the problems plaguing the world around you. Politicians making bad decisions. People taking advantage of other people. Wars and death and famine and climate change.\u003c/p\u003e\n\u003cp\u003eAll of these weigh upon you, and can make you feel trapped and short of breath.\u003c/p\u003e\n\u003cp\u003eIt\u0026rsquo;s alright to step back for a bit.\u003c/p\u003e\n\u003cp\u003eRetreat into your books, your movies, your tv series, your games, your silent hidey-holes.\u003c/p\u003e\n\u003cp\u003eWhen you\u0026rsquo;re ready, when you can breathe again, then come back to face the world anew.\u003c/p\u003e\n\u003cp\u003eRest, recover, then catch up again.\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#bc0e000f1747133d85232eb9146dacea-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/1191702488740548608/EInHGFYUUAEcu8g_hue9021c46d35b3addb9b6830b6db63b38_9469_300x0_resize_box_2.png\" alt=\"A bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.\" title=\"A bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eA bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future. (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"bc0e000f1747133d85232eb9146dacea-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/1191702488740548608/EInHGFYUUAEcu8g.png\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eA bit overwhelmed by the world at the moment. Time for a break. My outrage will return in the future.\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"5 Nov 2019 12:08pm\"\u003e5 Nov 2019 12:08pm\u003c/time\u003e\u003ca href=\"/2019/11/1191702488740548608/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n",
            "summary": "The world can be suffocating.\nYou won\u0026rsquo;t always have enough energy.\nYou\u0026rsquo;ll have too much to do.\nYou\u0026rsquo;ll fall behind on your commitments.\nBad things will happen at work.\nYour problems will pile up.\nRoadblocks will stand in your way.\nYou\u0026rsquo;ll never have enough time.\nOther people will come to you for help. You will bear the weight of their problems as well, even a little.\nThen there\u0026rsquo;s the problems plaguing the world around you.",
            "date_published": "2019-11-05T12:08:23+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/world-can-be-suffocating/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191735312248180737/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/f6lof3o/",
            "url": "https://mirror.roytang.net/2019/11/f6lof3o/",
            "path": "/2019/11/f6lof3o/",
            "title": "",
            "content_html": "\u003cp\u003eHow come that green Nykthos ramp deck isn\u0026rsquo;t a thing in Modern? The same cards should be available there right?\u003c/p\u003e\n",
            "summary": "How come that green Nykthos ramp deck isn\u0026rsquo;t a thing in Modern? The same cards should be available there right?",
            "date_published": "2019-11-05T12:03:46+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/f6lof3o/index.md"
            , "tags": ["magicTCG"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/magicTCG/comments/drpqho/br_november_4_2019_pioneer_banned_announcement/f6lof3o/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1191599265740554240/",
            "url": "https://mirror.roytang.net/2019/11/1191599265740554240/",
            "path": "/2019/11/1191599265740554240/",
            "title": "",
            "content_html": "\u003cp\u003eI should be doing things but my bed is so comfortable: an autobiography\u003c/p\u003e\n",
            "summary": "I should be doing things but my bed is so comfortable: an autobiography",
            "date_published": "2019-11-05T06:12:58+00:00",
            "date_modified": "2019-11-05T09:30:47+00:00",
            "section": "notes",
            "source_path": "notes/2019/11/1191599265740554240/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191599265740554240/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1191545502161985537/",
            "url": "https://mirror.roytang.net/2019/11/1191545502161985537/",
            "path": "/2019/11/1191545502161985537/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/jaymelynilao/\"\u003e@jaymelynilao\u003c/a\u003e happy birthday!\u003c/p\u003e\n",
            "summary": "@jaymelynilao happy birthday!",
            "date_published": "2019-11-05T02:39:20+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1191545502161985537/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191545502161985537/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1191492068440326144/",
            "url": "https://mirror.roytang.net/2019/11/1191492068440326144/",
            "path": "/2019/11/1191492068440326144/",
            "title": "",
            "content_html": "\u003cp\u003eIt\u0026rsquo;s time for #MYTHICCHAMPIONSHIPVI edition 10000 gems giveaway! Right after I come back from MC VI, I\u0026rsquo;ll pick one random person who re-tweeted this tweet and follows me. The winner will receive a code for 10k gems on \u003ca href=\"https://twitter.com/MTG_Arena/\"\u003e@MTG_Arena\u003c/a\u003e! Let\u0026rsquo;s celebrate this great magic weekend together!\u003c/p\u003e\n",
            "summary": "It\u0026rsquo;s time for #MYTHICCHAMPIONSHIPVI edition 10000 gems giveaway! Right after I come back from MC VI, I\u0026rsquo;ll pick one random person who re-tweeted this tweet and follows me. The winner will receive a code for 10k gems on @MTG_Arena! Let\u0026rsquo;s celebrate this great magic weekend together!",
            "date_published": "2019-11-04T23:07:00+00:00",
            "date_modified": "2020-01-23T05:24:41+08:00",
            "section": "notes",
            "source_path": "notes/2019/11/1191492068440326144/index.md"
            , "tags": ["MYTHICCHAMPIONSHIPVI"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191492068440326144/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4cpvadbnlh/",
            "url": "https://mirror.roytang.net/2019/11/b4cpvadbnlh/",
            "path": "/2019/11/b4cpvadbnlh/",
            "title": "",
            "content_html": "\u003cp\u003eBlurr! #transformers\u003c/p\u003e\n",
            "summary": "Blurr! #transformers",
            "date_published": "2019-11-04T14:57:15+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4cpVadBNLH/index.md"
            , "tags": ["transformers"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191368817022246917/"},{"type":"instagram","url":"https://instagram.com/p/B4cpVadBNLH/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/bicol-trip-photo-dump/",
            "url": "https://mirror.roytang.net/2019/11/bicol-trip-photo-dump/",
            "path": "/2019/11/bicol-trip-photo-dump/",
            "title": "Bicol Undas trip photodump",
            "content_html": "\u003cp\u003eMore info in \u003ca href=\"/2019/11/four-days-in-bicol/\"\u003ethis post\u003c/a\u003e.\u003c/p\u003e\n",
            "summary": "More info in this post.",
            "date_published": "2019-11-04T00:00:00+00:00",
            "date_modified": "2019-11-04T13:03:43+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/bicol-trip-photo-dump/index.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/four-days-in-bicol/",
            "url": "https://mirror.roytang.net/2019/11/four-days-in-bicol/",
            "path": "/2019/11/four-days-in-bicol/",
            "title": "Four Days in Bicol",
            "content_html": "\u003cp\u003eSomething I haven\u0026rsquo;t done in a while: travel with my parents to Bicol to pay respects to our ancestors during the \u003cem\u003eundas\u003c/em\u003e long weekend. In fact, the last time I made this trip was \u003ca href=\"/2004/10/getting-away-from-it-all/\"\u003eback in 2004\u003c/a\u003e, 15 years ago! (I technically also visited Bicol about 11ish years ago, but that was via a flight to Legaspi, Albay, and not to my dad\u0026rsquo;s hometown.)\u003c/p\u003e\n\u003cp\u003eMy Dad\u0026rsquo;s hometown is in Daet, Camarines Norte, and that\u0026rsquo;s also where my grandparents are buried. But instead of heading there directly, we went first to Naga City in Camarines Sur, where we had relatives and family friends to visit.\u003c/p\u003e\n\u003ch3 id=\"10-hour-bus\"\u003e10 Hour Bus\u003c/h3\u003e\n\u003cp\u003eThe overnight bus ride from Manila to Naga is longer than the one to Daet, at an estimated 10 hours. We booked a \u0026ldquo;lazyboy\u0026rdquo; Amihan bus, which meant we would be getting a ride at the Cubao Busport that was newly-opened a couple of years ago. My parents were super-impressed with the busport when it first opened, comparing it to an airport terminal. It was my first time using the busport, and I was mostly underwhelmed. I will say it\u0026rsquo;s nicer than other bus terminals in the country, but that\u0026rsquo;s a low standard and nowhere near an airport.\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#8ee8b97763ced0a4f23ede57e860c975-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191029_171737_hu1850e6ec956155ef1a1d4296057d059f_1216801_300x0_resize_q75_box.jpg\" alt=\"The Araneta center busport\" title=\"The Araneta center busport\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eThe Araneta center busport (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"8ee8b97763ced0a4f23ede57e860c975-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191029_171737.jpg\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eThe Araneta center busport\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"4 Nov 2019 12:00am\"\u003e4 Nov 2019 12:00am\u003c/time\u003e\u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n\u003cp\u003eThe 10-hour bus ride was expectedly miserable; I probably got little more than 2-3 hours of shallow sleep (Fitbit didn\u0026rsquo;t even register any sleep at all, although as if to compensate, it gave me an extra 4000 steps for the next day\u0026hellip;). Comparing it to plane rides (which are also generally miserable), the bus ride had more legroom (yay!) but was way more turbulent (impossible for me to read anything). Level of discomfort with the seat back and difficulty sleeping was about the same.\u003c/p\u003e\n\u003cp\u003eSide note: I am generally pessimistic about bus rides, because growing up, these trips to Bicol were a lot more common, and I was lot more prone to motion-sickness while on the bus, especially as some of these Bicol roads are exceptionally curve-y. My mom often had to provide me with a barf bag, because me puking due to motion-sickness on these rides was the rule rather than the exception. Thankfully, I\u0026rsquo;m better able to handle it these days. That, and I have bonamine now.\u003c/p\u003e\n\u003ch3 id=\"naga-city\"\u003eNaga City\u003c/h3\u003e\n\u003cp\u003eMy uncle picks us up at the Bicol Central Terminal in Naga, and we have a quick breakfast at the local McDonald\u0026rsquo;s. We drop our bags at his house and rest for a while, after which he takes on a few quick stops around the town. It\u0026rsquo;s my first time in Naga (or at least, the first time in adult memory), so everything is new to me. Apparently, the town is well-known for the Penafrancia festival, something akin to Quiapo\u0026rsquo;s Nazareno festival, a religious festival involving pilgrimage from one religious site to another. Except this one uses a water route somehow (?)\u003c/p\u003e\n\u003cp\u003eFirst stop is the Jesse Robredo Museum. Disclaimer: I\u0026rsquo;ve never met the former Naga City Mayor/DILG secretary or his wife, the current VP, but we are indirectly related through in-law-ness. My uncle here in Naga is married to Jesse Robredo\u0026rsquo;s sister, making him the Vice-President\u0026rsquo;s brother-in-law, I think? Is that how it works? Anyway, for this reason, the current VP is highly regarded on the father\u0026rsquo;s side of the family, despite the country\u0026rsquo;s divisive politics. The museum itself was ok, highlighting J.Robredo\u0026rsquo;s career highlights and accomplishments. It\u0026rsquo;s not super large (I can\u0026rsquo;t imagine that a museum dedicated to a single politician can be), and a visit is probably 30-45 minutes long (including a short AV presentation).\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#81f271719a457caa65701bf431b750b9-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191030_110729_hu3e0e29eb884911ebc3971284069254c2_1109802_300x0_resize_q75_box.jpg\" alt=\"Jesse Robredo Museum\" title=\"Jesse Robredo Museum\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eJesse Robredo Museum (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"81f271719a457caa65701bf431b750b9-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191030_110729.jpg\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eJesse Robredo Museum\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"4 Nov 2019 12:00am\"\u003e4 Nov 2019 12:00am\u003c/time\u003e\u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n\u003cp\u003eMy uncle drove us around town a bit, pointing out this or that. One thing that struck me was that small-town feel of \u0026ldquo;everybody knows everyone\u0026rdquo;, since he would often point to a building/business as we drove past and say it was owned by the son of so-and-so and my dad would be like, \u0026ldquo;ah, the one who went to X school?\u0026rdquo; and so on and other stuff like that.\u003c/p\u003e\n\u003cp\u003eLunch-time we visited this restaurant my dad liked, Jimmy and Tang\u0026rsquo;s (no relation, though jokingly they claim to be cousins). Given my peculiar dietary tastes, I\u0026rsquo;m not much for Bicolano food, but my dad loves it of course.\u003c/p\u003e\n\u003cp\u003eAfternoon was some free time, so I decided to wander around SM City Naga. Having a mall in Naga is not a new thing, I\u0026rsquo;m told SM City Naga has been there since the late 90s. Still, the mall was quite small, and there\u0026rsquo;s the distinct lack of dedicated stores that I like to visit: Comic book stores, gaming stores, bookstores (National doesn\u0026rsquo;t count!). I imagine it must be difficult to have geeky interests in the provinces. In the evening we had dinner at Robinson\u0026rsquo;s Place Naga, which was the newer mall in the area, and quite a bit bigger than the SM. After that we visited the house of my dad\u0026rsquo;s childhood friend and spent the night there. I pretty much just turned it early due to being tired.\u003c/p\u003e\n\u003cp\u003eSecond day in Naga was more restful than anything else. Lunch time we visited the house of some of my folks\u0026rsquo; CFC friends. They served some beef salpicao (among other things I wasn\u0026rsquo;t inclined to eat) that turned out to be quite good but also quite spicy. That\u0026rsquo;s Bicol for you I guess. After we got back we checked in at the CBD Plaza Hotel opposite the bus terminal where we\u0026rsquo;d be leaving for Daet the next morning. The hotel room was a bit cramped, but it was fine for sleeping (and also had wifi so that\u0026rsquo;s good enough for me.) We rested up at the hotel for a bit before I decided to go around and walk the early evening streets for a bit. Dinner was at the SM City Naga food court.\u003c/p\u003e\n\u003ch3 id=\"daet\"\u003eDaet\u003c/h3\u003e\n\u003cp\u003eIn the morning we had the free non-buffet hotel breakfast, then checked out of the hotel and got on a bus for Daet. It was a mostly uneventful two-hour ride, though I did see an \u0026ldquo;IPOT FOR SALE\u0026rdquo; roadside sign that I wish I had taken a picture of. My aunt who lived in Daet met us at the terminal and brought us to the Canimog Hotel where we\u0026rsquo;d be staying for the night. The owners of the hotel were friends of the family, which is why my folks chose this place to stay at, but we were the only guests for some reason. Apparently the hotel had seen better days, there was a bit of a creepy vibe lol. But also there was fiber internet (Converge), so all good I guess? During all of my other prior trips to Daet, we had stayed at my grandmother\u0026rsquo;s old house, but that was sold off a few years ago, so now we have to stay in a hotel.\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#f6d6372950bc3c876ce7e9b94570d979-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191101_121422_hu97f2acfc4be18c45b4863959ebd9252a_1111851_300x0_resize_q75_box.jpg\" alt=\"Canimog Hotel (Daet)\" title=\"Canimog Hotel (Daet)\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eCanimog Hotel (Daet) (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"f6d6372950bc3c876ce7e9b94570d979-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191101_121422.jpg\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eCanimog Hotel (Daet)\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"4 Nov 2019 12:00am\"\u003e4 Nov 2019 12:00am\u003c/time\u003e\u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n\u003cp\u003eAfter leaving our stuff at hotel, we immediately went out for lunch at a nearby place called KSarap (I had some yummy chicken cordon bleu), then headed straight for the cemetery afterwards, as it was already the first of November. My grandparents were buried at the Camarines Norte Chinese Cemetery, where each family had like a small mausoleum type thing to house their dead.  Ours housed my grandparents, and also an uncle and aunt who had also lived in Daet. We paid our respects by doing the Chinese thing with the incense sticks and the bowing and the putting them into the bowl. My mom and I left earlier because it was blistering hot and wanted to rest. My dad and aunt and cousin stayed behind to man the mausoleum and greet any visitors and such. Because of that small-town \u0026ldquo;everybody knows everybody else\u0026rdquo; thing, there\u0026rsquo;d often be random people who knew the family coming in to visit and pay respects.\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#f8677f1e7d4edc1e5e0133d90b5d22d7-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191101_135509_hu825b9b50ed4b0c6feeb601bea014e15a_1111036_300x0_resize_q75_box.jpg\" alt=\"My grandparents\u0026#39; mausoleum (Is that the proper term?)\" title=\"My grandparents\u0026#39; mausoleum (Is that the proper term?)\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eMy grandparents\u0026rsquo; mausoleum (Is that the proper term?) (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"f8677f1e7d4edc1e5e0133d90b5d22d7-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191101_135509.jpg\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eMy grandparents\u0026#39; mausoleum (Is that the proper term?)\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"4 Nov 2019 12:00am\"\u003e4 Nov 2019 12:00am\u003c/time\u003e\u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n\u003cp\u003eThe rest of the day was uneventful. We met up with my dad later in the afternoon and then went and had dinner at the nearby SM Hypermart. (They don\u0026rsquo;t yet have a full-fledged SM mall in Daet, though I\u0026rsquo;m told one is underway.) Then rest and sleep at Canimog. The hotel room at Canimog was nice and a lot roomier than the previous one (though I wish they had more outlets for charging).\u003c/p\u003e\n\u003ch3 id=\"my-eyeglasses-stayed-away-from-the-sea\"\u003eMy eyeglasses stayed away from the sea\u003c/h3\u003e\n\u003cp\u003eIn the morning, we had breakfast at Jollibee before heading out to Bagasbas beach. Visiting the beach was often the highlight of my childhood visits to Daet, but during my last visit in 2004, I famously \u003ca href=\"/2004/11/my-eyeglasses-belong-to-the-sea/\"\u003elost my eyeglasses to it\u003c/a\u003e. I still decided to take a dip this time, but wisely took off my eyeglasses before doing so. Nothing quite like the taste of saltwater and how it assaults even your nose. I don\u0026rsquo;t think I\u0026rsquo;ve been in contact with the ocean since maybe 2016, so this was a good time to commune with the sea and maybe demand it give back my eyeglasses. (Spoiler: they were not returned.)\u003c/p\u003e\n\n\n\n\n\n\n\n\n    \n    \n        \n    \n    \n    \n        \n            \n            \n            \n            \n              \n            \n            \n            \u003ca href=\"#7c50458741850a24cdf089a355702595-lightbox\"\u003e\n                \u003cfigure\u003e\n                  \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191102_083909_hu80803ec41d04987463c93bcfcd674255_864646_300x0_resize_q75_box.jpg\" alt=\"Bagasbas beach\" title=\"Bagasbas beach\" class=\"tn\" /\u003e\n                  \u003cfigcaption\u003eBagasbas beach (Click to view full-size)\u003c/figcaption\u003e\n                \u003c/figure\u003e\n            \u003c/a\u003e\n            \u003cdiv  class=\"lightbox\" id=\"7c50458741850a24cdf089a355702595-lightbox\" style=\"display: none;\"\u003e\n              \u003ca href=\"#_\"\u003e\n                \u003cimg src=\"/2019/11/bicol-trip-photo-dump/20191102_083909.jpg\" /\u003e\n              \u003c/a\u003e\n              \u003cdiv class=\"lightbox_overlay\"\u003e\n                \u003cp\u003eBagasbas beach\u003c/p\u003e\n                \u003ctime class=\"dt-published\" datetime=\"4 Nov 2019 12:00am\"\u003e4 Nov 2019 12:00am\u003c/time\u003e\u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003eView post\u003c/a\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n              \u003c/div\u003e\n            \u003c/div\u003e            \n        \n    \n\n\u003cp\u003eThere were quite a few people on the beach, presumably because of the holidays. I\u0026rsquo;ve visited a few other beaches in my lifetime, but none with waves as strong as the ones on Bagasbas. It\u0026rsquo;s actually gotten famous as a surfing destination during the past couple of decades. A lot has changed on the beach and the boulevard, which now claims to be the \u003ca href=\"https://news.abs-cbn.com/nation/regions/05/13/15/how-long-philippines-longest-boulevard\"\u003elongest boulevard in the Philippines\u003c/a\u003e after they added some bridges to extend it to nearby municipalities. There\u0026rsquo;s also a lot more shops and restaurants along the boulevard than I remember, though most of them were closed in the morning.\u003c/p\u003e\n\u003ch3 id=\"distant-relatives\"\u003eDistant relatives\u003c/h3\u003e\n\u003cp\u003eAfter the beach, we went back to the hotel to clean up then headed out for lunch with some distant relatives, most of whom I\u0026rsquo;ve never met or don\u0026rsquo;t remember. I believe the house belonged to my dad\u0026rsquo;s aunt, which meant her siblings were my second cousins (?) is that how it works lol. Pretty big family too. Anyway, many of them remembered me from when I was little, but I had little recollection of them, though I tried to get along of course. I did enjoy their stories of Daet and how things have changed along the years, and there was more of that \u0026ldquo;everybody knows everybody else\u0026rdquo; feeling when they were talking about old neighbors or friends who had passed away, or what happened to old buildings or businesses in town, and so on. My dad also enjoyed the food quite a lot.\u003c/p\u003e\n\u003ch3 id=\"anticipated-mass-and-more-thoughts-on-daet\"\u003eAnticipated mass, and more thoughts on Daet\u003c/h3\u003e\n\u003cp\u003eAfter lunch we mostly rested up at the hotel and then went out for anticipated mass (it was Saturday the 2nd) in the early afternoon.\u003c/p\u003e\n\u003cp\u003eWhile I had visited Daet many times during my childhood, I find that I don\u0026rsquo;t really have a good \u0026ldquo;mental model\u0026rdquo; of the town, unlike places that I\u0026rsquo;ve visited as an adult. When I was young, we were mostly limited to my grandmother\u0026rsquo;s old house, and the beach, and maybe went out a few times to some other places, but never really enough for me to grasp the size or layout of the town. The big difference now is that internet is ubiquitous, which means I have Google Maps as a reference. The Globe signal can be spotty in some places, but still generally workable. This is a huge contrast to my 2004 visit where I had to go to \u003ca href=\"/2004/10/posting-from-the-boondocks/\"\u003ean internet shop to do internet things\u003c/a\u003e. Even my aunt and cousin have fiber internet here. So now during this visit I at least know the major road names and have some idea of where places are relative to other places.\u003c/p\u003e\n\u003cp\u003eEverything feels a bit more modern now too. In my last visit, I complained about having to flush the toilet manually with a bucket. Not only is that a thing of the past now, but all of the places we stayed at now had bidets! Ah, bidets, the symbol of modern living. In general, Naga and Daet feel like they could be suburbs of Metro Manila; there aren\u0026rsquo;t any tall skyscrapers like in Makati or Ortigas, but looking at the streets and the shops and so on, it would be hard to differentiate from some of the more far-flung residential QC areas.\u003c/p\u003e\n\u003cp\u003eI also found it interesting whenever my dad would converse with other people in Bicolano. I don\u0026rsquo;t speak the dialect, but it\u0026rsquo;s close enough to Tagalog that I can often get the gist of what\u0026rsquo;s being discussed. (Closer than something like Cebuano at least.) It\u0026rsquo;s a weird feeling listening to a language that\u0026rsquo;s almost familiar but not. Maybe this is how Spanish people feel when hearing Catalan, or such.\u003c/p\u003e\n\u003ch3 id=\"going-home\"\u003eGoing Home\u003c/h3\u003e\n\u003cp\u003eAfter the mass, we had a fast-food dinner at Greenwich, then went back to our hotel to checkout and then on to the bus terminal. We would be taking a DLTB \u0026ldquo;lazyboy\u0026rdquo; bus from Daet to Cubao, a trip estimated at around 8 hours. The DLTB bus had a bit more legroom than the Amihan bus, but the seats were a bit slippery and any attempt to sleep led to me slipping down into an uncomfortable position. So again, miserable bus trip with little sleep, as expected. But I didn\u0026rsquo;t get motion sickness again this time, so that\u0026rsquo;s something. The bus trip was fairly quick as well - we arrived an hour earlier than I expected. When we got off the bus, we took a grab home and I was glad to be back in my own bed again.\u003c/p\u003e\n\u003cp\u003eThe whole trip was worthwhile, it\u0026rsquo;s always good to connect with your roots, no matter how distant they may have gotten. And stepping away from Metro Manila and all its problems was a welcome thing as well (though I did miss my desktop PC). Given my parents\u0026rsquo; age, there is a nontrivial chance that I never get to visit Bicol again; I certainly wouldn\u0026rsquo;t go by myself after all. So it was better to take this opportunity while it was there. Well, maybe I\u0026rsquo;ll go again next year? We\u0026rsquo;ll see.\u003c/p\u003e\n\u003cp\u003eMore photos from the trip at the \u003ca href=\"/2019/11/bicol-trip-photo-dump/\"\u003ephoto dump\u003c/a\u003e.\u003c/p\u003e\n",
            "summary": "Something I haven\u0026rsquo;t done in a while: travel with my parents to Bicol to pay respects to our ancestors during the undas long weekend. In fact, the last time I made this trip was back in 2004, 15 years ago! (I technically also visited Bicol about 11ish years ago, but that was via a flight to Legaspi, Albay, and not to my dad\u0026rsquo;s hometown.)\nMy Dad\u0026rsquo;s hometown is in Daet, Camarines Norte, and that\u0026rsquo;s also where my grandparents are buried.",
            "date_published": "2019-11-04T00:00:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2019/11/four-days-in-bicol/index.md"
            , "tags": ["travels","philippines"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191241464069668864/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4z-8gubcya/",
            "url": "https://mirror.roytang.net/2019/11/b4z-8gubcya/",
            "path": "/2019/11/b4z-8gubcya/",
            "title": "",
            "content_html": "\u003cp\u003e#sketchdaily nov 2 prompt: album covers. This is a fictional album cover for my Rock Band 2 band “Deathspore Thallid GO” #mtg\u003c/p\u003e\n",
            "summary": "#sketchdaily nov 2 prompt: album covers. This is a fictional album cover for my Rock Band 2 band “Deathspore Thallid GO” #mtg",
            "date_published": "2019-11-03T14:57:11+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4Z-8guBCYA/index.md"
            , "tags": ["sketchdaily","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1191006412912123904/"},{"type":"instagram","url":"https://instagram.com/p/B4Z-8guBCYA/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dqhoaa/november_2nd_album_covers/f6czagu/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/b4zo5ifbt0/",
            "url": "https://mirror.roytang.net/2019/11/b4zo5ifbt0/",
            "path": "/2019/11/b4zo5ifbt0/",
            "title": "",
            "content_html": "\u003cp\u003eSerra Avenger #sketchdaily #mtg #procreate  Lets see if we cant keep the daily drawing going on after inktober. At least we are back to digital this time\u003c/p\u003e\n",
            "summary": "Serra Avenger #sketchdaily #mtg #procreate Lets see if we cant keep the daily drawing going on after inktober. At least we are back to digital this time",
            "date_published": "2019-11-03T11:17:18+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/11/B4Zo5IFBT0-/index.md"
            , "tags": ["sketchdaily","procreate","mtg"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190951076352143360/"},{"type":"instagram","url":"https://instagram.com/p/B4Zo5IFBT0-/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dq1ncf/november_1st_free_draw_friday/f6c12dl/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1190863134661038080/",
            "url": "https://mirror.roytang.net/2019/11/1190863134661038080/",
            "path": "/2019/11/1190863134661038080/",
            "title": "",
            "content_html": "\u003cp\u003eI watched Justice League vs the Fatal Five on the bus home last night and now I want to read more Jessica Cruz Green Lantern\u003c/p\u003e\n",
            "summary": "I watched Justice League vs the Fatal Five on the bus home last night and now I want to read more Jessica Cruz Green Lantern",
            "date_published": "2019-11-03T05:27:51+00:00",
            "date_modified": "2019-11-03T12:30:02+00:00",
            "section": "notes",
            "source_path": "notes/2019/11/1190863134661038080/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190863134661038080/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/1190827086497251330/",
            "url": "https://mirror.roytang.net/2019/11/1190827086497251330/",
            "path": "/2019/11/1190827086497251330/",
            "title": "",
            "content_html": "\u003cp\u003e300! #duolingo\u003c/p\u003e\n",
            "summary": "300! #duolingo",
            "date_published": "2019-11-03T03:04:36+00:00",
            "date_modified": "2019-11-03T12:30:02+00:00",
            "section": "photos",
            "source_path": "photos/2019/11/1190827086497251330/index.md"
            , "tags": ["duolingo"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190827086497251330/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/nablopomo/",
            "url": "https://mirror.roytang.net/2019/11/nablopomo/",
            "path": "/2019/11/nablopomo/",
            "title": "NaBloPoMo: Just Write",
            "content_html": "\u003cp\u003eApparently, \u003ca href=\"http://nablopomoguideunofficial.blogspot.com/\"\u003eNaBloPoMo\u003c/a\u003e (or \u003cem\u003eNational Blog Posting Month\u003c/em\u003e) is a thing. It doesn\u0026rsquo;t quite roll off the tongue as the original \u003cem\u003eNanowrimo\u003c/em\u003e (which was already a tough sell), but I think it\u0026rsquo;s a worthy endeavor nonetheless. Some friends were inviting me to do Nanowrimo again this year, but due to general life and busyness and other things, I wasn\u0026rsquo;t able to prep. I could just wing it (maybe I still will!), but that likely leads to disaster! Let\u0026rsquo;s do this easier challenge instead. Easier because I\u0026rsquo;ve already done daily posting on multiple months this year, and also in comparison to \u003ca href=\"/2019/11/inktober-2019/\"\u003elast month\u0026rsquo;s challenge\u003c/a\u003e!\u003c/p\u003e\n\u003cp\u003eSome helpful tips and reminders for those who want to bring blogging back (did it ever really leave?):\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eA \u003cem\u003eblog\u003c/em\u003e (noun) is series of entries, called \u003cem\u003eblog posts\u003c/em\u003e, often primarily presented in reverse chronological order. A \u003cem\u003eblog post\u003c/em\u003e (noun) or simply a post is a single entry in a blog, usually consisting of a title, a date, and some content in either text or some other media. To \u003cem\u003eblog\u003c/em\u003e (verb) is to write one or more posts on a blog.\u003c/li\u003e\n\u003cli\u003eBlog posts can be anything you want them to be. They can be short or long. They can be focused on a particular topic, or discuss multiple topics, or be about no one topic in particular. They can have a title or have no title. They can be posted in the past, in the present or in the future. The sky\u0026rsquo;s the limit.\u003c/li\u003e\n\u003cli\u003eJust write. Some may struggle with putting their thoughts into words because they\u0026rsquo;re always looking for the perfect words or structure. Your posts don\u0026rsquo;t have to be the best, impeccable writing. They can written first and then improved upon. The goal of an exercise like this one or Nanowrimo is to force you into the habit of writing freely and without filter, to learn to embrace the imperfect. So just write.\u003c/li\u003e\n\u003cli\u003eStruggling to find something to write about? Here are some prompts, choose one:\n\u003cul\u003e\n\u003cli\u003ewhat have you been watching/reading lately?\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s something you tried recently?\u003c/li\u003e\n\u003cli\u003ewhat recent accomplishments are you proud of?\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s a recent failure you experienced and what did you learn from it?\u003c/li\u003e\n\u003cli\u003ewhen was the last time a friend asked you for advice, and what did you tell him?\u003c/li\u003e\n\u003cli\u003ewhen was the last time someone exceeded your expectations?\u003c/li\u003e\n\u003cli\u003ewhat happened the last time you went to a government office to get something done?\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s something you do or enjoy that none of your friends do?\u003c/li\u003e\n\u003cli\u003ewhat always annoys you when people ask about it?\u003c/li\u003e\n\u003cli\u003ewhat recent unexpected find made you happy?\u003c/li\u003e\n\u003cli\u003etry to draw a horse. then, mock your drawing\u003c/li\u003e\n\u003cli\u003ewhat recent article did you read that really impressed you?\u003c/li\u003e\n\u003cli\u003ewhat new blogs or social media accounts have you recently discovered and found interesting?\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s your strategy for saving money?\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s a recent restaurant meal you really liked? write a review!\u003c/li\u003e\n\u003cli\u003ewhat\u0026rsquo;s a recent government decision you think was really good or really bad? discuss!\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eEnjoy blogging!\u003c/p\u003e\n",
            "summary": "Apparently, NaBloPoMo (or National Blog Posting Month) is a thing. It doesn\u0026rsquo;t quite roll off the tongue as the original Nanowrimo (which was already a tough sell), but I think it\u0026rsquo;s a worthy endeavor nonetheless. Some friends were inviting me to do Nanowrimo again this year, but due to general life and busyness and other things, I wasn\u0026rsquo;t able to prep. I could just wing it (maybe I still will!), but that likely leads to disaster!",
            "date_published": "2019-11-03T00:00:00+00:00",
            "date_modified": "2019-11-05T16:30:03+00:00",
            "section": "post",
            "source_path": "post/2019/11/nablopomo/index.md"
            , "tags": ["writing","blogging"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190969726891155456/"}]
            
            , "comments": [
                { 
                    "url": null,
                    "source_file": "comment-20191105-081835-f3159568-7168-4317-94ee-c0d6438658fc.json"
                }, { 
                    "url": "",
                    "source_file": "comment-20200627-093221-4df67035-4dac-4061-87f1-cac4de51cb51.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/inktober-2019/",
            "url": "https://mirror.roytang.net/2019/11/inktober-2019/",
            "path": "/2019/11/inktober-2019/",
            "title": "Inktober 2019: Director's Cut",
            "content_html": "\u003cp\u003eFor the uninitiated, \u003ca href=\"https://inktober.com/rules\"\u003eInktober\u003c/a\u003e is a drawing challenge where you have to make one drawing in ink (no digital! but you do you I guess) for each day in October, with each drawing based on a certain prompt. This year\u0026rsquo;s prompts list is:\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://images.squarespace-cdn.com/content/v1/5af1bd791aef1d143f85e67e/1567315494055-9EETHXUUET9XHFJHGRNQ/ke17ZwdGBToddI8pDm48kNiEM88mrzHRsd1mQ3bxVct7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z4YTzHvnKhyp6Da-NYroOW3ZGjoBKy3azqku80C789l0topjEaZcWjtmMYdCWL4dkGbxs35J-ZjFa9s1e3LsxrX8g4qcOj2k2AL08mW_Htcgg/2019promptlist.png?format=500w\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;ve tried participating in this a few times since 2016, I think I only completed the full 31 days once before this year though. You can view my current and future entries through the \u003ca href=\"/tags/inktober\"\u003einktober tag\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eFor this year, I decided to up the challenge a bit more by doing a sequential series of drawings, something akin to a comic strip I guess? It\u0026rsquo;s not a super good story or super original, but I did enjoy the challenge. Basically, I started out with a small group of adventurers (initially 2, but later 3 characters) in a dungeon for some reason, and followed them as they tried to get out of various dangerous situations. I also consider my handwriting quite atrocious, so I tried to avoid having to write too much text. (There was one drawing where I tried putting drawings in speech bubbles instead to get around this.) The sketchpad I was using was fairly small, and my manual dexterity is not so good these days, so a lot of my lines are shaky, since I don\u0026rsquo;t have the advantage of digital sharpening etc.\u003c/p\u003e\n\u003cp\u003eThe challenge usually came when I had to find a way to link the prompt to the current situation they were in, and to \u0026ldquo;advance the story\u0026rdquo; a bit every time, shall we say. I ended up having some days not have a single drawing, but rather a more comic-book style sequence of smaller panels. I think on average my ink drawings weren\u0026rsquo;t as detailed as they were in previous years, but I did enjoy the challenge of having to string them together to form some semblance of a plot and also doing the panel layouts. The challenge was pretty fun, although stressful at times. I would only look ahead on the prompt list a few days of a time, so I didn\u0026rsquo;t have a beginning-to-end plan or anything like that, but I did have some anxious days where it took me forever to figure out a way to somehow meet the prompt.\u003c/p\u003e\n\u003cp\u003eI made these drawings on a 152mm x 229mm sketchpad, using a Uni pin fine line pen I got a few years back. Many of them had pencil sketches first (especially those that were more complicated or challenging, and I didn\u0026rsquo;t really erase the pencils thoroughly so you can still spot them on most of the drawings. There was also one day where I tried using some colored markers I found around the house to add some color, but the lines ended up way too thick so I was unhappy with it and didn\u0026rsquo;t use them again. I had uploaded this series to \u003ca href=\"https://www.instagram.com/roytang0400/\"\u003eInstagram\u003c/a\u003e as square images (since that\u0026rsquo;s what Instagram accepts), but the original scans were mostly of full rectangular sketchpad page, so I present them here for your viewing pleasure. (Note: I\u0026rsquo;m not claiming these are super good works or anything!) You can also view the original individual posts with captions via the \u003ca href=\"/tags/inktober2019\"\u003einktober2019\u003c/a\u003e tag on this site.\u003c/p\u003e\n\u003cp\u003eSince I enjoyed the challenge so much, I\u0026rsquo;m hoping this can set me back on my daily sketching routine. Though I\u0026rsquo;ve already missed the first two days of November due to being out of town, but that\u0026rsquo;s not something unrecoverable, hopefully!\u003c/p\u003e\n",
            "summary": "For the uninitiated, Inktober is a drawing challenge where you have to make one drawing in ink (no digital! but you do you I guess) for each day in October, with each drawing based on a certain prompt. This year\u0026rsquo;s prompts list is:\nI\u0026rsquo;ve tried participating in this a few times since 2016, I think I only completed the full 31 days once before this year though. You can view my current and future entries through the inktober tag.",
            "date_published": "2019-11-02T00:00:00+00:00",
            "date_modified": "2019-11-03T12:30:02+00:00",
            "section": "post",
            "source_path": "post/2019/11/inktober-2019/index.md"
            , "tags": ["inktober","inktober2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190879167132372992/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/",
            "url": "https://mirror.roytang.net/2019/11/",
            "path": "/2019/11/",
            "title": "Monthly Archives for 11 2019",
            "content_html": "",
            "summary": "",
            "date_published": "2019-11-01T00:00:00+00:00",
            "date_modified": "2019-11-02T22:00:57+00:00",
            "section": "archm",
            "source_path": "archm/2019-11.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/11/watching-lately-oct-2019/",
            "url": "https://mirror.roytang.net/2019/11/watching-lately-oct-2019/",
            "path": "/2019/11/watching-lately-oct-2019/",
            "title": "Watching Lately: October 2019: Joker, Scorsese, Stuber, Bloodlines, Brotherhood",
            "content_html": "\u003cp\u003eActually watched something in the cinema this month: \u003cstrong\u003eJoker\u003c/strong\u003e. I wasn\u0026rsquo;t originally sure if I wanted to see it, I wasn\u0026rsquo;t hyped for it at all in the months prior. But as the showing date came nearer, there was a lot of buzz around it so I decided to go anyway. I don\u0026rsquo;t feel like it lived up to the hype and the warnings about promoting incel stuff, but at least it\u0026rsquo;s one of the higher-grossing DC movies, so maybe we\u0026rsquo;ll have more to come in that vein. MCU movies all have kind of same-y tone and feel, so probably DC can differentiate itself by doing these heavier movies with a different kind of style. My spoiler-free review of this movie is \u003ca href=\"https://roytang.net/2019/10/1180086308963618816/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAfter watching Joker and also reading Scorsese recent comments about \u003ca href=\"https://www.theguardian.com/film/2019/oct/04/martin-scorsese-says-marvel-movies-are-not-cinema\"\u003eMCU movies not really being cinema\u003c/a\u003e, I decided to watch one of his movies and decided on \u003cstrong\u003eGoodfellas\u003c/strong\u003e. (The only other one I had seen prior to this was \u003cem\u003eShutter Island\u003c/em\u003e, which for a long while I thought was a Nolan flick.) Goodfellas was pretty good, definitely nothing like an MCU movie. They are obviously different kinds of \u0026ldquo;cinema\u0026rdquo; altogether, with the MCU movies leaning more towards the \u0026ldquo;popcorn\u0026rdquo; side of the spectrum. I did find it a bit hard to take Joe Pesci seriously here since I only really knew him from \u003cem\u003eHome Alone\u003c/em\u003e. I believe this is also the first time I\u0026rsquo;ve ever seen Ray Liotta in a film, so now I know who he is. I definitely enjoyed the \u0026ldquo;slice-of-life\u0026rdquo; look into the old-school gangster lifestyle.\u003c/p\u003e\n\u003cp\u003eI also watched \u003cstrong\u003eStuber\u003c/strong\u003e, mostly because this movie kept being advertised when I was in the US and it reminded me of Deadpool and that taxi driver friend of his. I was only expecting Batista, but Karen Gillan is also here (briefly!), so there\u0026rsquo;s a tiny GotG reunion there. Indian taxi driver dude was cool, the movie was ok, moderately funny, nothing too genre-busting. More popcorn movies for scorsese to snub his nose at, etc.\u003c/p\u003e\n\u003cp\u003eCatching up on my backlog of DC animated films, I decided to watch \u003cstrong\u003eWonder Woman: Bloodlines\u003c/strong\u003e. Plot spoilers, it\u0026rsquo;s basically a gaggle of WW villains (Silver Swan, Doctor Poison, Doctor Cyber, Cheetah, Giganta) plotting to invade Themyscira, I suspect to make them more well-known among the DC animated viewers. Coincidentally, I had also recently read the WW Rebirth story arc where a gaggle of WW villains tried to trick her into revealing the location of Themyscira, so I had a fresh point of comparison. In the comic book arc, everything was masterminded by Veronica Cale, a pharmaceutical CEO who had been created in the early 2000s with the intent of being the Lex Luthor to WW\u0026rsquo;s Superman. In the movie Cale works with WW for a while, and along I was waiting for the reveal that she was behind everything, but that never came. I would guess they have some bigger plans for Veronica Cale down the line in the DC animared film-universe. Otherwise, the movie was ok. Nothing too spectacular, missable, but also good enough to watch. EDIT: I found out after I wrote this that Bloodlines had a mid-credits scene where WW figures out Cale was behind everything all along!\u003c/p\u003e\n\u003cp\u003eTV-wise, not much to say right now. The fall shows are back, that means the Arrowverse is in full swing again (except for Legends, they\u0026rsquo;ll be back in January). The \u0026ldquo;science\u0026rdquo; on \u003cstrong\u003eFlash\u003c/strong\u003e is still ridiculous. The flash forwards on \u003cstrong\u003eArrow\u003c/strong\u003e are still boring (I don\u0026rsquo;t understand why they want to make a spinoff for Mia Smoak!), \u003cstrong\u003eSupergirl\u003c/strong\u003e is also a bit meh. I\u0026rsquo;m really only looking forward to the Crisis crossover this season (and of course, \u003cem\u003eLegends of Tomorrow\u003c/em\u003e.) Haven\u0026rsquo;t watched Batwoman yet, maybe I should since she has one of the five Crisis episodes. Also been following some of the regular stuff: The Good Place, Modern Family, etc. There\u0026rsquo;s also a lot of superhero shows still on the backlog, some of which I may never get to watch: Runaways, Cloak and Dagger (cancelled!), Krypton (cancelled!), Legion (finished!), Doom Patrol, Titans S2, etc. Maybe there\u0026rsquo;s a point where there\u0026rsquo;s \u003cem\u003etoo much\u003c/em\u003e content for comic book fans? Lol.\u003c/p\u003e\n\u003cp\u003eNetflix: I saw that Jenny Slate has a standup special out and I tried watching it, but eh, not for me, found it very boring and stopped about a third of the way through. I also found myself re-watching the end of \u003cstrong\u003eFull Metal Alchemist: Brotherhood\u003c/strong\u003e, mostly because I was envious of a friend who was watching it for the first time. Was surprised to learn the anime is 10 years old as of this year! Still held up well, possibly my favorite anime of all time. The final confrontation and fight scenes were great, although the epilogue episode was a bit anticlimactic and awkward.\u003c/p\u003e\n\u003cp\u003eThat\u0026rsquo;s it for this month. Maybe next month we manage to dent the ever-growing backlog? Maybe?\u003c/p\u003e\n",
            "summary": "Actually watched something in the cinema this month: Joker. I wasn\u0026rsquo;t originally sure if I wanted to see it, I wasn\u0026rsquo;t hyped for it at all in the months prior. But as the showing date came nearer, there was a lot of buzz around it so I decided to go anyway. I don\u0026rsquo;t feel like it lived up to the hype and the warnings about promoting incel stuff, but at least it\u0026rsquo;s one of the higher-grossing DC movies, so maybe we\u0026rsquo;ll have more to come in that vein.",
            "date_published": "2019-11-01T00:00:00+00:00",
            "date_modified": "2021-04-02T11:01:07+08:00",
            "section": "post",
            "source_path": "post/2019/11/watching-lately-oct-2019/index.md"
            , "tags": ["Pop Culture","Movies","TV","watching lately"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1190758325350207488/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1189811141158961154/",
            "url": "https://mirror.roytang.net/2019/10/1189811141158961154/",
            "path": "/2019/10/1189811141158961154/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/waxpancake/\"\u003e@waxpancake\u003c/a\u003e Did the archive include group messages, files and photos?\u003c/p\u003e\n",
            "summary": "@waxpancake Did the archive include group messages, files and photos?",
            "date_published": "2019-10-31T07:47:36+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/1189811141158961154/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1189811141158961154/"}]
            
            , "comments": [
                { 
                    "url": "https://twitter.com/waxpancake",
                    "source_file": "comment-20191031-155857-26168c98-fd56-45a6-96e3-297591b1c901.json"
                }, { 
                    "url": "https://twitter.com/roytang",
                    "source_file": "comment-20191031-191350-83dd8be2-be66-4be2-933f-eeef29254e12.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/f5vj0p2/",
            "url": "https://mirror.roytang.net/2019/10/f5vj0p2/",
            "path": "/2019/10/f5vj0p2/",
            "title": "",
            "content_html": "\u003cp\u003eAs a software developer, I wouldn\u0026rsquo;t trust the effort estimate of anyone who hasn\u0026rsquo;t even seen the codebase. Heck, I would still be fairly suspicious of the effort estimate of anyone who is actively working on the codebase.\u003c/p\u003e\n",
            "summary": "As a software developer, I wouldn\u0026rsquo;t trust the effort estimate of anyone who hasn\u0026rsquo;t even seen the codebase. Heck, I would still be fairly suspicious of the effort estimate of anyone who is actively working on the codebase.",
            "date_published": "2019-10-31T02:55:12+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/f5vj0p2/index.md"
            , "tags": ["MagicArena"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/MagicArena/comments/dp50ky/hot_take_people_are_critically_overestimating_the/f5vj0p2/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/f5vcbrj/",
            "url": "https://mirror.roytang.net/2019/10/f5vcbrj/",
            "path": "/2019/10/f5vcbrj/",
            "title": "",
            "content_html": "\u003cp\u003eTreacherous Blessing is great for the Doom Foretold deck\u003c/p\u003e\n",
            "summary": "Treacherous Blessing is great for the Doom Foretold deck",
            "date_published": "2019-10-31T01:52:10+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/f5vcbrj/index.md"
            , "tags": ["magicTCG"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/magicTCG/comments/dp1y01/theros_beyond_death_major_spoilers/f5vcbrj/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/b4qajrdlp7n/",
            "url": "https://mirror.roytang.net/2019/10/b4qajrdlp7n/",
            "path": "/2019/10/b4qajrdlp7n/",
            "title": "",
            "content_html": "\u003cp\u003e#inktober2019 day 31: ripe #inktober #sketchdaily woohoo completed!\u003c/p\u003e\n",
            "summary": "#inktober2019 day 31: ripe #inktober #sketchdaily woohoo completed!",
            "date_published": "2019-10-30T21:06:35+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/10/B4QaJrDlp7n/index.md"
            , "tags": ["sketchdaily","inktober","inktober2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1189649825840685056/"},{"type":"instagram","url":"https://instagram.com/p/B4QaJrDlp7n/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dpkt7s/october_31st_fruit/f5w50yv/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/f5sjoyx/",
            "url": "https://mirror.roytang.net/2019/10/f5sjoyx/",
            "path": "/2019/10/f5sjoyx/",
            "title": "",
            "content_html": "\u003cp\u003eThis kind of logic reminds me of \u003ca href=\"https://knowyourmeme.com/photos/1330819-webcomics\"\u003ehttps://knowyourmeme.com/photos/1330819-webcomics\u003c/a\u003e\u003c/p\u003e\n",
            "summary": "This kind of logic reminds me of https://knowyourmeme.com/photos/1330819-webcomics",
            "date_published": "2019-10-30T11:06:36+00:00",
            "date_modified": "2020-10-19T18:08:02+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/f5sjoyx/index.md"
            , "tags": ["Philippines"]
            , "syndicated": [{"type":"reddit","url":"https://www.reddit.com/r/Philippines/comments/dp3kpc/guys_this_asshate_used_a_random_picture_of_a/f5sjoyx/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/b4obcdvfkl9/",
            "url": "https://mirror.roytang.net/2019/10/b4obcdvfkl9/",
            "path": "/2019/10/b4obcdvfkl9/",
            "title": "",
            "content_html": "\u003cp\u003e#inktober2019 day 30: catch #inktober #sketchdaily\u003c/p\u003e\n",
            "summary": "#inktober2019 day 30: catch #inktober #sketchdaily",
            "date_published": "2019-10-29T22:41:34+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/10/B4OBCdVFKl9/index.md"
            , "tags": ["sketchdaily","inktober","inktober2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1189311338713092097/"},{"type":"instagram","url":"https://instagram.com/p/B4OBCdVFKl9/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dp440u/october_30th_plums/f5vb8z7/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1189113868523425793/",
            "url": "https://mirror.roytang.net/2019/10/1189113868523425793/",
            "path": "/2019/10/1189113868523425793/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/jaymelynilao/\"\u003e@jaymelynilao\u003c/a\u003e Hug mo lang randomly mga officemates\u003c/p\u003e\n",
            "summary": "@jaymelynilao Hug mo lang randomly mga officemates",
            "date_published": "2019-10-29T09:36:53+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/1189113868523425793/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1189113868523425793/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1188862508800413696/",
            "url": "https://mirror.roytang.net/2019/10/1188862508800413696/",
            "path": "/2019/10/1188862508800413696/",
            "title": "",
            "content_html": "\u003cp\u003eThe most disappointing thing about this episode was learning how “Erdogan“ was pronounced and realizing it no longer works with the Etrigan chants\u003c/p\u003e\n\u003ccite class=\"u-quotation-of h-cite\"\u003e\n    Quoted \u003ca  href='https://twitter.com/LastWeekTonight/status/1188820944325922816'\u003eLastWeekTonight\u0026#39;s tweet\u003c/a\u003e:\n\u003c/cite\u003e\n\u003cblockquote\u003e\n    Here’s our story from last night about the alarming decision to pull U.S. troops away from the border between Turkey and Syria: \u003ca href=\"https://www.youtube.com/watch?v=2u_pZ-SgACk\"\u003ehttps://www.youtube.com/watch?v=2u_pZ-SgACk\u003c/a\u003e\n\u003c/blockquote\u003e\n",
            "summary": "The most disappointing thing about this episode was learning how “Erdogan“ was pronounced and realizing it no longer works with the Etrigan chants\nQuoted LastWeekTonight\u0026#39;s tweet:   Here’s our story from last night about the alarming decision to pull U.S. troops away from the border between Turkey and Syria: https://www.youtube.com/watch?v=2u_pZ-SgACk  ",
            "date_published": "2019-10-28T16:58:04+00:00",
            "date_modified": "2020-09-07T14:09:34+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/1188862508800413696/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188862508800413696/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/b4k006ibl66/",
            "url": "https://mirror.roytang.net/2019/10/b4k006ibl66/",
            "path": "/2019/10/b4k006ibl66/",
            "title": "",
            "content_html": "\u003cp\u003e#inktober2019 day 29: injured #inktober #sketchdaily “These idiots got themselves injured and need healing.” “I’ll take you to town there’s a doctor there.” “Excuse me, these idiots didn’t get frozen by a trap.”\u003c/p\u003e\n",
            "summary": "#inktober2019 day 29: injured #inktober #sketchdaily “These idiots got themselves injured and need healing.” “I’ll take you to town there’s a doctor there.” “Excuse me, these idiots didn’t get frozen by a trap.”",
            "date_published": "2019-10-28T16:51:54+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/10/B4K006IBl66/index.md"
            , "tags": ["inktober2019","inktober","sketchdaily"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188860957679869962/"},{"type":"instagram","url":"https://instagram.com/p/B4K006IBl66/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/don5jk/october_29th_storm/f5rcqmv/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/b4k0f3ghxld/",
            "url": "https://mirror.roytang.net/2019/10/b4k0f3ghxld/",
            "path": "/2019/10/b4k0f3ghxld/",
            "title": "",
            "content_html": "\u003cp\u003e#inktober2019 day 28: ride #inktober #sketchdaily\u003c/p\u003e\n",
            "summary": "#inktober2019 day 28: ride #inktober #sketchdaily",
            "date_published": "2019-10-28T16:51:53+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/10/B4K0f3ghXlD/index.md"
            , "tags": ["sketchdaily","inktober","inktober2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188860953137471490/"},{"type":"instagram","url":"https://instagram.com/p/B4K0f3ghXlD/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/do8a1p/october_28th_tea_set/f5m9m1c/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1188707470866145280/",
            "url": "https://mirror.roytang.net/2019/10/1188707470866145280/",
            "path": "/2019/10/1188707470866145280/",
            "title": "",
            "content_html": "\u003cp\u003eBy age 35 you should have:\u003c/p\u003e\n\u003cp\u003eIt doesn\u0026rsquo;t matter\u003c/p\u003e\n\u003cp\u003eIt literally doesn\u0026rsquo;t\u003c/p\u003e\n\u003cp\u003eComparison is the thief of joy\u003c/p\u003e\n\u003cp\u003eMay you always have enough\u003c/p\u003e\n\u003cp\u003eIf you don\u0026rsquo;t, may you have great support\u003c/p\u003e\n\u003cp\u003eBecause rising tides lift all ships\u003c/p\u003e\n\u003cp\u003eUnless you\u0026rsquo;re the worst, then I hope the tide takes you far away\u003c/p\u003e\n",
            "summary": "By age 35 you should have:\nIt doesn\u0026rsquo;t matter\nIt literally doesn\u0026rsquo;t\nComparison is the thief of joy\nMay you always have enough\nIf you don\u0026rsquo;t, may you have great support\nBecause rising tides lift all ships\nUnless you\u0026rsquo;re the worst, then I hope the tide takes you far away",
            "date_published": "2019-10-28T06:42:00+00:00",
            "date_modified": "2020-09-07T14:09:34+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/1188707470866145280/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188707470866145280/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1188704078202671104/",
            "url": "https://mirror.roytang.net/2019/10/1188704078202671104/",
            "path": "/2019/10/1188704078202671104/",
            "title": "",
            "content_html": "\u003cp\u003eI\u0026rsquo;m not sure whether charging blindly into fixing an unfamiliar system in an unfamiliar language/framework is a core skill for (senior) developers, or madness, or maybe a little bit of both\u003c/p\u003e\n",
            "summary": "I\u0026rsquo;m not sure whether charging blindly into fixing an unfamiliar system in an unfamiliar language/framework is a core skill for (senior) developers, or madness, or maybe a little bit of both",
            "date_published": "2019-10-28T06:28:31+00:00",
            "date_modified": "2019-10-28T09:30:02+00:00",
            "section": "notes",
            "source_path": "notes/2019/10/1188704078202671104/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188704078202671104/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/1188671049027616768/",
            "url": "https://mirror.roytang.net/2019/10/1188671049027616768/",
            "path": "/2019/10/1188671049027616768/",
            "title": "",
            "content_html": "\u003cp\u003e\u003ca href=\"https://twitter.com/SeresaTagAraw/\"\u003e@SeresaTagAraw\u003c/a\u003e famous for being insatiable! lol\u003c/p\u003e\n",
            "summary": "@SeresaTagAraw famous for being insatiable! lol",
            "date_published": "2019-10-28T04:17:17+00:00",
            "date_modified": "2020-01-23T05:14:22+08:00",
            "section": "notes",
            "source_path": "notes/2019/10/1188671049027616768/index.md"
            
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188671049027616768/"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2019/10/b4irirmh8uk/",
            "url": "https://mirror.roytang.net/2019/10/b4irirmh8uk/",
            "path": "/2019/10/b4irirmh8uk/",
            "title": "",
            "content_html": "\u003cp\u003e#inktober2019 day 27: coat #inktober #sketchdaily It was a magical wizard coat of healing all along! Also I somehow managed to catch up!\u003c/p\u003e\n",
            "summary": "#inktober2019 day 27: coat #inktober #sketchdaily It was a magical wizard coat of healing all along! Also I somehow managed to catch up!",
            "date_published": "2019-10-27T17:16:14+00:00",
            "date_modified": "2020-03-28T03:38:04+08:00",
            "section": "photos",
            "source_path": "photos/2019/10/B4IRirMh8uK/index.md"
            , "tags": ["sketchdaily","inktober","inktober2019"]
            , "syndicated": [{"type":"twitter","url":"https://twitter.com/roytang/statuses/1188504689597472773/"},{"type":"instagram","url":"https://instagram.com/p/B4IRirMh8uK/"},{"type":"reddit","url":"https://www.reddit.com/r/SketchDaily/comments/dnqw28/october_27th_inspector_gadget/f5gq2cb/"}]
            
            
            }
        
    ]
     , "prev": "/p/32/feed.json" 
     , "next": "/p/34/feed.json" 
}