{
    "version": "https://jsonfeed.org/version/1",
    "title": "Roy Tang",
	"description": "Roy Tang's blog. Programmer, engineer, scientist, critic, gamer, dreamer, and kid-at-heart. Randomly amazed.",
    "home_page_url": "https://mirror.roytang.net/",
    "feed_url": "https://mirror.roytang.net/feed.json",
	"author": {
		"name": "Roy Tang",
		"url": "https://roytang.net"
    },
    "items": [
        
        {
            "id": "https://mirror.roytang.net/2005/01/a-giant-hammer/",
            "url": "https://mirror.roytang.net/2005/01/a-giant-hammer/",
            "path": "/2005/01/a-giant-hammer/",
            "title": "A Giant Hammer",
            "content_html": "\n\n\n\n\n\n\n\n\n\n\n\u003ca href=\"#467a2ae678522ad53ec9fcd1056bde4b-lightbox\"\u003e\n    \u003cfigure\u003e\n      \u003cimg src=\"/2005/01/a-giant-hammer/hammer_hud64f54c89f3d76fbe802ee9f11c9e06a_139983_300x0_resize_q75_box.jpg\" alt=\"\" title=\"\" class=\"tn\" /\u003e\n      \u003cfigcaption\u003e (Click to view full-size)\u003c/figcaption\u003e\n    \u003c/figure\u003e\n\u003c/a\u003e\n\u003cdiv class=\"lightbox\" id=\"467a2ae678522ad53ec9fcd1056bde4b-lightbox\" style=\"display: none;\"\u003e\n  \u003ca href=\"#_\"\u003e\n    \u003cimg src=\"/2005/01/a-giant-hammer/hammer.jpg\" /\u003e\n  \u003c/a\u003e\n  \u003cdiv class=\"lightbox_overlay\"\u003e\n    \u003cp\u003e\u003c/p\u003e\n    \u003ctime class=\"dt-published\" datetime=\"24 Jan 2005 1:20pm\"\u003e24 Jan 2005 1:20pm\u003c/time\u003e\u003ca href=\"#_\"\u003eClose\u003c/a\u003e\n  \u003c/div\u003e\n\u003c/div\u003e\n\n\u003cp\u003eWe have a giant hammer prop at home. Made out of a stick and some cardboard (I think). Naturally, we bash each other with it. There are only four things I think of when I see this hammer:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eThose carnival things where you need to use the giant hammer to ring the bell\u003c/li\u003e\n\u003cli\u003eTriple H\u003c/li\u003e\n\u003cli\u003eThe Paladin in Warcraft III\u003c/li\u003e\n\u003cli\u003eThor\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThat is all.\u003c/p\u003e\n",
            "summary": "(Click to view full-size)    \n24 Jan 2005 1:20pmClose   We have a giant hammer prop at home. Made out of a stick and some cardboard (I think). Naturally, we bash each other with it. There are only four things I think of when I see this hammer:\n Those carnival things where you need to use the giant hammer to ring the bell Triple H The Paladin in Warcraft III Thor  That is all.",
            "date_published": "2005-01-24T13:20:55+00:00",
            "date_modified": "2020-04-30T22:30:48+08:00",
            "section": "post",
            "source_path": "post/2005/01/a-giant-hammer/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2005/01/giant-hammer.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/how-to-be-a-programmer-a-short-comprehensive-and-personal-summary/",
            "url": "https://mirror.roytang.net/2005/01/how-to-be-a-programmer-a-short-comprehensive-and-personal-summary/",
            "path": "/2005/01/how-to-be-a-programmer-a-short-comprehensive-and-personal-summary/",
            "title": "How to be a Programmer: A Short, Comprehensive, and Personal Summary",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-24T12:48:57+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/how-to-be-a-programmer-a-short-comprehensive-and-personal-summary/index.md"
            , "tags": ["articles","software-development"]
            
            ,"link": "http://samizdat.mines.edu/howto/HowToBeAProgrammer.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/wu-riddles-intro/",
            "url": "https://mirror.roytang.net/2005/01/wu-riddles-intro/",
            "path": "/2005/01/wu-riddles-intro/",
            "title": "[ wu :: riddles(intro) ]",
            "content_html": "\u003cp\u003eriddles\u003c/p\u003e\n",
            "summary": "riddles",
            "date_published": "2005-01-24T12:45:30+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/wu-riddles-intro/index.md"
            , "tags": ["riddles"]
            
            ,"link": "http://www.ocf.berkeley.edu/~wwu/riddles/intro.shtml"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/hulk-s-diary-that-is-on-the-internet/",
            "url": "https://mirror.roytang.net/2005/01/hulk-s-diary-that-is-on-the-internet/",
            "path": "/2005/01/hulk-s-diary-that-is-on-the-internet/",
            "title": "HULK'S DIARY THAT IS ON THE INTERNET",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-23T08:27:50+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/hulk-s-diary-that-is-on-the-internet/index.md"
            , "tags": ["blogs","comics"]
            
            ,"link": "http://incrediblehulk.blogspot.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/anime-planet-anime-recommendations-database/",
            "url": "https://mirror.roytang.net/2005/01/anime-planet-anime-recommendations-database/",
            "path": "/2005/01/anime-planet-anime-recommendations-database/",
            "title": "Anime-Planet - Anime Recommendations Database",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-23T07:10:04+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/anime-planet-anime-recommendations-database/index.md"
            , "tags": ["anime"]
            
            ,"link": "http://www.anime-planet.com/animerec/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/this-is-psychicpants-net-we-live-for-kuwento/",
            "url": "https://mirror.roytang.net/2005/01/this-is-psychicpants-net-we-live-for-kuwento/",
            "path": "/2005/01/this-is-psychicpants-net-we-live-for-kuwento/",
            "title": "this is psychicpants.net :: we live for kuwento",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-23T07:04:41+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/this-is-psychicpants-net-we-live-for-kuwento/index.md"
            , "tags": ["blogs","pinoy"]
            
            ,"link": "http://psychicpants.net/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/games-star-ocean-till-the-end-of-time/",
            "url": "https://mirror.roytang.net/2005/01/games-star-ocean-till-the-end-of-time/",
            "path": "/2005/01/games-star-ocean-till-the-end-of-time/",
            "title": "Games: Star Ocean -- Till the End of Time",
            "content_html": "\u003cp\u003eThis game is the third and last installment of Tri-Ace\u0026rsquo;s venerable space opera science fiction RPG, spanning across three consoles \n\n    \n\n\n\u003ca href=\"#footnote-1\" id=\"footnotebase-1\"\u003e[1]\u003c/a\u003e\n, and it\u0026rsquo;s a good finish. I finished the main story just before the year\u0026rsquo;s end \n\n    \n\n\n\u003ca href=\"#footnote-2\" id=\"footnotebase-2\"\u003e[2]\u003c/a\u003e\n. But I\u0026rsquo;ve still been actively playing it, going through the bonus dungeons \n\n    \n\n\n\u003ca href=\"#footnote-3\" id=\"footnotebase-3\"\u003e[3]\u003c/a\u003e\n\u003c/p\u003e\n\u003cp\u003eThe fact that I finished it, and the fact that I am still playing it, and the fact that I am still planning to finish it on both of the higher difficulty levels, all of these facts speak volumes about how good this game is, given that I don\u0026rsquo;t have nearly as much time to play as I did before I was working.\u003c/p\u003e\n\u003cp\u003eThe story/plot is so-so, not too strong, but some of the characters \n\n    \n\n\n\u003ca href=\"#footnote-4\" id=\"footnotebase-4\"\u003e[4]\u003c/a\u003e\n are cool. Space-faring lad gets stranded on backwards-planet, gets involved and suddenly gets thrust into a conflict against the Creator that threatens the existance of the very universe. The usual sort of thing. There\u0026rsquo;s a giant plot twist somewhere in the second disc that changes the very nature of the Star Ocean universe and guarantees that this is, in fact, the last game of the series. Actually, in retrospect, the plot is fairly okay, but it could\u0026rsquo;ve been pulled off better.\u003c/p\u003e\n\u003cp\u003eThe gameplay is where it\u0026rsquo;s at of course. As well know, RPGs are about gameplay, not story. \n\n    \n\n\n\u003ca href=\"#footnote-5\" id=\"footnotebase-5\"\u003e[5]\u003c/a\u003e\n Gameplay-wise, the single best feature of this game is: Battle Trophies! Battle Trophies are awards granted to you for certain things done in combat, such as avoiding certain spells, winning with no damage, winning by tiny slivers of life, etc. Many boss battles have associated battle trophies such as \u0026ldquo;Defeat so-and-so in 1 minute\u0026rdquo; or \u0026ldquo;Defeat so-and-so without taking damage.\u0026rdquo; Accumulating battle trophies means unlocking higher difficulty levels, extra costumes and extra modes.\u003c/p\u003e\n\u003cp\u003eThe other good things carry over from Star Ocean 2. The real-time battle system is the same, with a bunch of improvements. The Fury gauge stops battles from being a button-bashing-fest, and the anti-attack auras add some tactical element to the battles. Damage bonuses for chaining together special moves are neat.\u003c/p\u003e\n\u003cp\u003eItem Creation is still here, but the system is vastly different from SO2. Instead of just crafting items yourself anywhere you are, you can hire inventors to work for you in workshops throughout the world. You can work with them of course, in an assembly line fashion that shows your characters going through various experiments to make stuff. However, I greatly miss that feature of Star Ocean 2\u0026rsquo;s Item Creation where you are shown a blob of some sort of raw creation material that slowly but surely transforms into a wonderful item. Losing that feature sort of removed the joy of item creation. =p\u003c/p\u003e\n\u003cp\u003eThere are however, some bad things about this game. Mostly minor nitpicks actually. The most important one is this:\u003c/p\u003e\n\u003cp\u003eThe menu interface for the battle arena sucks.\u003c/p\u003e\n\u003cp\u003eSeriously, everytime I go to fight the ranking battles, I have to go through three or four menus. One to ask whether I need to be given a tutorial. One to choose what type of battle I want to fight. Before I beat the champions, I get asked whether I want to fight them. One where I choose the opponent for my battle. The one with the tutorial really ticks me off every time I see it. I\u0026rsquo;ve already read the tutorial! Must you ask me every single time? Would you like fries with that?\u003c/p\u003e\n\u003cp\u003eReally, the \u0026ldquo;I\u0026rsquo;d like an explanation\u0026rdquo; thing could just be placed in the second menu. I should only have to decide two things: One, I want to fight a ranking battle; and two, I want to choose my opponent. Single battles or team battles are slightly worse, as you must choose your fighter and your difficulty level in addition to the above choices. I wonder how hard it would have been to make a simple menu system for the arena, instead of relying on the conversation system?\u003c/p\u003e\n\u003cp\u003eI realize this is a really petty thing to note, but when you start playing the battle arena, you have to go through those menus repeatedly every two or three minutes. It got annoying fast. And don\u0026rsquo;t get me started on those bunny races\u0026hellip;\u003c/p\u003e\n\u003cp\u003eThe other bad thing is: bad endings. Well, I wasn\u0026rsquo;t expecting much given that the story wasn\u0026rsquo;t that good anyway, but eh? The general ending wasn\u0026rsquo;t much more than \u0026ldquo;Hey, we\u0026rsquo;re still alive! Cool!\u0026rdquo;, and the individual endings were a bit sleepy. Or maybe it was just the lackluster music playing during the endings?\u003c/p\u003e\n\u003cp\u003eOverall though, a decidedly good game, one I\u0026rsquo;m going to try to finish at least two more times, and a worthy end to the Star Ocean series. Looking forward to Tri-Ace\u0026rsquo;s next series\u0026hellip;  \u003c/p\u003e\u003c/p\u003e\n",
            "summary": "This game is the third and last installment of Tri-Ace\u0026rsquo;s venerable space opera science fiction RPG, spanning across three consoles [1] , and it\u0026rsquo;s a good finish. I finished the main story just before the year\u0026rsquo;s end [2] . But I\u0026rsquo;ve still been actively playing it, going through the bonus dungeons [3] The fact that I finished it, and the fact that I am still playing it, and the fact that I am still planning to finish it on both of the higher difficulty levels, all of these facts speak volumes about how good this game is, given that I don\u0026rsquo;t have nearly as much time to play as I did before I was working.",
            "date_published": "2005-01-23T06:00:31+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2005/01/games-star-ocean-till-the-end-of-time/index.md"
            , "tags": ["Gaming"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2005/01/games-star-ocean-till-end-of-time.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/w3chart/",
            "url": "https://mirror.roytang.net/2005/01/w3chart/",
            "path": "/2005/01/w3chart/",
            "title": "w3chart",
            "content_html": "\u003cp\u003eSomeone asked for this on the GameFAQs forums.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://roytang.net/files/w3chart.exe\"\u003ew3chart\u003c/a\u003e is a program to analyze Warcraft III replays. I don\u0026rsquo;t know if my copy is old though, it doesn\u0026rsquo;t seem to have a version number.\u003c/p\u003e\n",
            "summary": "Someone asked for this on the GameFAQs forums.\nw3chart is a program to analyze Warcraft III replays. I don\u0026rsquo;t know if my copy is old though, it doesn\u0026rsquo;t seem to have a version number.",
            "date_published": "2005-01-18T17:03:00+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2005/01/w3chart/index.md"
            , "tags": ["Gaming"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2005/01/w3chart.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/the-past-comes-back-to-haunt-us/",
            "url": "https://mirror.roytang.net/2005/01/the-past-comes-back-to-haunt-us/",
            "path": "/2005/01/the-past-comes-back-to-haunt-us/",
            "title": "The Past Comes Back to Haunt Us",
            "content_html": "\u003cp\u003eIf you\u0026rsquo;ve been paying attention to this blog (yeah, you, both of you), you\u0026rsquo;ll notice that the archives now go all the way back to January of 2002. That\u0026rsquo;s when I started the site on \u003ca href=\"http://topcities.com\"\u003etopcities \u003c/a\u003esome time back. I moved some of the \u0026ldquo;journal\u0026rdquo; posts I had from there into blogger, using a very detailed process I shall refer to as \u0026ldquo;manual copy-and-paste and editing of links\u0026rdquo;. I still had some backup copies of most of the old site around, and \u003ca href=\"http://www.archive.org\"\u003earchive.org \u003c/a\u003ewas a big help. There wasn\u0026rsquo;t much editing actually, I just went through most of the links and marked those which were broken. I didn\u0026rsquo;t transfer (yet) any posts which needed additional files to exist on my own server, those are a bit more troublesome, so later. All in all, the content of the posts are presented as they are, or were, typos and all, making these archives a genuine representation of my frame of mind circa 2002.\u003c/p\u003e\n\u003cp\u003eThe purpose of this exercise is of course for posterity. Putting all these posts in one place makes it easy for me to export them in some method in the future. (And even if blogger goes down for some reason, these posts are now also hosted on my fateback account, and you know there\u0026rsquo;s safety in redundancy.) So, past memories safely preserved.\u003c/p\u003e\n\u003cp\u003eAfter all, that\u0026rsquo;s what a journal should be about right? Something that lets you look back into the past, to see what B*S you were trying to put out back then. Online journals are roughly ten thousand times more exciting than private ones; if you\u0026rsquo;re honest enough (i.e., you don\u0026rsquo;t edit out any embarassing stuff from old posts), there\u0026rsquo;s always the tendency for something from the past to come back and bite you in the ass.\u003c/p\u003e\n\u003cp\u003eAs an example, in the last post I made a comment about how I may have pissed my dentist off. It\u0026rsquo;s a funny story actually. I wanted to post, but was in too much tooth-pain to think clearly; so after the tooth-pain cleared, I decided to \u003ca href=\"http://roytang.net/blog/?p=93\"\u003epost about it\u003c/a\u003e. (Note to future self: even if you move to a different server, keep the fateback account, so these permalinks would still actually work.) About a week after that, I sent an email to my dentist, (wow, I exchange email with my dentist, I\u0026rsquo;m like, so cutting edge, for 1999) and she read the blog entry. She mailed me back saying the post \u0026ldquo;knocked her off her chair\u0026rdquo;, or something. I emailed back, saying it was just an exaggeration, hoping I didn\u0026rsquo;t piss her off. She hasn\u0026rsquo;t responded yet though (and I haven\u0026rsquo;t needed any dentist-time lately), so I conclude that there\u0026rsquo;s a distinct possibility I may actually have pissed her off. I\u0026rsquo;ll found out when I need to get this impacted molar removed, I suppose.\u003c/p\u003e\n\u003cp\u003eSo, anyway, yeah. Coming back to bite you in the ass. And for this reason, I\u0026rsquo;m hesitant to let anyone at work know about this blog. (At least one person at work knows it exists, but does not know the location) My long-term memory is a bit stupid, I may have inadvertently said something here that may be bad for me professionally, I\u0026rsquo;m not really sure. And of course I have no idea how a certain someone would react to me publishing on the internet my feelings about her.\u003c/p\u003e\n\u003cp\u003eWhat am I saying? Am I going to be more circumspect in the future, and avoid anything that may get me in trouble? Hell, no. Although I did breifly consider taking down the \u003ca href=\"http://roytang.net/blog/?p=64\"\u003eUnrequited\u003c/a\u003e post, I\u0026rsquo;m pretty sure I should stand for what I\u0026rsquo;ve written. No matter how bad, sappy, or stupid it was, it\u0026rsquo;s my work, I should just take it for what it is. Hence bringing back the old posts.\u003c/p\u003e\n\u003cp\u003eHmm\u0026hellip; I really only wanted to post that I was bringing back the old posts. I talk a lot.\u003c/p\u003e\n",
            "summary": "If you\u0026rsquo;ve been paying attention to this blog (yeah, you, both of you), you\u0026rsquo;ll notice that the archives now go all the way back to January of 2002. That\u0026rsquo;s when I started the site on topcities some time back. I moved some of the \u0026ldquo;journal\u0026rdquo; posts I had from there into blogger, using a very detailed process I shall refer to as \u0026ldquo;manual copy-and-paste and editing of links\u0026rdquo;. I still had some backup copies of most of the old site around, and archive.",
            "date_published": "2005-01-11T15:45:33+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2005/01/the-past-comes-back-to-haunt-us/index.md"
            , "tags": ["Meta"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2005/01/past-comes-back-to-haunt-us.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/2004-year-of-many-things/",
            "url": "https://mirror.roytang.net/2005/01/2004-year-of-many-things/",
            "path": "/2005/01/2004-year-of-many-things/",
            "title": "2004  -- Year of Many Things",
            "content_html": "\u003cblockquote\u003e\n\u003cp\u003e\u0026ldquo;So, what\u0026rsquo;s your New Year\u0026rsquo;s resolution?\u0026quot;_\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;I resolve to live life on purpose, to take control of my fate, to sieze each day as if it were my last. I will be reckless. I will be daring. I will be strong. I will challenge fate. I will defy the gods. Or I will die trying.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;\u0026hellip; Why can\u0026rsquo;t you just quit smoking or go on a diet like ordinary people?\u0026rdquo;\u003c/p\u003e\n\u003cp\u003e\u0026ldquo;It\u0026rsquo;s like you don\u0026rsquo;t know me at all. Life is too short to be ordinary.\u0026rdquo;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eSo the year 2004 has come and gone, never to be seen again, unless you look in the archives. This is my looking back/looking forward post, for the transition between 2004 and 2005, no more than eleven days late. (I\u0026rsquo;m part-Chinese, so I actually get to delay this until Chinese New Year, but I\u0026rsquo;m cool, so I\u0026rsquo;ll do it early.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e2004 Highlights\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn mostly chronological, but actually no particular, order:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eI dared to fall in love, consequently got my heart broken. Am still in the same place, apparently.\u003c/li\u003e\n\u003cli\u003eI was able to go outside the country for the first time.\u003c/li\u003e\n\u003cli\u003eBought a digital camera (and still no phone!)\u003c/li\u003e\n\u003cli\u003eWent to Bicol for the first time in eight years.\u003c/li\u003e\n\u003cli\u003eI passed the JITSE certification exam.\u003c/li\u003e\n\u003cli\u003eI got to read more.\u003c/li\u003e\n\u003cli\u003eI started to have health concerns.\u003c/li\u003e\n\u003cli\u003eOh, and I\u0026rsquo;m not sure, but I may very well have pissed off my dentist.\u003c/li\u003e\n\u003cli\u003eI started taking this blog a bit more seriously. Added the comments thing, made it a bit more public. My favorite post of this year: \u003ca href=\"http://roytang.net/2004/11/my-eyeglasses-belong-to-the-sea/\"\u003eMy Eyeglasses Belong to the Sea\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSeriously, I think I\u0026rsquo;ve changed a lot this past year. Especially due to the first entry above. Personally, I feel like I\u0026rsquo;ve broadened my horizons somewhat, I feel stronger, better as a person, more confident in myself. I\u0026rsquo;m a lot less antisocial now, and heaven forbid, I actually greet people in the office in the mornings and before I go home! Professionally, I feel like I\u0026rsquo;ve accomplished a lot as well. I learned a lot of new things; I\u0026rsquo;m a Web developer now, although my area of expertise is now apparently Oracle Reports; Participated in a lot more projects than I did in 2003, learned a lot of new stuff; Became a trainer for several batches of newbies (I think half the office calls me ‘Sir\u0026rsquo; now\u0026hellip; ); had my first ON, etc. All in all, a very productive/fruitful/exciting year was 2004.\u003c/p\u003e\n\u003cp\u003eAnd the future? What does 2005 hold for our brave not-so-young hero?\u003c/p\u003e\n\u003cp\u003eI tried thinking up some New Year\u0026rsquo;s resolutions, but, as many intelligent folk know, resolutions suck. Sure, they probably have some motivational value, but if you really know what you want, you shouldn\u0026rsquo;t need the end of an arbitrarily-decided calendar year to start. So, in lieu of resolutions, I present the following list of things-I-might-have-resolved-to-do:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBlog every day. This was a good idea, but I figured forcing yourself to do something regularly _just for the sake of it _was not a good thing. I\u0026rsquo;ll blog when I have something to say, thanks.\u003c/li\u003e\n\u003cli\u003eLearn to cook/bowl well. This sounds neat. But the real problem with me trying to learn new skills outside my comfort zone is that they tend to eat up goof-off time. But I _want _to learn new things. So, for this one, I\u0026rsquo;ll do \u0026lsquo;em if I can and I feel like it.\u003c/li\u003e\n\u003cli\u003eLearn PHP/mySQL and use dynamic stuff for this website. This is an easier proposition, since it\u0026rsquo;s something that falls well within one of my areas of interest (coding). However, I already code a lot at work, so I\u0026rsquo;m not really that motivated to code outside of work. I think I may be able to do this to some degree or other though.\u003c/li\u003e\n\u003cli\u003eBroaden my horizons. Do new things. Visit new places. This is a good idea. And I hope I can do it some. But I won\u0026rsquo;t resolve to do it.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThat\u0026rsquo;s it I guess, let\u0026rsquo;s see what 2005 has in store for us. Bring it!\u003c/p\u003e\n",
            "summary": "\u0026ldquo;So, what\u0026rsquo;s your New Year\u0026rsquo;s resolution?\u0026quot;_\n\u0026ldquo;I resolve to live life on purpose, to take control of my fate, to sieze each day as if it were my last. I will be reckless. I will be daring. I will be strong. I will challenge fate. I will defy the gods. Or I will die trying.\u0026rdquo;\n\u0026ldquo;\u0026hellip; Why can\u0026rsquo;t you just quit smoking or go on a diet like ordinary people?",
            "date_published": "2005-01-11T12:50:17+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2005/01/2004-year-of-many-things/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2005/01/2004-year-of-many-things.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/star-ocean-3-invention-calc/",
            "url": "https://mirror.roytang.net/2005/01/star-ocean-3-invention-calc/",
            "path": "/2005/01/star-ocean-3-invention-calc/",
            "title": "Star Ocean 3 Invention Calc",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-07T14:36:28+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/star-ocean-3-invention-calc/index.md"
            , "tags": ["games"]
            
            ,"link": "http://www.crashedweb.com/so3/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/top-100-project-gutenberg/",
            "url": "https://mirror.roytang.net/2005/01/top-100-project-gutenberg/",
            "path": "/2005/01/top-100-project-gutenberg/",
            "title": "Top 100 - Project Gutenberg",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-04T14:45:40+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/top-100-project-gutenberg/index.md"
            , "tags": ["books"]
            
            ,"link": "http://www.gutenberg.org/browse/scores/top"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/programming-ruby-the-pragmatic-programmer-s-guide/",
            "url": "https://mirror.roytang.net/2005/01/programming-ruby-the-pragmatic-programmer-s-guide/",
            "path": "/2005/01/programming-ruby-the-pragmatic-programmer-s-guide/",
            "title": "Programming Ruby: The Pragmatic Programmer's Guide",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-03T16:43:32+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2005/01/programming-ruby-the-pragmatic-programmer-s-guide/index.md"
            , "tags": ["coding-tutorials","ruby"]
            
            ,"link": "http://whytheluckystiff.net/ruby/pickaxe/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/01/",
            "url": "https://mirror.roytang.net/2005/01/",
            "path": "/2005/01/",
            "title": "Monthly Archives for 01 2005",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2005-01.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2005/",
            "url": "https://mirror.roytang.net/2005/",
            "path": "/2005/",
            "title": "Yearly Archives for 2005",
            "content_html": "",
            "summary": "",
            "date_published": "2005-01-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archy",
            "source_path": "archy/2005.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/exciting-christmas-stories/",
            "url": "https://mirror.roytang.net/2004/12/exciting-christmas-stories/",
            "path": "/2004/12/exciting-christmas-stories/",
            "title": "Exciting Christmas Stories",
            "content_html": "\u003cp\u003efeaturing: Superman, Wonder Woman, and Batman\u003c/p\u003e\n",
            "summary": "featuring: Superman, Wonder Woman, and Batman",
            "date_published": "2004-12-30T17:42:24+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/exciting-christmas-stories/index.md"
            , "tags": ["xmas","superheroes"]
            
            ,"link": "http://nexus.colum.edu/user/morris/heroxmas.htm"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/best-galaxian-player-ever/",
            "url": "https://mirror.roytang.net/2004/12/best-galaxian-player-ever/",
            "path": "/2004/12/best-galaxian-player-ever/",
            "title": "Best Galaxian player ever",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-27T15:20:44+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/best-galaxian-player-ever/index.md"
            , "tags": ["articles","games"]
            
            ,"link": "http://news.bbc.co.uk/2/hi/uk_news/england/manchester/4119613.stm"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/teach-yourself-programming-in-ten-years/",
            "url": "https://mirror.roytang.net/2004/12/teach-yourself-programming-in-ten-years/",
            "path": "/2004/12/teach-yourself-programming-in-ten-years/",
            "title": "Teach Yourself Programming in Ten Years",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-26T08:53:12+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/teach-yourself-programming-in-ten-years/index.md"
            , "tags": ["articles","software-development"]
            
            ,"link": "http://www.norvig.com/21-days.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/the-graphing-calculator-story/",
            "url": "https://mirror.roytang.net/2004/12/the-graphing-calculator-story/",
            "path": "/2004/12/the-graphing-calculator-story/",
            "title": "The Graphing Calculator Story",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-25T04:51:48+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/the-graphing-calculator-story/index.md"
            , "tags": ["software-development"]
            
            ,"link": "http://www.pacifict.com/Story/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/jasonzada-com-2004-very-rare-holiday-album/",
            "url": "https://mirror.roytang.net/2004/12/jasonzada-com-2004-very-rare-holiday-album/",
            "path": "/2004/12/jasonzada-com-2004-very-rare-holiday-album/",
            "title": "JasonZada.com (( 2004 )) - very rare holiday album",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-24T17:44:05+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/jasonzada-com-2004-very-rare-holiday-album/index.md"
            , "tags": ["music","xmas"]
            
            ,"link": "http://www.jasonzada.com/previous/003475.php"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/bramcohen-great-programmers/",
            "url": "https://mirror.roytang.net/2004/12/bramcohen-great-programmers/",
            "path": "/2004/12/bramcohen-great-programmers/",
            "title": "bramcohen: Great Programmers",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-24T15:30:50+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/bramcohen-great-programmers/index.md"
            , "tags": ["blogs","software-development"]
            
            ,"link": "http://www.livejournal.com/users/bramcohen/4563.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/christmas-of-2004/",
            "url": "https://mirror.roytang.net/2004/12/christmas-of-2004/",
            "path": "/2004/12/christmas-of-2004/",
            "title": "Christmas of 2004",
            "content_html": "\u003cp\u003eI usually prefer my holidays to be times of rest. Times to be free from work and stress, to indulge in things I like to do. I\u0026rsquo;ve just realized that Christmas is a rather stressful season.\u003c/p\u003e\n\u003cp\u003eFor one thing, there\u0026rsquo;s the multitude of Christmas gatherings one has to attend. With family. With relatives. With friends. With friends of family. With coworkers. With coworkers who are friends. It\u0026rsquo;s not that I don\u0026rsquo;t enjoy myself at these gatherings mind you. In fact, lately I\u0026rsquo;ve found myself enjoying the company of other people more. It\u0026rsquo;s just that I\u0026rsquo;m not yet an entirely social person, and too many social gatherings too soon somewhat stretches the limits of my comfort zone.\u003c/p\u003e\n\u003cp\u003eChristmas is stressful. Everyone is busy, busy, busy. Going from place to place apparently, as the traffic has been horrible lately, with jams stretching well into the early morning.\u003c/p\u003e\n\u003cp\u003eSpeaking of early morning, I left work close to midnight last night. We\u0026rsquo;ve been in crunch mode for the past two weeks or so, what with multiple deadlines coming up in January. Not that I can\u0026rsquo;t handle of course. But it doesn\u0026rsquo;t help that every other developer in one of my projects is going to be on vacation next week. Since I\u0026rsquo;ve had to run on pure genius these past few days, and as side effect, I was often more loud, sarcastic and smarmy than usual. To anyone who was annoyed by this, I apologize.\u003c/p\u003e\n\u003cp\u003eAnd the highlight of my last day of work before Christmas? Sometime before dinner I wrote a love letter and sent it by email to \u003ca href=\"http://roytang.net/blog/?p=53\"\u003eher\u003c/a\u003e. Nothing much, just telling her some things I wanted her to know, and greeting her for the holidays and stuff. I wasn\u0026rsquo;t expecting anything back, but I guess I got lucky. A few minutes before I left the office, I got a jabber message from her. To paraphrase:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cpre\u003eher: boo!\n\u003c/blockquote\u003e\n\u003cp\u003eher: thanks for the lovely letter :)\nme: I\u0026rsquo;m glad you liked it. my christmas is complete :)\n\u003c/pre\u003e\u003c/p\u003e\n\u003cp\u003eThere was more of course, a small exchange of pleasantries and even more holiday greetings. But I got that warm, fuzzy feeling again. Maybe Christmas this year wasn\u0026rsquo;t so bad after all. =)\u003c/p\u003e\n\u003cp\u003eHappy Holidays!\u003c/p\u003e\n",
            "summary": "I usually prefer my holidays to be times of rest. Times to be free from work and stress, to indulge in things I like to do. I\u0026rsquo;ve just realized that Christmas is a rather stressful season.\nFor one thing, there\u0026rsquo;s the multitude of Christmas gatherings one has to attend. With family. With relatives. With friends. With friends of family. With coworkers. With coworkers who are friends. It\u0026rsquo;s not that I don\u0026rsquo;t enjoy myself at these gatherings mind you.",
            "date_published": "2004-12-24T14:34:13+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2004/12/christmas-of-2004/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/christmas-of-2004.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/excel-problem/",
            "url": "https://mirror.roytang.net/2004/12/excel-problem/",
            "path": "/2004/12/excel-problem/",
            "title": "Excel problem",
            "content_html": "\u003cp\u003eThe Christmas season has been hellacious. Deadlines to catch up with at the start of the next year meant crunch time for most of the past two weeks. So, for my first blog post on my first rest day in a while, I\u0026rsquo;ll bring home some work.\u003c/p\u003e\n\u003cp\u003eI have a problem with Excel. I\u0026rsquo;m writing a web app that generates HTML files which are exported to Excel. In most cases, it\u0026rsquo;s easy, I just follow the template generated by using Excel-\u0026gt;File-\u0026gt;Save As-\u0026gt;HTML\u003c/p\u003e\n\u003cp\u003eHowever, I\u0026rsquo;ve encountered a problem. One of my reports needs to show two tables side-by-side in Excel, but I have to generate the rows for each table independently (i.e. from separate SQL queries). My first thought was to use tables-within-a-table in the HTML source, but it seems that Excel loses the column widths (i.e., the column widths change from what I\u0026rsquo;ve set them to before) when I try to create a new table inside one of the existing s\u003c/p\u003e\n\u003cp\u003eI need to preserve the widths of the columns outside the inner table. Any idea how this can be done? Or maybe someone can point me to online resources that might help?\u003c/p\u003e\n\u003cp\u003eUnfortunately, this has been sort of a low-pri task for me, so I haven\u0026rsquo;t had much time to check it out; but the deadline is creeping up on me fast. I\u0026rsquo;ve posted on some forums and asked around, but no positive responses so far. Any assistance is appreciated.\u003c/p\u003e\n",
            "summary": "The Christmas season has been hellacious. Deadlines to catch up with at the start of the next year meant crunch time for most of the past two weeks. So, for my first blog post on my first rest day in a while, I\u0026rsquo;ll bring home some work.\nI have a problem with Excel. I\u0026rsquo;m writing a web app that generates HTML files which are exported to Excel. In most cases, it\u0026rsquo;s easy, I just follow the template generated by using Excel-\u0026gt;File-\u0026gt;Save As-\u0026gt;HTML",
            "date_published": "2004-12-24T13:30:39+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2004/12/excel-problem/index.md"
            , "tags": ["Software Development"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/excel-problem.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/fimoculous-com-feeding-on-itself/",
            "url": "https://mirror.roytang.net/2004/12/fimoculous-com-feeding-on-itself/",
            "path": "/2004/12/fimoculous-com-feeding-on-itself/",
            "title": "Fimoculous.com: Feeding On Itself",
            "content_html": "\u003cp\u003eDec. 21 2004: Blogs of the Year\u003c/p\u003e\n",
            "summary": "Dec. 21 2004: Blogs of the Year",
            "date_published": "2004-12-24T05:52:15+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/fimoculous-com-feeding-on-itself/index.md"
            , "tags": ["blogs"]
            
            ,"link": "http://www.fimoculous.com/archive/post-748.cfm"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/the-best-webcomics-of-2004/",
            "url": "https://mirror.roytang.net/2004/12/the-best-webcomics-of-2004/",
            "path": "/2004/12/the-best-webcomics-of-2004/",
            "title": "The Best Webcomics of 2004",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-14T15:21:58+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/the-best-webcomics-of-2004/index.md"
            , "tags": ["webcomics"]
            
            ,"link": "http://webcomicsreview.com/examiner/issue041213/top2004.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/the-most-popular-color-in-the-world-is-blue/",
            "url": "https://mirror.roytang.net/2004/12/the-most-popular-color-in-the-world-is-blue/",
            "path": "/2004/12/the-most-popular-color-in-the-world-is-blue/",
            "title": "the most popular color in the world is blue",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-14T14:08:44+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/the-most-popular-color-in-the-world-is-blue/index.md"
            , "tags": ["cool"]
            
            ,"link": "http://channels.netscape.com/ns/homerealestate/package.jsp?name=fte/popularcolor/popularcolor\u0026floc=HR-1_T"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/waiter-rant/",
            "url": "https://mirror.roytang.net/2004/12/waiter-rant/",
            "path": "/2004/12/waiter-rant/",
            "title": "Waiter Rant",
            "content_html": "\u003cp\u003ewaiter blog\u0026hellip;interesting read\u003c/p\u003e\n",
            "summary": "waiter blog\u0026hellip;interesting read",
            "date_published": "2004-12-12T15:29:43+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/waiter-rant/index.md"
            , "tags": ["blogs"]
            
            ,"link": "http://waiterrant.blogspot.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/mighty-forest-ranger-taxi-driver/",
            "url": "https://mirror.roytang.net/2004/12/mighty-forest-ranger-taxi-driver/",
            "path": "/2004/12/mighty-forest-ranger-taxi-driver/",
            "title": "Mighty Forest Ranger Taxi Driver",
            "content_html": "\u003cp\u003eEvil illegal loggers have been in the news lately, mainly due to their being blamed as scapegoats for the rash of flooding during the last two typhoons that left hundreds, maybe thousands, dead in their wake and strewing devastation upon this blighted land. I\u0026rsquo;m not here to talk about whether the loggers are indeed to blame, or how it\u0026rsquo;s silly for the government to try to implement a total log ban when they can\u0026rsquo;t even implement a selective log ban, or how chances are everyone important will forget about this in, say a month tops, while the victims continue their struggle to recover even a fraction of their once-normal lives. No, these topics have already been covered to death in serious newspaper editorials and columns. And possible internet discussions in Pinoy-bloggerland, I don\u0026rsquo;t know, I\u0026rsquo;m not particularly familiar with that scene.\u003c/p\u003e\n\u003cp\u003eNo, as always, I prefer to attack this from a more personal angle. And like some of my more interesting stories, this one is about a taxi driver.\u003c/p\u003e\n\u003cp\u003eHe was a bit old, and his first few attempts at conversation were annoying at best. Later, toward the end of the trip, we glimpsed one of the day\u0026rsquo;s headlines on some tabloid. Something about the government wanting to implement a total log ban. He goes on to say that\u0026rsquo;s an impossible thing, they\u0026rsquo;d never be able to implement it.\u003c/p\u003e\n\u003cp\u003eTurns out he worked for the Department of Environment and Natural Resources for some fifteen-odd years. As a forest ranger. Wow.\u003c/p\u003e\n\u003cp\u003eNow of course, as someone who indulges often in the fantasy genre, my idea of ‘Forest Rangers\u0026rsquo; is closely associated either Aragorn from Lord of the Rings, or someone who likes to stop bears from stealing picnic baskets. This guy leaned more towards the latter.\u003c/p\u003e\n\u003cp\u003eBased on his stories, it seems like the news articles detailing the lack of manpower at the DENR are accurate. He says forest rangers were often assigned to guard or patrol some forty hectares of land. Or maybe it was four hectares, I forget — I had this conversation more than three days ago. In any case, I have no idea how large a hectare is anyway. But from his narratives it seemed like the area assigned to them was far too much for one man to cover. Add to that the fact that he and his co-rangers were often harassed by Communist rebels that are supposedly in bed with the illegal loggers, and life was really difficult for them back then. It was a much easier life to just while away your day slacking or goofing off, rather than risk your own life to try to catch some illegal loggers who would probably get off the hook easily anyway.\u003c/p\u003e\n\u003cp\u003eHe told about treestampers. Or something like that. Basically, people whose job it is to mark trees to indicate which ones are okay for cutting by which company. Or something. Forgive me; I\u0026rsquo;m really hazy on the details, maybe because I\u0026rsquo;m sleepy. Anyway, apparently a lot of these treestampers have lifestyles far beyond their income. When the bribe money comes in, it\u0026rsquo;s a race to mark trees, with no regard for the tree\u0026rsquo;s age or species or location or whatnot.\u003c/p\u003e\n\u003cp\u003eI\u0026rsquo;m not sure what I have to say about this, I just thought the hearsay I got from him would be interesting to relate. I\u0026rsquo;m not exactly a radical environmentalist. As a friend of mine once said, \u0026ldquo;Trees? What have they ever done for me?\u0026rdquo; I\u0026rsquo;m a city dude, born and bred, so I seldom worry about such things, it\u0026rsquo;s not really part of my thinking. And I don\u0026rsquo;t really think I can judge people who live on a small government subsidy and have to do what they can to get a decent living. Hey, we\u0026rsquo;re all just out to make some scratch, right? Except that the living some of these guys make may have cost countless lives and destruction of property. Sadly, I think this is just part of the general malaise that plagues our society. Resources are scarce, so the less fortunate among us are forged to scrounge around for whatever we can, the law and the environment be damned. Of course, it doesn\u0026rsquo;t help that the rest of the country only gives a damn shortly after a tragedy happens. Will we ever learn?\u003c/p\u003e\n",
            "summary": "Evil illegal loggers have been in the news lately, mainly due to their being blamed as scapegoats for the rash of flooding during the last two typhoons that left hundreds, maybe thousands, dead in their wake and strewing devastation upon this blighted land. I\u0026rsquo;m not here to talk about whether the loggers are indeed to blame, or how it\u0026rsquo;s silly for the government to try to implement a total log ban when they can\u0026rsquo;t even implement a selective log ban, or how chances are everyone important will forget about this in, say a month tops, while the victims continue their struggle to recover even a fraction of their once-normal lives.",
            "date_published": "2004-12-12T15:13:02+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2004/12/mighty-forest-ranger-taxi-driver/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/mighty-forest-ranger-taxi-driver.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/i-get-bored-easily/",
            "url": "https://mirror.roytang.net/2004/12/i-get-bored-easily/",
            "path": "/2004/12/i-get-bored-easily/",
            "title": "I Get Bored Easily",
            "content_html": "\u003cp\u003eAnd that explains why this blog\u0026rsquo;s layout has changed again.\u003c/p\u003e\n\u003cp\u003eI would have posted this (and some other stuff) earlier, but I was in AN ETERNITY OF PAIN for the past two and a half hours. I would like to take this time to berate my stupid, stupid impacted molar, and the stupid, stupid painkillers that took over two hours to kick in. Along with my stupid, stupid thyroid gland, which, because of hyperthyroidism, prevents me from having dental surgery on this sucker.\u003c/p\u003e\n\u003cp\u003eI will also thank God profusely for releasing me from this ETERNITY OF PAIN. It\u0026rsquo;s times like these I am glad I believe in a deity from whom I can request deliverance.\u003c/p\u003e\n\u003cp\u003eDid I mention how painful it was? All the way to my left ear, damnit.\u003c/p\u003e\n",
            "summary": "And that explains why this blog\u0026rsquo;s layout has changed again.\nI would have posted this (and some other stuff) earlier, but I was in AN ETERNITY OF PAIN for the past two and a half hours. I would like to take this time to berate my stupid, stupid impacted molar, and the stupid, stupid painkillers that took over two hours to kick in. Along with my stupid, stupid thyroid gland, which, because of hyperthyroidism, prevents me from having dental surgery on this sucker.",
            "date_published": "2004-12-09T17:12:45+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2004/12/i-get-bored-easily/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/i-get-bored-easily.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/tweakfactor-com-firefox-tweak-guide-page-4-get-your-tweak-on/",
            "url": "https://mirror.roytang.net/2004/12/tweakfactor-com-firefox-tweak-guide-page-4-get-your-tweak-on/",
            "path": "/2004/12/tweakfactor-com-firefox-tweak-guide-page-4-get-your-tweak-on/",
            "title": "Tweakfactor.com: Firefox Tweak Guide - Page 4 - Get your tweak on!",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-09T16:29:58+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/tweakfactor-com-firefox-tweak-guide-page-4-get-your-tweak-on/index.md"
            , "tags": ["firefox"]
            
            ,"link": "http://www.tweakfactor.com/articles/tweaks/firefoxtweak/4.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/mind-hacks/",
            "url": "https://mirror.roytang.net/2004/12/mind-hacks/",
            "path": "/2004/12/mind-hacks/",
            "title": "Mind Hacks",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-09T08:08:19+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/mind-hacks/index.md"
            , "tags": ["blogs","lifehacks"]
            
            ,"link": "http://www.mindhacks.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/the-legendary-lily-pad/",
            "url": "https://mirror.roytang.net/2004/12/the-legendary-lily-pad/",
            "path": "/2004/12/the-legendary-lily-pad/",
            "title": "The Legendary Lily Pad",
            "content_html": "\u003cp\u003eflash movies\u003c/p\u003e\n",
            "summary": "flash movies",
            "date_published": "2004-12-07T15:46:42+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/the-legendary-lily-pad/index.md"
            , "tags": ["flash"]
            
            ,"link": "http://legendaryfrog.com/heavy/index.htm"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/how-i-beat-star-ocean-till-the-end-of-time/",
            "url": "https://mirror.roytang.net/2004/12/how-i-beat-star-ocean-till-the-end-of-time/",
            "path": "/2004/12/how-i-beat-star-ocean-till-the-end-of-time/",
            "title": "How I beat Star Ocean Till the End of Time",
            "content_html": "\u003cp\u003ean arrogant fellow, I like him :D\u003c/p\u003e\n",
            "summary": "an arrogant fellow, I like him :D",
            "date_published": "2004-12-07T15:30:49+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/how-i-beat-star-ocean-till-the-end-of-time/index.md"
            , "tags": ["games"]
            
            ,"link": "http://www.geocities.com/ryukaiderso/starocean/sovictory.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/team-sealed/",
            "url": "https://mirror.roytang.net/2004/12/team-sealed/",
            "path": "/2004/12/team-sealed/",
            "title": "Team Sealed!",
            "content_html": "\u003cblockquote\u003e\n\u003cp\u003eMike: I thought you were broke?\u003c/p\u003e\n\u003cp\u003eMe: That\u0026rsquo;s just a lie I tell people who ask me for money.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eI forgot to talk about this. We played \u003ca href=\"http://www.wizards.com/magic/displayexpansion.asp?set=chk\u0026amp;page=1\"\u003eChampions of Kamigawa\u003c/a\u003e Team Sealed a couple of weekends back. For the uninitiated, ChK is a Magic:the Gathering set, and Team Sealed is our favorite limited format! I think it\u0026rsquo;s mostly because if we lose, I can blame my teammates for screwing up, unlike in regular tournaments where it really is my fault. :p And if we win? Free cards!\u003c/p\u003e\n\u003cp\u003eOf course, we didn\u0026rsquo;t win. I\u0026rsquo;d like to say it was primarily because of a bad set of cards we got (I think we were the only team that didn\u0026rsquo;t get a Honden or two\u0026hellip; ), but we really made a lot of mistakes. Of well, it was a learning experience. An expensive one.\u003c/p\u003e\n",
            "summary": "Mike: I thought you were broke?\nMe: That\u0026rsquo;s just a lie I tell people who ask me for money.\n I forgot to talk about this. We played Champions of Kamigawa Team Sealed a couple of weekends back. For the uninitiated, ChK is a Magic:the Gathering set, and Team Sealed is our favorite limited format! I think it\u0026rsquo;s mostly because if we lose, I can blame my teammates for screwing up, unlike in regular tournaments where it really is my fault.",
            "date_published": "2004-12-06T13:59:44+00:00",
            "date_modified": "2020-09-26T17:21:30+08:00",
            "section": "post",
            "source_path": "post/2004/12/team-sealed/index.md"
            , "tags": ["mtg"]
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/team-sealed.html"}]
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/a-new-dawn-may-rise/",
            "url": "https://mirror.roytang.net/2004/12/a-new-dawn-may-rise/",
            "path": "/2004/12/a-new-dawn-may-rise/",
            "title": "A New Dawn May Rise",
            "content_html": "\u003cp\u003eA new hand has been dealt, the game has changed but the stakes remain the same. Fate tempts me with its\u0026rsquo; winds of change, and what once was thought lost forever may once again be within reach. This time I tread carefully however, as my recklessness may once again be the bane of my quest. Hold my hands close to my chest, bide my time, and see what the fates have in store for our hero\u0026hellip;\u003c/p\u003e\n",
            "summary": "A new hand has been dealt, the game has changed but the stakes remain the same. Fate tempts me with its\u0026rsquo; winds of change, and what once was thought lost forever may once again be within reach. This time I tread carefully however, as my recklessness may once again be the bane of my quest. Hold my hands close to my chest, bide my time, and see what the fates have in store for our hero\u0026hellip;",
            "date_published": "2004-12-06T13:35:03+00:00",
            "date_modified": "2019-09-21T19:59:59+08:00",
            "section": "post",
            "source_path": "post/2004/12/a-new-dawn-may-rise/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/new-dawn-may-rise.html"}]
            
            , "comments": [
                { 
                    "url": "",
                    "source_file": "comment-20041207214700-wp-Anonymous.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/insert-credit/",
            "url": "https://mirror.roytang.net/2004/12/insert-credit/",
            "path": "/2004/12/insert-credit/",
            "title": "| insert credit |",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-05T13:48:30+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/insert-credit/index.md"
            , "tags": ["games"]
            
            ,"link": "http://www.insertcredit.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/mmcafe-com-the-madman-s-cafe-serving-game-news-fresh-off-the-grill-since-19/",
            "url": "https://mirror.roytang.net/2004/12/mmcafe-com-the-madman-s-cafe-serving-game-news-fresh-off-the-grill-since-19/",
            "path": "/2004/12/mmcafe-com-the-madman-s-cafe-serving-game-news-fresh-off-the-grill-since-19/",
            "title": "MMCafe.com - The Madman's Cafe -- Serving Game News Fresh Off the Grill since 19...",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-05T13:19:15+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/mmcafe-com-the-madman-s-cafe-serving-game-news-fresh-off-the-grill-since-19/index.md"
            , "tags": ["games"]
            
            ,"link": "http://www.planetps2.com/mmcafe/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/c-evo-homepage/",
            "url": "https://mirror.roytang.net/2004/12/c-evo-homepage/",
            "path": "/2004/12/c-evo-homepage/",
            "title": "C-evo Homepage",
            "content_html": "\u003cp\u003eDelphi-based Civ clone\u003c/p\u003e\n",
            "summary": "Delphi-based Civ clone",
            "date_published": "2004-12-05T09:20:25+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/c-evo-homepage/index.md"
            , "tags": ["freeware","games"]
            
            ,"link": "http://c-evo.org/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/hikoza-n-chi-x-games/",
            "url": "https://mirror.roytang.net/2004/12/hikoza-n-chi-x-games/",
            "path": "/2004/12/hikoza-n-chi-x-games/",
            "title": "Hikoza'n-CHI X - Games",
            "content_html": "\u003cp\u003ewarning forever and shooters soltude\u003c/p\u003e\n",
            "summary": "warning forever and shooters soltude",
            "date_published": "2004-12-05T09:11:19+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/hikoza-n-chi-x-games/index.md"
            , "tags": ["freeware","games"]
            
            ,"link": "http://www18.big.or.jp/~hikoza/Prod/index_e.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/practical-php-programming/",
            "url": "https://mirror.roytang.net/2004/12/practical-php-programming/",
            "path": "/2004/12/practical-php-programming/",
            "title": "Practical PHP Programming",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-05T08:33:23+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/practical-php-programming/index.md"
            , "tags": ["coding-tutorials","php"]
            
            ,"link": "http://www.hudzilla.org/php/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/free-programming-and-computer-science-books/",
            "url": "https://mirror.roytang.net/2004/12/free-programming-and-computer-science-books/",
            "path": "/2004/12/free-programming-and-computer-science-books/",
            "title": "Free Programming and Computer Science Books",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-05T00:11:38+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/free-programming-and-computer-science-books/index.md"
            , "tags": ["books","tech"]
            
            ,"link": "http://techbooksforfree.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/sandhill-trek-why-do-we-blog/",
            "url": "https://mirror.roytang.net/2004/12/sandhill-trek-why-do-we-blog/",
            "path": "/2004/12/sandhill-trek-why-do-we-blog/",
            "title": "Sandhill Trek: Why Do We Blog?",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-02T21:15:58+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/sandhill-trek-why-do-we-blog/index.md"
            , "tags": ["articles","blogs"]
            
            ,"link": "http://sandhill.typepad.com/sandhill_trek/2004/11/why_do_we_blog.html"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/free-pdf-converter-create-high-quality-pdf-from-any-printable-file-type/",
            "url": "https://mirror.roytang.net/2004/12/free-pdf-converter-create-high-quality-pdf-from-any-printable-file-type/",
            "path": "/2004/12/free-pdf-converter-create-high-quality-pdf-from-any-printable-file-type/",
            "title": "Free PDF Converter - create high-quality PDF from any printable file type",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-02T14:26:10+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/free-pdf-converter-create-high-quality-pdf-from-any-printable-file-type/index.md"
            , "tags": ["tools"]
            
            ,"link": "http://www.primopdf.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/using-a-hosts-file-to-make-the-internet-not-suck-as-much/",
            "url": "https://mirror.roytang.net/2004/12/using-a-hosts-file-to-make-the-internet-not-suck-as-much/",
            "path": "/2004/12/using-a-hosts-file-to-make-the-internet-not-suck-as-much/",
            "title": "Using a Hosts File To Make The Internet Not Suck (as much)",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-02T14:25:11+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/using-a-hosts-file-to-make-the-internet-not-suck-as-much/index.md"
            , "tags": ["web"]
            
            ,"link": "http://someonewhocares.org/hosts/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/requiem/",
            "url": "https://mirror.roytang.net/2004/12/requiem/",
            "path": "/2004/12/requiem/",
            "title": "Requiem",
            "content_html": "\u003cp\u003eSir Alexander Alix, quintessential Pisay trigo and calculus teacher, passed away recently due to cirrhosis of the liver. There\u0026rsquo;s a service for him at Pisay tomorrow, Dec. 3, Friday. Since I doubt I can go, I\u0026rsquo;ll say my piece here.\u003c/p\u003e\n\u003cp\u003eAlix was a helluva guy. Friendly and gets well with the students. And he gave high grades. Seriously. He gave me flat 1.0s (highest possible grade) for all four quarters of fourth year math. Now, not to brag, when I was in high school, math was my thing. Seriously, I could breeze through my high school math classes in my sleep. And few of my batch mates will contradict me when I say I was one of the best, if not _the _best in math in our batch. (That last part is debatable, \u003ca href=\"http://www.livejournal.com/users/zukeeper/\"\u003esome people \u003c/a\u003emight contest it. :p) The point of this is not me bragging, since I do that often, it\u0026rsquo;s nothing special. No, the point is that I seldom took math period seriously. I often spent math class doodling something in my notebooks, at least on those occasions that I had a pen.\u003c/p\u003e\n\u003cp\u003eOn one such math class, Alix caught me and a classmate (you know who you are\u0026hellip; ) passing around a hand-drawn comic strip in class. (During my high school days, I often spent my free energy drawing such small strips about classroom happenings, particularly in the second year. Alas, none of the aforementioned high-school artworks have survived. But I digress.) I got a severe tongue-lashing for that one, something along the lines of \u0026ldquo;No matter how good you are at math, you can\u0026rsquo;t just goof off in class.\u0026rdquo; I felt quite bad about the incident, not only because I got to eat some humble pie in front of the class, but mostly because I felt like I had disappointed the guy. It\u0026rsquo;s not that I don\u0026rsquo;t goof off in other classes, I certainly do; but I felt that Alix expected more of me, since for some reason he believed me to be a good student. I didn\u0026rsquo;t have the nerve to respond or apologize to him about this, I just took my tongue-lashing in silence. I wish I had told him I was sorry. I realize this is such a small, trivial matter, but God knows I like to obsess over small, trivial matters.\u003c/p\u003e\n\u003cp\u003eIn any case, cheers to you sir Alix, wherever you may be. I don\u0026rsquo;t spend much time with the other alumni, but over the past few days, I\u0026rsquo;ve seen the news of your passing spread through the online Pisay alumni community quickly, and many are planning to be there Friday. Rest well, sir Alix, and know that your students look back at you fondly.\u003c/p\u003e\n",
            "summary": "Sir Alexander Alix, quintessential Pisay trigo and calculus teacher, passed away recently due to cirrhosis of the liver. There\u0026rsquo;s a service for him at Pisay tomorrow, Dec. 3, Friday. Since I doubt I can go, I\u0026rsquo;ll say my piece here.\nAlix was a helluva guy. Friendly and gets well with the students. And he gave high grades. Seriously. He gave me flat 1.0s (highest possible grade) for all four quarters of fourth year math.",
            "date_published": "2004-12-02T13:11:14+00:00",
            "date_modified": "2019-09-21T19:59:59+08:00",
            "section": "post",
            "source_path": "post/2004/12/requiem/index.md"
            
            , "syndicated": [{"type":"blogger","url":"https://roywantsmeat.blogspot.com/2004/12/requiem.html"}]
            
            , "comments": [
                { 
                    "url": "http://www.blogger.com/profile/2001080",
                    "source_file": "comment-20041204094600-wp-btflpenguin.json"
                }, { 
                    "url": "http://www.blogger.com/profile/1694272",
                    "source_file": "comment-20041206221000-wp-Roy.json"
                }, { 
                    "url": "",
                    "source_file": "comment-20041209004100-wp-Anonymous.json"
                }, { 
                    "url": "http://www.blogger.com/profile/2001080",
                    "source_file": "comment-20041209230500-wp-btflpenguin.json"
                }
            ]
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/jennifer-government-nationstates-stone-cold-bison-scroll-islands/",
            "url": "https://mirror.roytang.net/2004/12/jennifer-government-nationstates-stone-cold-bison-scroll-islands/",
            "path": "/2004/12/jennifer-government-nationstates-stone-cold-bison-scroll-islands/",
            "title": "Jennifer Government: NationStates | Stone Cold Bison | Scroll Islands",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-01T15:18:06+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/12/jennifer-government-nationstates-stone-cold-bison-scroll-islands/index.md"
            , "tags": ["games","web-based-games"]
            
            ,"link": "http://www.nationstates.net/cgi-bin/index.cgi"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/12/",
            "url": "https://mirror.roytang.net/2004/12/",
            "path": "/2004/12/",
            "title": "Monthly Archives for 12 2004",
            "content_html": "",
            "summary": "",
            "date_published": "2004-12-01T00:00:00+00:00",
            "date_modified": "2019-08-09T01:14:44+08:00",
            "section": "archm",
            "source_path": "archm/2004-12.md"
            
            
            
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/11/pinoyhackers/",
            "url": "https://mirror.roytang.net/2004/11/pinoyhackers/",
            "path": "/2004/11/pinoyhackers/",
            "title": "Pinoyhackers",
            "content_html": "",
            "summary": "",
            "date_published": "2004-11-29T22:26:53+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/11/pinoyhackers/index.md"
            , "tags": ["hackers","pinoy"]
            
            ,"link": "http://www.geocities.com/pinoyhackers2000/index.htm"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/11/pinoy-tech-scene/",
            "url": "https://mirror.roytang.net/2004/11/pinoy-tech-scene/",
            "path": "/2004/11/pinoy-tech-scene/",
            "title": "Pinoy Tech Scene",
            "content_html": "",
            "summary": "",
            "date_published": "2004-11-29T22:26:01+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/11/pinoy-tech-scene/index.md"
            , "tags": ["blogs","pinoy","tech"]
            
            ,"link": "http://pinoytechscene.mparaz.com/"
            
            }
        
        , {
            "id": "https://mirror.roytang.net/2004/11/migs-paraz-what-is-not/",
            "url": "https://mirror.roytang.net/2004/11/migs-paraz-what-is-not/",
            "path": "/2004/11/migs-paraz-what-is-not/",
            "title": "Migs Paraz - What is Not",
            "content_html": "",
            "summary": "",
            "date_published": "2004-11-29T22:22:09+00:00",
            "date_modified": "2020-01-29T00:26:29+08:00",
            "section": "links",
            "source_path": "links/2004/11/migs-paraz-what-is-not/index.md"
            , "tags": ["blogs","pinoy","tech"]
            
            ,"link": "http://www.mparaz.com/w/index.php"
            
            }
        
    ]
     , "prev": "/p/369/feed.json" 
     , "next": "/p/371/feed.json" 
}